{
  "PageID": 10407,
  "PageGuid": "40ce71c1-d356-489a-addf-fb2f8a4c817f",
  "Title": "Erstellen eines lokalen Administrationsbenutzer per Gruppenrichtlinie",
  "Content": "Erstellen eines lokalen Administrationsbenutzer per Gruppenrichtlinie\r\nDiese Anleitung zeigt wie Sie einen Domänenbenutzer jedem Computer im Netzwerk als lokaler Administrator zuweisen.\r\n1. Öffnen Sie die Gruppenrichtlinienverwaltung\r\n2. Erstellen Sie ein neues Gruppenrichtlinienobjekt mit dem Namen \"Topfact Update\"\r\n\r\n3. Öffnen Sie das neu erstellte Gruppenrichtlinienobjekt zum bearbeiten.\r\n4. Unter dem Knoten Benutzerkonfiguration, wählen Sie Einstellungen, Systemsteuerungseinstellungen, Lokale Benutzer und Gruppen. Dann rechte Maustaste und wählen Sie Neu, Lokaler Benutzer.\r\n\r\n\r\n5. In Aktion, Wählen Sie Aktualisieren. Benutzername wird \"TopfactUpdate\" sein. Unter vollem Namen, geben Sie einen beschreibenden Namen. Wählen Sie ein Kennwort in Kennwort und Kennwort bestätigen, und deaktivieren Sie Benutzer muss Kennwort bei der nächsten Anmeldung ändern, und überprüfen Sie Kennwort läuft nie ab. Klicken Sie auf OK.\r\n\r\n6. Wählen Sie jetzt neue \"Neue Lokale Gruppe\" aus.\r\n7. Wählen Sie unter Aktion \"Aktualisieren\", wählen Administratoren (integriert), und klicken Sie dann auf Hinzufügen unter Mitglieder. Geben Sie als Benutzername TopfactUpdate ein so wie oben beschrieben und klicken Sie auf OK.\r\n\r\n8. Verknüpfen Sie die Gruppenrichtlinie mit einer OU in ihrer Struktur. Die neue Gruppenrichtlinie wird nach spätestens 90 Minuten an alle PCs übertragen. Wenn Sie nicht so lange warten möchten, können Sie über die Eingabeaufforderung auf einer Arbeitsstation den Befehl \"gpupdate / force\" ausführen. Die Gruppenrichtlinie wird sofort ausgeführt.\r\n\r\n\r\nDas Ergebnis ist ein Domänenbenutzer der zentral an alle Arbeitsstationen verteilt wurde und der über lokale Adminrechte verfügt.\r\n\r\n\r\n\r\n\r\n\r\nHow to create local accounts via Group Policy\r\nThis step by step document shows how to create a local admin account across all domain joined PC’s for use with situations like LogMein remote support and notebooks, which are not always connected to the domain.\r\n1. Open Group Policy Management\r\n2. Create a new Group Policy Object called “Local Users Login Account” and link it to the appropriate OU.\r\n3. Open up the newly created GPO called “Local Users Login Account”.\r\n\r\n4. Under the User Configuration Node, Select Preferences, Control Panel Settings, Local Users and Groups. Then Right Click and select New, Local User\r\n\r\n5. In Action, Select Update. User name will be “RemoteAdmin”. Under Full name, type in a descriptive name. Select a password in Password and Confirm Password, and Uncheck User must change password at next logon, and check Password never expires. Leave Account never expires checked. Click on OK.\r\n\r\n6. Now go to the Computer Configuration Node, and select Preferences, Control Panel Settings, Local Users and Groups. Right click and select New, Local Group.\r\n\r\n7. Under Action, select Update, in Group name, select Administrators (built-in), and then click on Add under Members. In the Add box, type in RemoteAdmin for the name and click OK. Now Click on OK again.\r\n\r\n8. Now wait for the group policy to update. If you don’t want to wait, you can open up a command prompt on a workstation and type “gpupdate /force”\r\nTroubleshooting:\r\nIf you see the user being created but not added to the local administrators group, take a look at where you are assigning the GPO to. Ensure you are assigning it to User objects and Computer Objects.",
  "Url": "https://services.topfact.de/wiki/pages/view?g=40ce71c1-d356-489a-addf-fb2f8a4c817f"
}