{
  "PageID": 11205,
  "PageGuid": "355ff198-3182-4055-b00c-1cb12f59a07a",
  "Title": "Cloud Varianten für DMS",
  "Content": "Thema: DMS Cloud\r\nDas Thema kann differenziert betrachtet werden. Im Grunde gibt es zwei Hauptlösungen:\r\n \r\n1. DocuWare Cloud als SAAS. \r\nDie Verantwortung der Daten wird an die DocuWare AG übertragen. DocuWare ist dann der Betreuer. Die DocuWare Anwendungen müssen von der DocuWare AG gemietet werden.\r\n \r\nVorteil:\r\na)      Bei Neuprojekten ggf. die direkt durch DocuWare organisiert werden.\r\n \r\n \r\nNachteile:\r\na)      die DocuWare Lizenzen die sind ggf. zu mieten\r\nb)      Abhängigkeit zum Hersteller bezgl. der Daten und Funktionen sind 100%\r\nc)       Die bisherigen Funktionen sind dann neu auf der SAAS-Umgebung zu implementieren.\r\nd)      Betreuung durch ein Support-Center mit unterschiedlichen Ansprechpartnern\r\n \r\n2. Privat Cloud Lösungen:\r\nDienstleister (ggf. auch regional) haben sich auf die Verwaltung von Servern und die administrative Betreuung der Anwendungen (DocuWare und topfact) spezialisiert und übernehmen den bestehenden Server inkl. der Daten 1:1 zu einem bestimmten Zeitpunkt. \r\n \r\nEs kann nahtlos weitergearbeitet werden. Der Server ist dann nicht mehr physikalisch durch den Kunden zu verwalten.\r\n \r\nVorteile: \r\na)      Es wird nur die Infrastruktur gemietet die wirklich benötigt wird.\r\nb)      2. Es fallen keine DocuWare Mietkosten an.\r\nc)       Die Logik des Systems und die Einrichtungen bleiben komplett erhalten.\r\nd)      Falls der Dienstleister gewechselt werden soll ist das jederzeit möglich.\r\ne)      Die Daten sind sicher, da der Kunde den Dienstleister persönlich aussucht und auditieren kann. Es ist kein Großanbieter der ggf. dem PATRIOT Act unterliegt, sondern Rechenzentrumsanbieter für individuelle Lösungen, die den Schutz vor dem Zugriff Dritter garantieren.\r\n \r\nNachteile:\r\na)      Ggf. Durch den Ausfall eine kleineren Anbieters (Personalwechsel oder wirtschaftliche Probleme). Da könnte aber jederzeit ein Wechsel zu einem anderen Anbieter erfolgen und das System umgezogen werden.",
  "Url": "https://services.topfact.de/wiki/pages/view?g=355ff198-3182-4055-b00c-1cb12f59a07a"
}