{
  "PageID": 14642,
  "PageGuid": "c7f54a18-5b30-44e3-a51d-98b7f0362112",
  "Title": "Vorlage zur Projektabnahme",
  "Content": "Forderung:\r\nDas System wird vom Auftraggeber hinsichtlich Erfüllung der im Pflichtenheft definierten Anforderungen geprüft.\r\nSchon zu Beginn des Projektes ist mit dem Auftraggeber (Kunde) zu vereinbaren, wie die spätere Abnahme zu geschehen hat. Dabei muss beschrieben werden, was der Auftraggeber an Lieferumfang erwartet (Dokumentation, ...), wie der Ablauf der Abnahme zu sein hat und wie der Auftraggeber prüft, ob das System seinen Erwartungen entspricht.\r\nLieferumfang\r\nDas Projekt-Team benötigt die Information, welche Produkte dem Auftraggeber zu liefern sind. Das ist im Normalfall nicht nur der ausführbare Programmkode, sondern auch ein Mindestmaß an Dokumentation. In Einzelfällen kann es vorkommen, dass für die Erstellung der Dokumentation ein ähnlich großer Aufwand getrieben werden muss, wie für die Erstellung des Systems. Zur Dokumentation gehören neben einem technischen Handbuch, einem Benutzerhandbuch auch Präsentationsunterlagen.\r\nAbnahmeprozedur\r\nEs muss frühzeitig beschrieben werden, wie die Abnahme durchgeführt werden wird. D.h. die an der Abnahme beteiligten Stellen (Kundenvertreter, Projektvertreter, Benutzervertreter, ...) sind aufzuführen. Weiterhin müssen zeitliche Abhängigkeiten beschrieben werden. Das bedeutet zum Beispiel, dass das System spätestens zwei Wochen nach Lieferung einer Abnahme durch den Auftraggeber zu unterziehen ist. Wenn bis spätestens vier Wochen nach Lieferung keine qualifizierte Abnahmeerklärung (positiv oder negativ) erstellt wurde, dann gilt das System als abgenommen.\r\nEin wichtiger Aspekt ist die Beschreibung, wie das Ergebnis der Abnahme zu ermitteln ist. D.h. wann sieht der Auftraggeber das System als abgenommen an.\r\nDas Ergebnis des Abnahmeprozesses ist mittels einer Abnahmeerklärung zu dokumentieren. Folgende Ergebnisse können bei einer Abnahme entstehen:\r\n·Das System wurde ohne Einschränkungen abgenommen\r\n·Das System wurde mit Einschränkungen abgenommen (d.h. es müssen noch Nacharbeiten in geringem Umfang vorgenommen werden)\r\n·Das System wurde nicht abgenommen\r\n\r\nBei größeren Systemen ist es sinnvoll, das System in mehreren Schritten (Inkrementen) zu entwickeln und diese dann separat abnehmen zu lassen. Dadurch erreicht man eine schnelle Rückkopplung der Benutzerinteressen zum Projekt-Team.",
  "Url": "https://services.topfact.de/wiki/pages/view?g=c7f54a18-5b30-44e3-a51d-98b7f0362112"
}