{
  "PageID": 16907,
  "PageGuid": "be132771-56d0-49e4-b094-9902e8c2da4c",
  "Title": "Installation- / Update-Dokumentation",
  "Content": "Vorab\r\nBevor mit der Installation und Konfiguration eines neuen Systems gestartet wird müssen folgende Schritte erledigt sein:\r\n1.technische Voraussetzung \r\n1.Server steht bereit\r\n2.Benutzernamen und Passwörter (Windows-User und Teamviewer) sind vorhanden\r\n3.Diese Credentials sind auch im Technik-Tab der Firma in topteam Web hinterlegt\r\n2.Anforderungen\r\n1.Die Anforderungsdokumente wurden gesichtet\r\n2.Eine Projektübergabe miz Vertrieb/GF/Entwicklung hat stattgefunden\r\n3.Es sind alle fachlichen und technischen Anforderungen klar und mit GF/Entwicklung geklärt\r\n3.Der Kunde hat das Projektdokument aktiv bestätigt\r\n4.Testdaten\r\n1.Es stehen Testbelege zur Verfügung (Beispiel-Dateien als PDF für Scan)\r\n2.Es stehen Beispieldateien CSV, RTF oder Sonstige für den Import zur Verfügung\r\n3.Es stehen ODBC Schnittstellen zu den Stammdaten zur Verfügung\r\n5.Lizenzen \r\n1.Lizenzen für die topfact Software und die Module wurden erstellt und stehen bereit\r\n2.Lizenzen für externe Systeme sind vorhanden (z.B. Docuware oder MSSQL Standard)\r\n\r\nStart der Installation \r\nIm Folgenden können alle Schritte in der Reihenfolge durchgeführt werden um eine Basis-Installation zu erreichen. Wenn einzelne Schritte unklar oder falsch beschrieben sind, bitte direkt ergänzen um deinem zukünftigen Ich einen Gefallen zu tun! ;-)\r\nDie genaue Reihenfolge der Installation findet sich hier unter\r\n>> Start (Reihenfolge)\r\n\r\n\r\nWichtige Infos\r\nHinweise zu msi-Paketen\r\nDie Softwarepakete liefern alle einen eigenständigen Installations-Wizard mit, der durch die Installation führt.\r\nKonfigurationen werden meist über die Administrationsoberfläche der topfact Administration eingestellt. \r\nDetaillierte Hinweise zur Installation und Konfiguration finden sich in den Wikiseiten der jeweiligen Pakete\r\n\r\nHinweise zu Kundensystemen\r\nUm sich auf ein Kundensystem aufzuschalten müssen folgende Zugangsdaten vorliegen\r\n·TeamViewer Zugangsdaten des Kunden (oder unter \"bisherige Verbindungen\" wenn man mit hotline@topfact.de bei Teamviewer eingeloggt ist)\r\n·Windows Zugangsdaten des Systems\r\nWenn die Arbeit am Kundensystem länger als 5 Minutenunterbrochen wird,\r\n·muss der Lockscreen aktiviert werden. Bzw. der Windows Nutzer abgemeldet werden\r\nWenn die Arbeit am Kundensystem abgeschlossen ist bzw. länger als 1 Tag unterbrochen wird \r\n·Muss der Desktop von erstellten oder heruntergeladenen msi-Paketen, Konfigurationsfiles, etc. gesäubert werden. \r\nHier bietet es sich an vorübergehend einen Ordner \"topfact Dateien / Cleanup\" zu erstellen wo alle Dateien solange zwischengelagert werden bis das Kundensystem wirklich 100% fertig gestellt ist.\r\n·muss der Lockscreen aktiviert werden. Bzw. der Windows Nutzer abgemeldet werden\r\n\r\nVollenden einer Installation\r\nWas muss getan werden, nachdem eine Software oder ein Modul fertig auf dem Kundensystem installiert ist?\r\nFür jedes Modul bzw. jede Software muss\r\n·Anwendung beim ersten Mal mit Administrator-Rechten gestartet werden \r\n(Rechtsklick + Starten als Administrator) damit das Programm Konfigurationsfiles anlegen kann \r\n·Prüfen ob die wichtigsten Funktionen gehen\r\n·Dokumentieren \r\nodass das Paket installiert wurde (Wann, Installationspfad, von wem, Notizen)\r\noWo: Im Wiki unter dem Projektdokumentation / Kundenname (Jahr)\r\nomit welchen Konfigurationsparametern es installiert wurde",
  "Url": "https://services.topfact.de/wiki/pages/view?g=be132771-56d0-49e4-b094-9902e8c2da4c"
}