{
  "PageID": 16931,
  "PageGuid": "ab8939d4-8abb-4a73-805d-ea03afd53db9",
  "Title": "Release Notes für das Produkt topfact6 MyWork",
  "Content": "Dieses Dokumente beinhaltet alle Release Notes für das Produkt topfact6 MyWork.\r\nDie Release Notes für weitere topfact6 Produkte finden Sie hier im topfact Wiki unter den angegebenen Links\r\n·topfact6 Jobserver\r\n·topfact6 Administration\r\n·topfact6 BestPeople\r\n·topfact6 Facility\r\n·topfact Archiv\r\n·topfact MyWork App\r\nBitte beachten Sie. Die Screenshots zeigen eventuell Funktion für zukünftige Versionen die kein Bestandteil der aktuellen Version sind.\r\nSollten Sie zu den beschriebenen Funktionen Fragen haben, kontaktieren Sie uns über topfact TIC und senden uns eine Anfrage.\r\n\r\nVersion 2022.1\r\nFür diese Programmversion ist die topfact6 Administration ab der Version 2022.1 notwendig.\r\ntopfact6 MyWork\r\n·Anzeige des Volltextes im QuickIndex, interaktive Übernahme von Text in Indexdaten (nur topfact Archiv)\r\n·verlinkte Dokumente und kombinierte Suche sind im QuickIndex verfügbar\r\n·Informationen zum Dokument anzeigen, Kontextmenü Eigenschaften Historie\r\n·Dokumenten- E-Mailversand optional über MAPI Schnittstelle, Standard ist © Microsoft Office Outlook\r\n·FibuConnect, Anbindung an die Buchhaltungssoftware © ADDISON, Umwandlung von Exportdateien in das ADDISON Format, Ergänzung des Beleglinks, Belegvalidierung\r\n·FibuConnect, Übernahme der Felder Auftragsnummer und Referenznummer als OP Nummer in pds CSS Schnittstelle\r\n·FibuConnect Belegübersicht, weitere Felder in der Anzeige einblendbar\r\n·FibuConnect, Anbindung an Buchhaltungssoftware © Diamant Software\r\n·FibuConnect, DATEV Übergabe des Wirtschaftsjahres an die Exportdatei\r\n·Berichte, Integration von globalen und kontextbezogenen Berichten\r\n·Webviewer, anzeige der Indexdaten, Stempel und des Dokumenten im Webbrowser\r\n·Aufgaben, beim erstellen einer neuen Aufgabe wird der Aufgabenbenutzer optional per E-Mail informiert\r\n\r\ntopfact6 Administration\r\n·Verwendung von Anwendungprofilen zum Delegieren von Aufgaben\r\n·Aufgaben, Übersicht von Jobserver Protokoll und Jobserver Ordnerüberwachung\r\n\r\ntopfact6 Jobserver\r\n·Automatische Bereinigung von Backup- und Fehlerordnern für die Module FileReader, XMLReader, CSV Import und Paperworks, Standard 30 Tage\r\n·Verbesserung der Fehlerbehandlung wenn Aufgaben kein Ergebnis zurückmelden\r\n·Zugriff auf UNC Ordner mit Anmeldedaten möglich, falls UNC Ordner nicht in der Domäne ist\r\n·Jobserver6 Modul GWC, Fehlerbehebung beim entpacken von ZIP Anhängen\r\n·Jobserver6 Modul FormRecognizer verfügbar, mit KI Werkzeugen Indexdaten automatisch ermitteln\r\n\r\ntopfact Cloud\r\n·topfactCloud FileTransfer als Dienst verfügbar, kann unbeaufsichtigt auf Servern ausgeführt werden\r\n·Hinterlegen von Anmeldedaten für Netzwerkzugriff in Dateiprofilen\r\n·Neues Active Directory Profil verfügbar, Übertragen von Benutzer- und Gruppeninformationen\r\n\r\ntopfact Archiv\r\n·topfactArchiv SOAP Webservice Version 2.1\r\n·topfactArchiv REST API Version 2022.1\r\n·Archiv Speicherorte können Sie auf beliebigen Laufwerken befinden\r\n·volle Integration der Volltextsuche durch den © Microsoft SQL Server\r\n·topfactArchiv OCR API zur Übergabe von Seiten an Remoteclients\r\n\r\ntopfact Tools\r\n·topfact Archiv Migration, Übernahme von Dokumenten aus DocuWare nach topfact Archiv!\r\n·Übernahme aller Dateien, Annotationen und Volltext\r\n\r\nVersion 2022.4\r\nFür diese Programmversion ist die topfact6 Administration ab der Version 2022.4 notwendig.\r\n\r\ntopfact6 MyWork\r\n·Dialoge: Indexdatenfelder sind untereinander verknüpft. Eingaben in einem vorherigen Indexdatenfeld schränken die Autovervollständigung in einem anderen Indexdatenfeld ein\r\n·Suchdialog: Optional kann automatisch eine \"unscharfe\" Suche durchgeführt werden, d.h. MyWork zeigt automatisch verwandte Suchergebnisse an\r\n·Suchdialog: Suchbegriffe im Volltext durchsuchen nun auch die Indexdaten\r\n·Suchdialog: Nach Abbruch der Eingabe öffnet sich keine leeres Ergebnisliste\r\n·Dokumenteneigenschaften: Benutzer mit dem entsprechenden Funktionsrecht können sich den aktuellen Stand der ImageServer- und OCRServer-Verarbeitung je Dokument anzeigen lassen\r\n·Dokumenteneigenschaften: Benutzer mit dem entsprechenden Funktionsrecht können die Kommentare und Stempel-Historie je Dokument einsehen und bei Bedarf Kommentare entfernen\r\n·Dokumentenstruktur: Beleglisten können auf Wunsch mit einem anderen Symbol angezeigt werden, um diese visuell hervorzuheben\r\n·abgelaufenes Login-Token wird automatisch erneuert\r\n·Login-Maske: Anzeige der eingegebenen Zeichen im Passwort-Fenster ist möglich\r\n\r\ntopfact6 Administration\r\n·Neue Funktionsprofile für MyWork: Die Rechte auf die Funktionen \"Mehrere Indexdaten ändern\" und \"Annotationen anzeigen\" können konfiguriert werden\r\n·Auto-Update: Es kann nun ein spezifischer Installationsuser mit lokalen Admin-Rechten konfiguriert werden, sodass der Benutzer selber keine Installationsrechte zum Update von topfact6 MyWork benötigt.\r\n·Konfiguration topfact6 JobServer-Moduls XML-Reader: Bei Auswahl von XPath-Ausdrücken aus einer Referenzdatei kann nun gefiltert werden\r\n\r\ntopfact6 Jobserver\r\n·Jobserver Protokoll Übersicht: In einer eigenen Übersicht der topfact Administration werden Warnungen, Informationen und Fehler des topfact6 JobServers und der JobServer-Module zentral angezeigt und stehen zur Prüfung bereit\r\n\r\ntopfact Archiv\r\n·Archivfelder in der Datenbank können aus der topfact6 Administration heraus mit einem Index versehen werden\r\n·Status des Volltextes eines Archivs ist in der Administration einsehbar und der Neuaufbau des Volltextkataloges ist möglich\r\n·Speicherorte je Archiv können angepasst werden bzw. ein Archiv auf mehrere Speicherorte verteilt werden\r\n·Einstellungsmöglichkeiten je Archiv deutlich erweitert (Thumbnail, max. Anzeige Dokumente, etc.)\r\n\r\ntopfact Tools\r\n·JobServer Modul: ArchivExport jetzt für topfact Archiv verfügbar\r\n\r\nVersion 2022.7\r\nFür diese Programmversion ist die topfact6 Administration ab der Version 2022.7 notwendig.\r\n\r\ntopfact6 MyWork\r\n·Kombinierte Suche: die anwählbaren Suchparameter können nun um ein Volltextsuchwort ergänzt werden\r\n·Suchdialog: in den Benutzereinstellungen kann der Benutzer festlegen, ob bei <Enter> im Suchdialog in das nächste Feld gesprungen wird oder direkt die Suche ausgelöst wird\r\n·Quickindex: in den Benutzereinstellungen kann der Benutzer festlegen, ob die Stempel im Quickindex als Drop-Down-Menü oder vollständig im Menüband angezeigt werden\r\n·Quickindex: Volltextsuchbegriffe werden nun im Reiter \"Volltext\" im Quickindex farblich hervorgehoben\r\n·Quickindex: Dateien können nun im Originalformat sowie als konvertierte PDF mit oder ohne Anmerkung direkt aus dem Quickindex per Mail an externe Empfänger versendet werden. Alternativ kann auch ein Hyperlink zum Dokument für den topfact WebViewer oder ein direkter Aufruflink in topfact6 MyWork erzeugt werden. Diese Funktion steht zusätzlich im Kontextmenü der Ergebnisliste bereit als \"Senden an\".\r\n·Darstellung: Um das versehentliche Schließen des MyWork Clients zu vermeiden, wird der \"Beenden\"-Button im Hauptprogramm nicht mehr im Menübank angezeigt. Das Schließen des MyWork Clients ist auch weiterhin jederzeit über den Reiter \"Datei\" möglich\r\ntopfact6 JobServer\r\n·Belegübergabe an ADDISON: Leerzeichen in Übergabedateien werden nun automatisch erkannt, um die korrekte Zuordnung der Datenzeilen und -spalten in ADDISON zu unterstützen\r\n·Übergabe an PDS-CSS: Sachkontennummern können nun automatisch auf eine einheitliche Länge vervollständigt werden\r\n·Mail Notifier: bei der automatischen E-Mail-Benachrichtigung für topfact Archiv können nun direkte Dokumentenlinks erzeugt werden, die entweder in MyWork eine Ergebnisliste mit allen Dokumenten der Benachrichtigung oder direkt das Dokument im Quickindex öffnet \r\n\r\ntopfact Archiv und WebService\r\n·Anfragen an das Archiv werden nun standardmäßig sortiert zurückgegeben (zuerst das Hauptdokument, dann die Anhänge in der Abfolge der Ablage)\r\n\r\nVersion 2022.10\r\nFür diese Programmversion ist die topfact6 Administration ab der Version 2022.10 notwendig.\r\nAchtung, Lizenzänderung. Jeder topfact6 Benutzer benötigt für den Zugriff auf die topfact6 Administration und topfact6 MyWork eine \"Named-User-License\".\r\n\r\ntopfact6 MyWork\r\n·Konvertierung individueller Dateien in das Addison Format, Kommunikationsinformationen wie z.B. E-Mail, Telefon und Adressdaten werden nicht mehr in die Addison csv Datei geschrieben\r\n·Anbindung aller Archivfunktionen an die topfactArchiv REST API\r\n·Datenpflegen haben Barcode Option zum drucken direkt aus der Datenpflegeliste\r\n·Lizensierungsänderung\r\nojede Organisation benötigt eine eigene Lizenzdatei mit alles Lizenzen der Organisation\r\nojeder Benutzer benötigt eine \"Named-User-License\"\r\noab der Version 2022.8.1.3 wird diese verpflichtend benötigt\r\n·QuickIndex Navigation, direktes Navigieren zu einer speziellen Seite mit der Funktion \"Gehe zur Seite\"\r\n·Dokumente zusammenführen mit neuer Maske, der Benutzer erkennt per Thumbnail welches das Hauptdokument ist und welche zusammengeführt werden\r\n\r\nVersion 2023.1\r\nFür diese Programmversion ist die topfact6 Administration ab der Version 2023.1 notwendig.\r\n\r\ntopfact6 MyWork\r\n·Mithilfe der neuen Funktion \"Anzeigen und Bearbeiten\" können Dokumente direkt aus MyWork heraus im Standard-Programm geöffnet und bearbeitet werden. Nach speichern der Änderungen und Schließen des Standardprogramms erkennt MyWork automatisch, dass das Dokument geändert wurde und fragt den Benutzer, ob das Dokument archiviert werden soll. Achtung: Andere Microsoft Office Anwendungen müssen vor dem \"Anzeigen und Bearbeiten\" eines Archivdokumentes geschlossen werden. \r\n·Die Druckfunktion bietet jetzt die Möglichkeit, das Dokument mit oder ohne Anmerkungen zu drucken\r\n·Stempel können so konfiguriert bleiben, dass nach dem Anbringen auf dem Dokument automatisch im Quickindex zum nächsten Dokument der Ergebnisliste gewechselt wird und der Stempel dabei aktiv bleibt\r\n·Beim Klick auf eine Belegliste wird automatisch die Zählung der enthaltenden Dokumente in dieser Liste aktualisiert\r\n·Die Suchparameter für Beleglisten können nun Volltextinformationen enthalten\r\n·Die Schriftfarbe der Beleglistennamen in der Dokumentenstruktur kann zentral über die Administration verändert werden. Achtung: Dies kann durch überschreiben der benutzerspezifisch gewählten Layout-Styles in MyWork dazu führen, dass diese dann schwerer zu erkennen sind.\r\n·Die Schriftfarbe der Dokumentenanzahl in den Beleglisten kann durch den Benutzer in den Benutzereinstellungen konfiguriert werden. Achtung: Dies kann durch überschreiben der benutzerspezifisch gewählten Layout-Styles in MyWork dazu führen, dass diese dann schwerer zu erkennen sind.\r\n·Bei der Übergabe von Buchungsdatensätzen an KWP können zusätzliche Beleginformationen mit übergeben werden, bspw. eine Wartungsnummer, um die Auswertung in KWP zu unterstützen\r\n·Benutzer der topfact6 MyWork Cloud Version können Ihr Passwort nun selbstständig zurücksetzen im Login-Bildschirm. \r\n·es wurden diverse Maßnahmen getroffen, um die allgemeine Reaktionsgeschwindigkeit von MyWork zu verbessern\r\n·allgemeine Fehlerbehebung\r\n\r\nVersion 2023.4\r\nFür diese Programmversion ist die topfact6 Administration ab der Version 2023.1 notwendig.\r\n\r\ntopfact6 MyWork\r\n·Dokumente können nun über den Quickindex an einen Signaturprozess übergeben werden, um das Dokument durch dritte elektronisch signieren zu lassen. Achtung: Es entstehen zusätzliche Lizenzkosten sowie volumenabhängige Kosten je Unterschriftsvorgang. \r\n·Die in den persönlichen Beleglisten enthaltenen Dokumente werden nun ebenfalls automatisiert gezählt und die Anzahl angezeigt.\r\n·bei der Ablage von Dateien per Drag&Drop wird ab einer Dateigröße von 10 Mbyte das binäre Element ins Archiv gestreamt. Dadurch können nun auch sehr große Dateien im Archiv abgelegt werden.\r\n·topfact6 MyWork übermittelt automatisch relevante Diagnosedaten und Programfehler an den Support der topfact AG. Diese automatische Übermittlung kann in den Benutzereinstellungen von topfact6 MyWork deaktiviert werden. \r\n·allgemeine Fehlerbehebung\r\n\r\nVersion 2023.7\r\nFür diese Programmversion ist die topfact6 Administration ab der Version 2023.7 notwendig.\r\n\r\ntopfact6 MyWork\r\n·Benutzer können persönliche Exportkonfigurationen erstellen und damit strukturiert Dokumente aus dem topfact Archiv exportieren\r\n·Der Quickindex erkennt, ob eine Datei ein darstellbares Format hat und schlägt ggf. automatisch vor, die Datei im eingestellten Standardprogramm des Betriebssystems zu öffnen\r\n·Dialoge und Dateneingaben akzeptieren nur noch soviele Zeichen, wie das dahinterliegende Datenbankfeld speichern kann\r\n·Download-Links können nun mit einem Ablaufdatum versehen werden\r\n·Der Benutzer kann per Strg + Klick zusätzliche Reiter der Dokumentenstruktur, der Aufgabenübersicht und der persönlichen Beleglisten aufrufen. Bitte beachten: ggf. belastet dies die Performance von topfact6 MyWork\r\n·Im Quickindex wurde ein weiteres Panel hinzugefügt, das die erstellten Aufgaben zum Dokument anzeigt. Per Klick auf eine Aufgabe wird die Detailansicht der Aufgabe zur Erledigung angezeigt.\r\n·Mit Strg + C werden die selektierten Zeilen der Ergebnisliste inkl. Spaltenkopf in die Zwischenablage kopiert und können in Drittanwendungen eingefügt werden (bspw. Excel)\r\n·Die Funktionen \"Barcode\" und \"Dokumentensignatur\" werden im Menüband von MyWork als Menüband-Buttons angezeigt\r\n·Im Quickindex kann ein Dokument in einem separaten PDF-Viewer angezeigt werden. Hier kann in einem mehrseitigem Dokument seitenüberschneidend gescrollt werden#\r\n·Allgemeine Fehlerbehebung:\r\noDie Fensterpositionen werden wieder korrekt gespeichert und bspw. der Quickindex nach einem Neustart an der letzten Position wieder aufgerufen\r\noDateien mit gleichem Dateinamen werden beim Export automatisch hochgezählt, um ein gegenseitiges Überschreiben zu verhindern\r\noEs wurde ein Bug behoben, der unter gewissen Umständen die Pflichtfelder im Ablagedialog nicht prüfte\r\noBeim Öffnen einer Datenauswahl werden eingetragene Werte automatisch aus dem Indexdatenfeld übernommen und in der Datenauswahl selektiert\r\noDie Funktion \"Anzeigen und Bearbeiten\" öffnet nur noch die Datei in der Standardanwendung, welche zum Zeitpunkt des Funktionsaufrufs im Quickindex angezeigt wird\r\n\r\nVersion 2023.10\r\nFür diese Programmversion ist die topfact6 Administration ab der Version 2023.10 notwendig.\r\n\r\ntopfact6 MyWork\r\n·Der Quickindex lädt nur noch die erste Datei und wandelt diese in ein Bild um. Weitere Dateien werden erst nach konkreter Anforderung heruntergeladen und konvertiert\r\n·Der Quickindex \"streamt\" Dokumente, dadurch können auch sehr große Dateien (bspw. AutoCAD-Pläne) im Quickindex angezeigt werden. Das Herunterladen der Dateien aus dem Archiv wird per Dialog dem Benutzer kommuniziert\r\n·Beim Export von Dateien aus dem Quickindex wird nun ein Download-Dialog angezeigt, der den Fortschritt dokumentiert\r\n·Beim Export von Dateien aus der Ergebnisliste wird ein Download-Dialog angezeigt, der den Fortschritt dokumentiert und das Ergebnis als Protokoll darstellt. \r\n·Per Benutzereinstellung können die Navigationsbuttons im Quickindex nun fixiert werden. Die Buttons werden dann nicht mehr ausgeblendet. \r\n·Die Optionen im Menü \"MyWork\" der Benutzereinstellungen wurden neu gruppiert.\r\n·Die Funktion \"Kennwort zurücksetzen\" wurde umgestellt auf eine vollständig webbasierte Applikation. Hinweis: diese Funktion ist nur in der topfact Cloud verfügbar.\r\n·Allgemeine Fehlerbehebung:\r\noEs wurde ein Bug behoben, der dazu geführt hat, dass nur leere Seiten an den Druckdialog übergeben wurden\r\n\r\nVersion 2024.1\r\nFür diese Programmversion ist die topfact6 Administration ab der Version 2023.12 notwendig.\r\n\r\ntopfact6 MyWork\r\n·Allgemeine Verbesserungen:\r\noDie Anzeige von MSG-Dateien im Quickindex wurde korrigert\r\noBei der Ablage von mehreren E-Mails werden die Anhänge jetzt korrekt mit archiviert\r\noDie Taste \"Entf\" löst den Löschen-Workflow im Archiv nur aus, wenn das Anwendungsrecht vergeben ist\r\noDer Export von Txt-Dateien wurde überarbeitet, sodass diese im richtigen Exportordner auftauchen\r\noDer Detailbereich in der Ergebnisliste sowie der Änderungsdialog im Quickindex laden beim Ausfahren nun die Daten des selektierten Dokumentes direkt\r\n\r\nVersion 2024.4\r\nFür diese Programmversion ist die topfact6 Administration ab der Version 2024.4 notwendig.\r\n\r\nManuelle Bereitstellung von Archivdokumenten\r\n·Im Kontextmenü der Ergebnisliste wurden die Funktionen \"Download-Link\", \"MyWork Aufruf\" und \"WebLink\" im neuen Untermenü \"Teilen\" zusammengefasst\r\n·Die Funktion \"Suchergebnis/Dokument als MyWork Aufruf\" erzeugen nun einen HTML-Link, der auch die aktuellen Suchparameter/das gewählte Dokument als Aufrufparameter enthält.\r\n·Beim Verwenden eines MyWork Aufruf-Links werden bereits geöffnete MyWork Instanzen erkannt und die Links direkt in der bestehenden Anwendung geöffnet\r\n\r\nIT-Sicherheit in der topfact Cloud\r\n·Der Login-Prozess des topfact6 MyWork Cloud Clients übergibt den Benutzernamen und das Kennwort an die topfact6 API, die diese Eingaben in der Datenbank überprüft und bei Erfolg eine Verbindung bereitstellt\r\nStempel\r\n·Es ist möglich, Bildstempel zu konfigurieren\r\nAufgaben\r\n·\"Aufgabe übernehmen\" nur möglich, wenn als Bearbeiter eine Benutzergruppe aufgeführt ist.\r\n·Wenn bereits ein Text im Feld \"Ergebnis\" steht, wird dieser automatisch an das Dialogfenster der Funktion \"Aufgabe erledigen\" übergeben \r\n·Im Menüband wird beim Start von topfact6 MyWork automatisch die Anzahl der offenen Aufgaben ermittelt und angezeigt und danach im eingestellten Rythmus aktualisiert\r\nFibuConnect\r\n·für PDS-CSS Exports kann das Eingangsdatum automatisch aus dem Archiv mit übergeben werden\r\nDokumentenanzeige im Quickindex\r\n·Der Quickindex prüft automatisch beim Start, ob das Panel zur Dokumentenanzeige vorhanden ist, wenn nicht wird es automatisch eingeblendet\r\n·Im neuen Reiter \"Ansicht\" im Quickindex können die einzelnen Panels einzeln ein- oder ausgeblendet werden\r\nAllgemeine Verbesserungen\r\n·Der Export von Archivdateien als PDF mit Annotationen wurde verbessert. Die Annotationen sind nicht mehr verschoben\r\n·Exportkonfiguration: Auswahl ermöglicht: Export als Originaldatei oder als PDF mit oder ohne Anmerkungen\r\n·MSG-Dateien können in der Originalanwendung angezeigt werden auch wenn Outlook bereits geöffnet ist\r\n·Es wurde ein Bug behoben, bei dem die Funktion \"senden an\" als PDF mit Anmerkungen für MSG-Dateien fehlschlug\r\n·Es wurde ein Bug behoben, bei dem MyWork eingefroren ist, wenn ein Quickindex geschlossen wurde, dessen zugrundeliegende Ergebnisliste nicht mehr existierte.\r\n\r\nVersion 2024.7\r\nFür diese Programmversion ist die topfact6 Administration ab der Version 2024.7 notwendig.\r\n\r\ntopfact6 My Work KI-Funktionen\r\n·Mithilfe der KI-Funktionen stehen im Quickindex nun automatisierte Auswertungen für das Dokument bereit\r\n·Diese können über die topfact6 Administration je Archiv konfiguriert werden\r\n·weitere Informationen finden Sie hier. \r\n\r\nZusammenspiel zwischen Microsoft Outlook und MyWork\r\n·Die Archivierung von E-Mails per Drag&Drop wurde optimiert, der Betreff wird nun unabhängig von der Mail-Formatierung vollständig übergeben\r\n·Es wurde eine Störung behoben, welche die Übergabe von Archivdateien an Outlook verhindert hat\r\n\r\ntopfact Signature\r\n·Bei Erzeugung eines Signaturvorgangs können nun weitere Dateien angehängt und im Signaturprozess mitgesendet werden (bspw. AGB zum Angebot). \r\n\r\nDialoge\r\n·Die Anzeige der Feldbezeichnungen im Suchdialog wurde unter bestimmten Anzeigebedingungen optimiert\r\n·es wurden Störungen behoben beim Wechsel per ENTER zwischen Dialogfeldern mit unterschiedlichem Datentyp (von Text auf Datum oder Betrag)\r\n\r\nBitte beachten Sie unsere Hinweise zur Verwendung der neuen OUTLOOK (NEW) App von Microsoft",
  "Url": "https://services.topfact.de/wiki/pages/view?g=ab8939d4-8abb-4a73-805d-ea03afd53db9"
}