{
  "PageID": 17000,
  "PageGuid": "5b929c80-0924-4dee-b0d4-cf3b58a3c4ae",
  "Title": "GWC Vorbereitung Anlegen EWS Impersonation-User",
  "Content": "topfact FAQ \r\n GWC Vorbereitung Anlegen EWS Impersonation-User\r\nProdukt: topfact GWC\r\nErsteller: Detlev Eberhardt hotline@topfact.de \r\nInhalt\r\nAusgangssituation\r\nBeschreibung\r\nTechnische Voraussetzung\r\nErforderliche Berechtigungen\r\nZertifikat\r\nZertifikat lokal am DocuWare-Server einspielen\r\nHinweis für Linkerzeugung mit Webservice\r\n \r\nAusgangssituation\r\nZur Einrichtung der E-Mail Archivierung vom Exchange Server wird ein User-Login benötigt, welches berechtig ist, in die Accounts einzugreifen. Mit diesem Login wird über den EWS die die Abholung der E-Mails aus den Postfächern und das Rückschreiben der geänderten Kategorie, bzw. des Infokastens realisiert. Dieser EWS-User wird Impersonation-User genannt und ist vom Kunden bereitzustellen. Die Details sind nachfolgend hinter den Links in „Erforderliche Berechtigungen“ zu finden.\r\nBeschreibung\r\nTechnische Voraussetzung\r\n·Exchange Server 2007, 2010, 2013\r\n·Jobserver Data GWC mind. Version 3.1.520\r\n·Ab Docuware 5.1\r\n·mind. Microsoft SQL Server 2005 SP2\r\n·mind. MySQL Server 5.1\r\nErforderliche Berechtigungen\r\nExchange Impersonation können einen Anrufer an einen bestimmten Benutzerkonto imitieren. Dies ermöglicht es dem Anrufer, Operationen unter Verwendung der Berechtigungen, die mit der imitierten Konto zugeordnet sind, anstelle der Berechtigungen, die mit der Anrufer-Konto zugeordnet sind durchzuführen.\r\nConfiguring Exchange Impersonation (für Exchange 2007)\r\nConfiguring Exchange Impersonation (ab Exchange 2010)\r\nExchange 2013 and 2016 Configuring Impersonation For Applications (Exchange 2013 und 2016)\r\n \r\nZertifikat \r\nDer Exchangeserver muss über ein gültiges Zerfifikat verfügen. Zertifikate können über die IIS Managementkonsole oder über die Exchange PowerShell verwaltet werden. \r\n \r\nZertifikat lokal am DocuWare-Server einspielen\r\nFalls beim Abrufen der Postfächer die Meldung erscheint \"für den geschützten SSL/TLS-Kanal konnte keine Vertrauensstellung hergestellt werden\", muss das Zertifikat vom Exchange-Server als vertauenswürdige Sammzertifizierungsstelle bereitgestellt werden. Eine Anleitung zum Einspielen des Exchange-Zertifikats ist unter Link zu finden.\r\nHinweis für Linkerzeugung mit Webservice\r\nFalls der GWC mithilfe unseres Webservices Links in die E-Mails zurückschreiben soll, muss darauf geachtet werden, dass im Configure im Bereich \"Data->DMS-WebIntegration\" in den Feldern \"Passphrase\", \"fester Benutzername\" und \"Benutzerpasswort\" nichts drinsteht. Andernfalls versucht der Jobserver die Links zu kryptieren. Dadurch entstehen ungültige URL-Links.\r\nDie Felder \"Passphrase\", \"fester Benutzername\" und \"Benutzerpasswort\" werden bei Anlage einer Webintegration im Configure automatisch mit 2 Sternchen (**) gefüllt. Diese Sternchen müssen entfernt werden.",
  "Url": "https://services.topfact.de/wiki/pages/view?g=5b929c80-0924-4dee-b0d4-cf3b58a3c4ae"
}