{
  "PageID": 17001,
  "PageGuid": "7b05e977-78a3-446c-899d-a7b6111816d4",
  "Title": "Installation von MyWork",
  "Content": "Um MyWork als Client initial zu installieren werden zwei Dateien benötigt:\r\n1.topfact6_MyWork.msi (Installationspaket)\r\n2.Config.xml (Konfigurationsdatei ist Firmenweit einheitlich)\r\nBeide Dateien erhalten Sie vom topfact Support oder Sie finden diese auf ihrem lokalen DMS/topfact Server im Netzwerk unter dem Freigabeordner \"Software\"\r\nHinweis: Auf manchen PCs sind abhängig von den Sicherheitseinstellungen Administrationsrechte nötig.\r\n\r\n1. Installieren des MSI Pakets\r\nFühren Sie das msi Paket ( direkt aus dem Netzwerkpfad ) als Administrator aus.\r\nDurch Shift+Rechtsklick auf das msi Paket erhalten Sie die Möglichkeit die Anwendung \"Als anderer Benutzer/Administrator ausführen\".\r\n\r\n\r\nDer Installationsordner von MyWork liegt üblicherweise lokal auf C:\\Program Files (x86)\\topfact AG\\topfact6 MyWork\r\nSchließen sie die Installation ab.\r\n\r\n2. Kopieren bzw. konfigurieren der Config.xml\r\nKopieren Sie die Config Datei aus dem Netzlaufwerk in den Ordner \"ProgramData\" am lokalen PC oder Terminal und ersetzen sie ggf. die dort vorhandene Config.xml unter: \r\nC:\\ProgramData\\topfact AG\\Config\\Config.xml\r\n\r\n\r\n\r\nLegen Sie eine Verknüpfung für MyWork auf Desktop an\r\n\r\n(Hinweis: Sollten die Clients weitere Zugriffe auf Export- oder Importordner benötigen legen sie die entsprechenden Netzlaufwerke an.)\r\n\r\n3. Testen der Funktionalität\r\nUm eine vollständige Funktionalität einer Client-Installation zu prüfen sollten folgende Bedingungen gegeben sein:\r\n·Die MyWork Anwendung lässt sich öffnen und der Nutzer kann sich mit seinem Windows-Nutzernamen anmelden (Standard-Einstellung beim Login)\r\n·In der Anwendung ist das Archiv-Icon und das Such-Icon in der oberen Ribbon-Leiste sichtbar \r\n·Eine Suche im Archiv liefert Belege (Klick auf das Archiv-Symbol, Klick auf OK in der Suche -> Ergebnisliste sollte mehrere Belege laden und anzeigen)\r\n·Doppelklick auf einen einzelnen Beleg sollte den QuickIndex öffnen und den Beleg sowie die Indexdaten anzeigen\r\n·Dokumentenstruktur in der Ribbon-Leiste ist sichtbar und öffnet gewünschte Strukturen\r\n·Die Dokumentenstrukturen enthalten Belege die ebenfalls zu öffnen sind.\r\n\r\nDie Anmeldung erfolgt üblicherweise über den Windows-Nutzer des Anwenders.\r\nFalls einzelne Benutzer aus Ihrem Netzwerk keine erfolgreiche Anmeldung durchführen können melden Sie uns bitte die Windows-Nutzernamen der entsprechenden Personen.\r\n\r\n\r\n\r\nNun ist MyWork einsatzbereit und kann vom Nutzer selbst verwendet werden.\r\nBei Fragen wenden Sie sich gerne direkt an unseren Support oder legen in TIC ein neues Support-Ticket an.",
  "Url": "https://services.topfact.de/wiki/pages/view?g=7b05e977-78a3-446c-899d-a7b6111816d4"
}