{
  "PageID": 17018,
  "PageGuid": "b65da4a4-c8d3-48f1-822a-7bdf3c8ea7f3",
  "Title": "Installation und Konfiguration topfact6 Jobserver",
  "Content": "Dieser FAQ beschreibt in Schritten die Installation und Konfiguration des topfact6 Jobservers.\r\n\r\nInstallation\r\nDer Installationsprozess besteht aus 3 Schritten die in einem klassischen Wizzard dargestellt werden.\r\n·Installation der Software durch Ausführen des MSI Installationspaketes\r\n·Bestimmen des Installationspfades\r\n·Abschluss der Installation\r\n\r\nVoraussetzungen\r\nVoraussetzungen\r\n·Vorhandene topfact6 Datenbank Installation, besteht aus Microsoft SQL Server und einer aktuellen topfact6 Datenbank\r\n·Vorhandene topfact6 Administration\r\n·Administrative Berechtigungen auf dem Server sowie ein Windows Benutzerkonto das zum ausführen des topfact6 Jobserver Dienstes berechtigt werden kann\r\n·Aktuelles Installationpaket für die Software topfact6 Jobserver\r\n·Gültige Lizenz für den topfact6 Jobserver und die entsprechenden Module\r\n\r\nKonfiguration\r\nDamit die folgenden Schritte erfolgreich ausgeführt werden können starten Sie die topfact6 Administration als Administrator.\r\nWährend der Konfiguration wird die Datei mit der Datenbankverbindung in den Installationsordner gespeichert.\r\nHierzu werden erhöhte Berechtigungen auf Dateisystemeben benötigt.\r\n\r\nZum Festlegen der topfact6 Jobserver Konfiguration öffnen Sie in der topfact6 Administration die Funktion Anwendungen > Jobserver konfigurieren.\r\nTragen Sie die Zugangsdaten zum SQL Server ein und prüfen Sie die Verbindung.\r\nNach der Eingabe der Zugangsdaten speichern Sie die Konfigurationsdatei im Installationsordner.\r\n\r\nKonfiguration Windows Dienst\r\nDer topfact6 Jobserver installiert den Windows Dienst \"topfact6 Jobserver\".\r\nIm Standard befindet sich der Dienst im Starttyp: manuell. Ändern Sie nach der Konfiguration den Starttyp auf \"Automatisch (Verzögerter Start)\".\r\nWeiterhin geben Sie als Anmeldedaten ein Windows Benutzerkonto an welches zum Ausführen eines Dienstes berechtigt ist.\r\nBeachten Sie das das angegebene Windows Konto als topfact6 Benutzer (selber Benutzername in topfact6 wie der Windows Benutzername) vorhanden ist.\r\n\r\nÜber den Benutzernamen wird die topfact Lizensierung durchgeführt.\r\nStarten Sie den Dienst. Wird der Dienst fehlerfrei gestartet ist die Konfiguration erfolgreich abgeschlossen.\r\nUm die Dienste anzuzeigen suchen wir im Windows-Startmenü nach \"dienste\"\r\n\r\nDort machen wir einen Doppelklick auf den Dienst \"topfact6 Jobserver\"\r\n\r\nWir wählen Starttyp \"Automatisch (Verzögerter Start)\" und übernehmen die Änderungen. \r\n\r\nUnter dem Reiter \"Anmelden\" geben wir den Benutzernamen an, der vom Kunden-Admin für Dienste ausgewählt wurde.\r\n\r\nAbschließend wird der Dienst gestartet. Wenn er ohne Fehler startet ist die Einstellung korrekt.",
  "Url": "https://services.topfact.de/wiki/pages/view?g=b65da4a4-c8d3-48f1-822a-7bdf3c8ea7f3"
}