{
  "PageID": 17055,
  "PageGuid": "e5dabbd3-87b2-4109-aecb-4204ca5433df",
  "Title": "PP Story 4a - Mitarbeiter 1",
  "Content": "Szenario\r\nEin Mitarbeiter möchte seine letzten Gehaltsabrechnungen anschauen um etwas nachzuprüfen.\r\nNormalerweise hätte er diese alten Gehaltsabrechnungen nur als Papierzettel zu Hause in einem Ordner abgelegt. Vielleicht hat er sie aber auch gar nicht geordnet abgelegt.\r\nDieser Mitarbeiter kann nun direkt an seinem Arbeits-PC im Büro oder von unterwegs über sein Smartphone auf das topfact Personal Portal zugreifen und seine Gehaltsabrechnungen einsehen.\r\n\r\nVorteile durch das topfact Personal Portal\r\n·Der Mitarbeiter kann sich von überall aus einloggen, zu Hause oder im Büro (Sichere 2-Factor-Authentication per SMS Code)\r\n·Der Mitarbeiter sieht ALLE seine Dokumente geordnet, kann sie direkt anschauen oder runterladen. Alle Unterlagen sind dauerhaft sicher archiviert.\r\n·Der Mitarbeiter hat immer alle Dokumente griffbereit\r\n·Die Firma hat eine konsistente Zustellung ohne Papier aber trotzdem mit hoher Datensicherheit\r\n\r\nAblauf aus der Sicht des Mitarbeiters\r\n1. Anmelden am topfact Personal Portal \r\nFür die Anmeldung an personal.topfact.de ist die Personalnummer und ein Passwort nötig. Die Firmennummer sowie die Personalnummer können optional direkt in einen personalisierten Link hinterlegt werden. So muss der Mitarbeiter sich nur sein Passwort merken und eingeben.\r\n\r\n\r\n2. Erhalt und Eingabe des SMS Code zur doppelten Absicherung des Logins\r\nOptional kann zur höheren Sicherheit eine SMS wird im Moment des Login an den Mitarbeiter verschickt werden (die so genannte 2-Factor-Authentication). So kann vermieden werden, dass unbefugte Dritte oder Kollegen des Mitarbeiters dessen Daten einsehen können.\r\n\r\n\r\n3. Übersicht über alle Dokumente des Mitarbeiters\r\nNach dem Login kann der Mitarbeiter alle seine Dokumente nach Datum oder Dokumentarten sortieren und die entsprechenden Dokumente anzeigen.\r\n\r\n\r\n\r\n4. Anzeigen eines Dokuments\r\nDer Mitarbeiter kann direkt im System die gewünschten Dokumente anzeigen. \r\nDurch eine spezielle technische Lösung werden diese Dokumente nicht lokal als temporäre Dateien auf dem PC abgespeichert sondern nur für den Moment auf dem Bildschirm angezeigt. Dies verhindert wiederum unbefugte Zugriffe auf gemeinsam genutzten Computern.\r\n\r\n\r\n\r\n5. Herunterladen eines Dokuments\r\nWenn der Mitarbeiter ein bestimmtes Dokument doch herunterladen oder ausdrucken möchte kann dies ebenfalls direkt aus dem System erfolgen. \r\nIn der Dokumentenliste kann der Nutzer auch mehrere Dokumente selektieren und diese gesammelt als ZIP Archiv herunterladen.",
  "Url": "https://services.topfact.de/wiki/pages/view?g=e5dabbd3-87b2-4109-aecb-4204ca5433df"
}