{
  "PageID": 17072,
  "PageGuid": "c6576bb7-c10d-4532-ac9a-990e5bfab47d",
  "Title": "FAQ Schnittstellen - TFSearch Integration - zur Beleganzeige aus DocuWare oder topfact Archiv, in Drittanwendungen",
  "Content": "Was ist tfSearch?\r\nÜber topfact Anwendungen wird die lokale Arbeitsumgebung mit dem Archiv verlinkt. Mittels der topfact Anwendung tfSearch wird eine technische Verbindung aus einer Drittanwendung zum Archivsystem hergestellt um Dokumente aus dem Archiv anzuzeigen.\r\n\r\nDer ERP-Anwendungsfall ist es Dateien und Dokument aus dem Archiv anzuzeigen (Modus3). Dazu wird durch die Drittanwendung die tfsearch.exe aufgerufen und ein Suchparameter (z.Bsp. Die Belegnummer) übergeben. tfSearch erzeugt daraus den jeweils passenden Archivaufruf und startet diesen.\r\n\r\nEin weiterer Anwendungsfall ist der Aufruf von Dokumenten aus einem Verzeichnis. Im Verzeichnis liegen nicht die Originaldateien, sondern tfSearch-Links mit den Dateinamen der Originaldateien. Mit dem Klick auf die Datei wir tfSearch gestartet und öffnet die Datei aus dem DMS heraus. Der Vorteil ist, dass der Link an unterschiedlichen Stellen liegen könnte, die Originaldatei ist aber zugriffsgeschützt und optimal organisiert im DMS abgelegt.\r\n\r\nMode 3 - Achivsuche mit Parametern\r\nIm Mode 3 benötigt die tfSearch.exe Übergabeparameter die beim starten der Exe mit übergeben werden müssen.\r\nDie Parameter sind in Form einer Schlüssel / Wert Angabe zu Übergeben. Mehrere Werte müssen mit einem ; Semikolon getrennt werden.\r\nBeispiel:\r\nBELEGNUMMER=\"711958\", in diesem Beispiel wird die Belegnummer 711958 gesucht.\r\nBELEGNUMMER=\"711958\";KULIENR=''70001\", in diesem Beispiel wird die Belegnummer 711958 in Kombination mit der Kundenlieferantennummer 700001 gesucht.\r\nDer Schlüssel bei der Parameterübergabe muss dem Archivfeldnamen entsprechen.\r\n\r\nMode 1 - pds Anbindung\r\nkeine Dokumentation vorhanden\r\n\r\nMode 2 - tfSearch Datei Anbindung\r\nkeine Dokumentation vorhanden\r\n\r\nAufruf über Commandline, Start aus fremder Anwendung\r\ntfSearch lässt sie über die Commandline aufrufen und testen.\r\nDieser Aufruf kann in jede Anwendung integriert werden.\r\n\r\n\r\nBeachten Sie:\r\nZur globalen Verwendung in einem Netzwerk kann die tfSearch.exe auch in einem freigegebenen Netzwerkpfad bereitgestellt werden.\r\nVerwenden Sie hierfür UNC Pfade z.B. \\\\server\\freigabe\\tfSearch.exe {Parameterliste}\r\n\r\nMode 4 - Suche mit bestimmter Archiv-GUID\r\nIm Mode 4 benötigt die tfSearch.exe die Archiv-GUID des Zielarchivs und Übergabeparameter die beim starten der Exe mit übergeben werden müssen.#\r\nDie Archiv-Guid und die Parameter sind durch Semikolons getrennt und insgesamt in Hochkomma gestellt. \r\nBeispiel: \r\ntfsearch.exe \"C20BE106-D2E7-426E-8B13-B22C052FC98A;belegnummer;2018/600330\"\r\n[im Anhang eine Beispielkonfiguration für mehrere Archive und tfa bei WHM]",
  "Url": "https://services.topfact.de/wiki/pages/view?g=c6576bb7-c10d-4532-ac9a-990e5bfab47d"
}