{
  "PageID": 17107,
  "PageGuid": "ecf5a9eb-c1ce-4be2-9d00-6c6c28c6620c",
  "Title": "Details zur Meldung",
  "Content": "Details zur Meldung\r\nDer Nutzer erhält eine Übersicht über alle Kommentare, hinterlegte Dateien und Checklistenpunkte der Meldung.\r\n1. Über \"Kommentare\" kann der Nutzer mit dem topfact Support kommunizieren.\r\n2. Über \"Dateien\" werden Dateien wie Screenshots o.ä. hochgeladen.\r\n3. Über \"Checkliste\" sieht der Nutzer den Stand der Themen. \r\n\r\nZur Erfassung von Kommentaren\r\n1.Klicken Sie auf den Reiter Kommentare\r\n2.Tragen Sie Ihren Kommentar ein\r\n3.Kommentar speichern klicken\r\n\r\nDer Kommentar wird als Meldung innerhalb des topfact Ticketsystems an Ihren Bearbeiter gemeldet.\r\n\r\nZum Hochladen von Dateien\r\n1.Klicken Sie auf Dateien\r\n2.Wählen Sie eine Datei aus welche Sie an die topfact AG übertragen möchten\r\n3.Erfassen Sie den Begleitkommentar zur Datei\r\n4.Klicken Sie Datei speichern\r\n\r\n\r\nZum Runterladen von Dateien\r\nKlicken Sie einfach auf den Link der Datei, der Download wird über den Browser automatisch vollzogen.\r\n\r\n\r\n\r\n\r\nZur Bearbeitung von Checklisten\r\nDie TIC Checkliste kann für projektbezogene Bereitstellung von Fragen oder Informationen oder zur Dokumentation von Auftragsvorgaben verwendet werden.  Sie dient dem Austausch der topfact AG mit Kunden und dessen Partnern (z.B. Systemhaus oder dem Softwarepartner des Kunden) um verbindliche Informationen bereitzustellen. \r\nDie Anlage der Punkte und Zuweisung der Verantwortlichkeit geschieht durch die topfact AG. Die zugewiesene Verantwortlichkeit, steht jeweils unter dem Checklisten Punkt. Dabei steht der Kunde in Klarschrift dort, Dritte ganz allgemein mit dem Begriff \"Partner\". \r\n\r\n\r\nWie kommen die Checklistenpunkte in die Liste?\r\nDie Checklistenpunkte pflegt der Bearbeiter der topfact AG, meist ist das der Projektleiter. Der Kunde tauscht sich mit dem Projektleiter aus, z.B. über die Kommentarfunktion oder im Projekt-Jour Fix . Die Erkenntnis daraus wird dann vom Projektleiter in den Checklistenpunkten festgehalten. Der Kunde prüft regelmäßig den Stand der Einträge, da hier auch der Projektfortschritt definiert ist. Dazu kann der Status und der hinterlegte Text über das drei Punkte Symbol vom Kunden geprüft werden.\r\n\r\nWichtig: Unbedingt Status und Textinhalte anschauen und falls gefordert reagieren, um Zeitverluste zu vermeiden.\r\n\r\nDer Kunde kann Rückmeldungen eintragen?\r\nWenn eine Entscheidung des Kunden ansteht, kann diese vom topfact Projektleiter als Checklistenpunkt formuliert werden. Der Kunde kann dann entscheiden wie vorgegangen werden soll und muss ein kurzes Statement hinterlegen. Darüber hinaus kann jederzeit ganz einfach die Kommentarfunktion für weitere Angaben genutzt werden.",
  "Url": "https://services.topfact.de/wiki/pages/view?g=ecf5a9eb-c1ce-4be2-9d00-6c6c28c6620c"
}