{
  "PageID": 17196,
  "PageGuid": "c4589e9b-374b-46cf-9320-93b74cd43822",
  "Title": "FileReader Konfiguration",
  "Content": "Dieser Seite beschreibt die Konfiguration des topfact6 Jobserver Moduls FileReader.\r\n\r\nKonfiguration\r\nLupe-Symbol (Import-, Sicherungs- und Fehlerordner)\r\nBei einem Klick wird der Windows-Explorer geöffnet und zeigt das angegebene Verzeichnis an.\r\nPaketgröße\r\nDie Paketgröße gibt die an, wie viele Dateien pro Durchlauf vom FileReader eingelesen und verarbeitet werden sollen.\r\nVerarbeitung von Dateien verzögern (in Millisekunden)\r\nDieser Konfigurationspunkt bestimmt, wie lange der FileReader warten muss, bevor er eine weitere Datei verarbeitet. (1000 Millisekunden = 1 Sekunde)\r\ngültige Dateierweiterung\r\nDurch ein Komma (,) getrennt können mehrere Dateiendungen angegeben werden.\r\nungültige Dateierweiterung\r\nSollte hier keine Dateiendung angegeben werden, muss eine Tilde (~) eingetragen werden. Dies ist bei den gültigen Dateierweiterungen nicht notwendig.\r\nDurch ein Komma (,) getrennt können mehrere Dateiendungen angegeben werden.\r\nungültiges Datei-Prefix\r\nDurch die Angabe eines Datei-Prefixes können Dateien ausgeschlossen werden, deren Dateinamen mit den angegebenen Prefixes beginnt.\r\nDurch ein Komma (,) getrennt können mehrere Dateiendungen angegeben werden.\r\ntfSearch Link erzeugen\r\nMit dem Aktivieren dieser Option wird in das Verzeichnis, aus dem eine Datei abgeholt wurde, eine \"{Original_Dateiname}.tfsearch\" Datei erzeugt, welche von TFSearch gelesen und interpretiert werden kann.\r\n\r\nArchiv\r\nIn der Registerkarte Archiv wird die Einstellung zum verwendeten Dokumentenmanagementsystem angegeben.\r\n\r\nArchivkonfiguration des FileReaders\r\nDMS System\r\nUnterstützte Archivsysteme sind DocuWare und topfact Archiv. Für die Konfiguration eines DouWare Archiv wird eine Platform URL benötigt.\r\nArchivierungsziel\r\nUnterstütze Archivierungsziele sind Archiv und Briefkorb.\r\nVerbindung laden\r\nFalls in der topfact6 Administration unter den System Einstellungen ein DMS hinterlegt wurde, werden bei einem Klick auf den Button die dort hinterlegten Inforamtionen eingetragen.\r\nLupe-Symbol (Archiv & Briefkorb)\r\nLädt alle Archive und Briefkörbe, die zu der angegebenen Archivkonfiguration gefunden werden können. Werden keine Archive/Briefkörbe oder nicht die Richtigen angezeigt, müssen die Angaben Überprüft werden.\r\nVerbindung testen\r\nÜber den Verbindung testen Button kann zustätzlich überprüft werden, ob mit den Angaben eine Verbindung zum DMS hergestellt werden kann.\r\n\r\nVerschlagwortung\r\nIn der Registerkarte Archiv wird definiert, wie ein Beleg seine Indexdaten erhält, mit denen er dann ins Archiv abgelegt wird.\r\n\r\nVerschlagwortungskonfiguration für einen Verzeichniswert\r\nArt der Verschlagwortung Verzeichniswert\r\nWird als Art Verzeichniswert ausgewählt, kann die Ordnerebene so wie der genaue Teil des Ordnernamens definiert werden. Dabei stellt der angegebene Importordner die Ebene 0 dar, das ist der Root-Ordner.\r\nVerzeichnisebene\r\nDie Nummer des Ordners, der für die Verschlagwortung hergenommen werden soll, in der Ordnerstruktur nach dem Root-Ordner (Importordner).\r\nSeperator\r\nGibt die Trennzeichenfolge an, anhand welcher der Odnername getrennt werden soll.\r\nSeperatorteil\r\nDefiniert welcher Teil des Ordnernamens für die Verschlagwortung verwendet werden soll, wenn der Name anhand des zuvor angegebenen Seperators getrennt wird.\r\nDabei wird ein auf 0 basierender Index erwartet. (0 = erster Teil des Ordnernamens)\r\nStartindex\r\nBestimmt die Anfangsnummer des Teilordnernames, von dem ab der Verschlagwortunswert gelesen werden soll. (Teilordnername = Teil des Ordnernamens, der anhand des Seperators und des Speratorteil geteilt wurde)\r\nDabei wird ein auf 0 basierender Index erwartet. (0 = erster Zeichen des Teilordnernames)\r\nIndexlänge\r\nDabei wird bestimmt, wie lange der ausgelesene Wert maximal sein darf. Es empfiehlt sich, die Länge des verwendeten Archivfelds anzugeben.\r\n\r\nVerschlagwortungskonfiguration für einen Variablen Wert\r\nArt der Verschlagwortung Variable\r\nWird als Art Variable ausgewählt, kann eine Variable für die Verschlagwortung ausgewählt werden.\r\nVariablen\r\nDie verfügbaren Variablen sind:\r\n·Dateierstellung\r\n·letze Dateiänderung\r\n·Dateierweiterung\r\n·MD5 Prüfsummer\r\n·Heutiger Tag\r\n·Dateiname mit Dateierweiterung\r\n·Dateiname ohner Dateierweiterung\r\n·Aktuelles Datum (ohne Uhrzeit)\r\n·Aktuelles Datum und Uhrzeit\r\n·Ordnername (Name des Ordners, in dem die Datei liegt)\r\n·Projekt Ordnername (Alle Odner, nach dem Rootodner)\r\n·PDF Erstellzeitpunkt\r\n·PDF Änderungszeitpunkt\r\n·PDF Verfasser\r\n·PDF Titel\r\n\r\nVerschlagwortungskonfiguration für einen Dateiwert\r\nArt der Verschlagwortung Dateiwert\r\nWird als Art Dateiwert ausgewählt, kann ein Teil des Dateinamens für die Verschlagwortung definiert werden.\r\nSeperator\r\nGibt die Trennzeichenfolge an, anhand welcher der Dateiname getrennt werden soll.\r\nSeperatorteil\r\nDefiniert welcher Teil des Dateinamens für die Verschlagwortung verwendet werden soll, wenn der Name anhand des zuvor angegebenen Seperators getrennt wird.\r\nDabei wird ein auf 0 basierender Index erwartet. (0 = erster Teil des Dateinamens)\r\nDatei ohne Erweiterung verwenden\r\nDabei wird der Dateiname ohne der Dateiendung verwendet (z.B. ohne .pdf, falls die eingelesene Datei eine PDF-Datei ist).\r\n\r\nVerschlagwortungskonfiguration für einen Festen Wert\r\nType Fester Wert\r\nWird der Type Fester Wert ausgewählt, kann ein fixer Wert für ein Archivfeld definiert werden.\r\n\r\nOptionen\r\nMD5 Prüfsummenerkennung aktivieren\r\nAktivieren Sie die Option um eine MD5 Prüfung im Archiv durchzuführen. Sie können diese Option verwenden um ein doppeltes einlesen von Importdateien zuverhindern.\r\n·Archivfeld für MD5 Prüfsumme, wählen Sie hier das Archivfeld aus in dem der FileReader nach MD5 Informationen suchen soll.\r\n·Aktivieren Sie die Option \"MD5 Dateiduplikate in Fehlerordner verschieben?\", wenn die MD5 Prüfsumme bereits im Archiv gefunden wurde. Hierzu ist es notwendig das Archivfeld auszuwählen.\r\nFotogalerie Funktion aktivieren\r\nDruch aktivieren dieser Option werden die Dateien für die topfact Fotogalarie vorbereitet.\r\nDabei werden die Originaldateien als .zip Datei gepackt und im Archiv an das Dokument angehangen.\r\nZUGFeRD Datenüberprüfung aktivieren\r\nWird diese Option aktiviert, muss ein Exportordner definiert werden. Dorthin werden alle Dokumente, die vom FileReader als PDF-A Dateien, die eine ZUGFeRD XML-Datei im Anhang haben, aufgesplittet (in PDF und XML) für die weitere Verarbeitung abgelegt.\r\nFormularverschmelzung aktivieren\r\nMit der Aktivierung dieser Funktion können Dokumente mit einer Datei verschmolzen werden. Das wird z.B. für das Einfügen eines Briefkopfs verwenden.\r\n·Wählen Sie den Pfad zu dem Formular für die erste Seite der importierten Dokumente aus\r\n·Wählen Sie den Pfad zur dem Formular für die restlichen Seiten der importierten Dokumente aus",
  "Url": "https://services.topfact.de/wiki/pages/view?g=c4589e9b-374b-46cf-9320-93b74cd43822"
}