{
  "PageID": 17201,
  "PageGuid": "1ff09521-d62d-41dc-a020-ebee7e07fd25",
  "Title": "GWC Konfiguration",
  "Content": "Diese Seite beschreibt die Konfiguration des topfact6 Jobserver Moduls GWC\r\n\r\nExchange\r\nHier können Einstellungen vorgenommen werden, um sich mit Exchange zu verbinden.\r\n\r\nWebservice URL - hier wird die URL des Exchange-Webservices eingetragen. Diese ist immer gleich aufgebaut: https://SERVERNAME/ews/exchange.asmx, wobei der SERVERNAME (des Exchange-Servers) selbstverständlich angepasst werden muss.\r\nExchange Version - hier ist die verwendete Version von Exchange einzutragen. Im Zweifel lieber eine zu niedrige Version auswählen.\r\nIdentitätswechsel aktivieren - Identitätswechsel bedeutet, dass der Benutzer die Identität des Postfach-Benutzers anwenden darf. Das ist v.a. sinnvoll für viele Postfächer, da man ansonsten zu jedem Postfach den jeweiligen Besitzer einstellen muss.\r\nWindows Zugangsdaten verwenden - im Normalfall nicht empfohlen\r\nAnmeldetyp - eigentlich immer Netzwerkanmeldung mit den enstprechenden Anmeldedaten (Benutzername, Kennwort, Domäne) damit man unabhängig von Benutzereinstellungen ist. Daher auch immer in Kombination mit Identitätswechsel.\r\nZeitraum - hier ist einzustellen, aus welchem Zeitraum die Emails abgeholt werden sollen. Im Normalfall stellt man \"Tage zurück\" ein, genaue Zeit ist nach Kundenwunsch. Zeitraum bietet sich für einmaligen Email-Export an.\r\n\r\nOptionen\r\nHier werden die Optionen für die GWC-Aufgabe eingestellt.\r\n\r\nGlobaler Abholordner - Das muss ausgefüllt werden, wenn ein Ordner existiert, der bei mehreren Nutzern in jedem (eingestellten) Postfach automatisch angelegt wird und dann darauf zugegriffen wird. Dieser müsste dann nicht extra konfiguriert werden.\r\nE-Mails in Unterordner verarbeiten - Sollen die E-Mails auch in den Unterordnern verarbeitet werden?\r\nBackupordner - braucht man nie\r\nKategorie - Alle diese Kategorien sind Outlook-Kategorien, die dann genau so übernommen werden. Standardmäßig ist folgendes eingetragen:\r\nKategorie - automatisch archiviert\r\nKategorie mit Anhang  - automatisch archiviert\r\nKategorie Whitelist  - GWC Whitelist\r\nKategorie Blacklist  - GWC Blacklist\r\nKategorie Filter  - GWC Filter\r\nKategorie Duplikat  - GWC Duplikat\r\nEinzelprüfung aktivieren (UniqueId)  - dadurch wird ein und die selbe E-Mail nur ein einziges Mal verarbeitet\r\nInhaltsprüfung aktivieren (Duplikat) - dadurch werden E-Mails nicht doppelt archiviert - falls z.B. eine E-Mail doppelt versendet wurde oder eine E-Mail an mehrere Nutzer der gleichen Firma gesendet wurde, ...\r\nDuplikat weiter verarbeiten (Link erstellen)  - wird nicht benötigt\r\nE-Mails nicht archivieren  - E-Mails werden nicht archiviert.\r\nE-Mails nach Archivierung löschen  - wurde noch nie verwendet.\r\nE-Mails immer löschen (auch bei nicht archivieren)  - wurde noch nie verwendet.\r\nAnhänge in E-Mails löschen  - wurde noch nie verwendet.\r\nAnhänge als Dokumentenanhang archivieren  - damit werden die E-Mail UND der Anhang in einem Dokument archiviert.\r\nAnhänge exportieren  - damit können Anhänge exportiert werden.\r\nExportordner  - Ordner, in den die Anhänge exportiert werden sollen.\r\nExportfilter  - welche Dateien sollen verarbeitet werden? -> Dateiendungen eingeben, durch Komma getrennt.\r\nAnhänge aus selber E-Mail kennzeichnen  - dadurch ist klar, welche Anhänge zu ein und derselben E-Mail gehören.\r\nAnhänge Checksum Prüfung aktivieren  - damit werden doppelte Anhänge nicht doppelt archiviert, falls ein Anhang beispielsweise in zwei verschiedenen Mails auftaucht.\r\nPause zwischen der Verarbeitung von E-Mails  - standardmäßig 0,5 bis 1 Sekunde eingeben: Also 500 oder 1000.\r\n\r\nSichere Absender\r\nHier kann man einschränken, welche E-Mails verarbeitet werden sollen. Wenn Sie hier sichere Absender hinzufügen, dann werden nur E-Mails verarbeitet, deren Absender aus dieser Liste stammt.\r\nKeine Kombination mit blockierten Absendern möglich.\r\n\r\nBlockierte Absender\r\nHier kann die Verarbeitung von bestimmten E-Mails eingeschränkt werden. Es wird keine E-Mail versendet, deren Absender auf dieser Liste steht.\r\nKeine Kombination mit sicheren Absendern möglich.\r\n\r\nFilter\r\nFilter beziehen sich auf Inhalte der E-Mail: Z.B. könnte man alle Mails rausfiltern und damit nicht verarbeiten, in denen im Betreff \"Spam\" steht. Für das Anlegen dieser Filter verwendet man reguläre Ausdrücke und kann diese auch direkt überprüfen, indem man auf \"Prüfen\" klickt.\r\n\r\ntopteam\r\nDie Einstellungen für topteam sind zu ignorieren, da sie nur relevant sind, wenn jemand topteam im Einsatz hat.",
  "Url": "https://services.topfact.de/wiki/pages/view?g=1ff09521-d62d-41dc-a020-ebee7e07fd25"
}