{
  "PageID": 17220,
  "PageGuid": "653ea150-1726-4695-9883-ab63f6c44cfc",
  "Title": "VersionControl",
  "Content": "VersionControl\r\nImmer die aktuellen Belege im Archiv\r\ntf6 VersionControl überwacht automatisiert die vorhandenen Belegversionen im Archiv. Bei Erkennung einer neuen Version eines bereits vorhandenen Beleges, wird die neue Version nach vordefinierten Regeln versioniert und die alten Versionen ggf. ausgeblendet.\r\n\r\ntf6 VersionControl eignet sich ideal zur belegartabhängigen Steuerung der Versionierung. So kann bei Angeboten die Versionierung derart eingestellt werden, dass alle Angebotsversionen sichtbar sind, aber nur der letzte Druck gültig ist. Bei anderen Drucken, z. B. Rechnungen, soll nur die letzte Version sichtbar sein.\r\n \r\n \r\n \r\nTechnik\r\nVersion Control arbeitet auf Basis einer Zeittabelle die Sie selbständig einstellen können.\r\n \r\n\r\n \r\n \r\nEs können unterschiedliche Jobs angelegt werden. \r\n \r\n\r\n \r\nStartbildschirm zur Definition des Jobs:\r\n\r\n\r\n \r\nJeder Job definiert über einen Filter welche Dokumente in die Betrachtung aufgenommen werden sollen.\r\n \r\n\r\n \r\nDas bedeutet in diesem Beispiel  u.a. werden alle Dokumente betrachtet, deren Belegart nicht leer ist, die aus PDS kommen und deren Versionsstatus noch leer ist. \r\n \r\nÜber die Gruppierung wird ermittelt, welche Kriterien bei gleichzeitiger Betrachtung den Dubletten anzeigen, falls mehr als eine Zeile vorhanden ist.\r\n\r\n\r\n \r\nDabei ist das Sortierungsfeld die DWDOCID im Archiv. Aufsteigend bedeutet, je kleiner desto älter.\r\n \r\nDubletten erkannt: Was soll getan werden, wenn aus der Gruppierungsdefinition mehrere Zeilen gleichen Inhalts zurückkommen? In der vorher festgelegten Reihenfolge werden nun vom ältesten zum neusten Beleg alle Beleg mit diesen Daten versehen, solange es noch eine weitere Zeile gibt:\r\n \r\n\r\n \r\nDie letzte Zeile ist dann der neuste Beleg und dieser erhält diese  Angaben:\r\n \r\n\r\n \r\nDas Ergebnis im Archiv könnte dann so aussehen:\r\n \r\n\r\n \r\nBei dieser Suche wurden alle „alten“ Versionen ausgeblendet. Man sieht schon, dass da auch großer Mengen Datenmüll entsorgt werden könnten. Dazu könnte man Löschjobs im Archiv auf alle Dokumente mit dem Versionsstatus „alt“ einrichten.\r\n \r\nBITTE BEACHTEN: Man sollte Version Control nicht für Dokumente einsetzen, die mit Stempeln bearbeitet werden, weil sonst die Bearbeitungsinformationen verloren gehen. \r\n\r\nIm praktischen Betrieb ist Version Control sehr hilfreich, weil es im Hintergrund einen Großteil des Datenmülls auch als diesen kategorisiert und das Löschen oder Ausblenden bei der Anzeige im Archiv den Blick aufs wesentliche schärft.",
  "Url": "https://services.topfact.de/wiki/pages/view?g=653ea150-1726-4695-9883-ab63f6c44cfc"
}