{
  "PageID": 17226,
  "PageGuid": "26e9c947-47bc-4766-bc9f-83d0e58ffc06",
  "Title": "FAQ MyWork Gestaltungsoptionen zu Skin Oberfläche Darstellung",
  "Content": "Diese Seite beschreibt die Möglichkeiten MyWork individuell zu gestalten.\r\n\r\npersönliche Einstellungen\r\nIn den Benutzereinstellungen von MyWork können Sie Ihre persönlichen Daten anpassen.\r\n1) Sie haben die Möglichkeit mir einem Rechtsklick auf das freie Feld ein Profilbild einzustellen...\r\n2) ... und dieses mit einem Rechtsklick wieder zu löschen oder zu ändern.\r\nDiese Einstellungen werden beispielsweise im QuickCheck angezeigt, wenn Sie einen Stempel oder Kommentar an ein Beleg angebracht haben. Mit Namen und Profilbild ist dann übersichtlich und schnell erkennbar, wer den Beleg wie bearbeitet hat.\r\n\r\nAnsichts-Einstellungen und Optionen\r\nJeder arbeitet anders. Deshalb gibt es einige Gestaltungsoptionen, die individuell einstellbar sind.\r\nÜber \"Startseite\" kann eingestellt werden, was beim Öffnen von MyWork angezeigt wird. Dabei gibt es über das Drop-Down-Menü einige Auswahlmöglichkeiten, wobei die meisten wahrscheinlich die \"Dokumentenstruktur\" auswählen.\r\nBei den verschiedenen Filtermodi haben Sie die Auswahl aus \"Filter\" (=\"Standard\"), was nur Treffer aus der Suche anzeigt und \"Suchen\", was an der Menge der angezeigten Elemente nichts ändert, jedoch Treffer der Suche markiert.\r\nGenauso kann die vor eingestellte Filterbedingung geändert werden. Diese kann dann allerdings individuell in der entsprechenden Tabelle erneut angepasst werden.\r\nEmpfohlen werden die Haken bei \"Suchfelder über der Ergebnisliste anzeigen\", damit sofort erkennbar ist, nach welchen Belegen gesucht wird, also welche Belege auch angezeigt werden und bei \"Filtereinstellungen in Ergebnisliste beim Verlassen der Liste entfernen\", damit einmal gefilterte Ergebnisse bei der nächsten unabhängigen Suche nicht auch sofort gefiltert werden.\r\nAußerdem gibt es noch ein paar Einstellmöglichkeiten für den QuickIndex - also DEN Ort, wo verschlagwortet wird. Besonders interessant ist hierbei die Option \"Änderungen an Indexdaten im Quickindex automatisch speichern\". Mit Setzen des Häkchens muss bei der Verschlagwortung von mehreren Belegen nicht alles extra gespeichert werden, sondern man kann schnell zum nächsten Dokument über gehen.\r\n\r\nÄndern der Hintergrund-Farbe\r\nMyWork wird standardmäßig in blau ausgeliefert. Das ist Ihnen zu langweilig, zu sehr standard, zu blau?\r\nMit einem Klick auf die entsprechenden Symbole oben rechts bietet sich Ihnen eine noch viel größere Auswahl an Farben.",
  "Url": "https://services.topfact.de/wiki/pages/view?g=26e9c947-47bc-4766-bc9f-83d0e58ffc06"
}