{
  "PageID": 17233,
  "PageGuid": "67d4df97-3a21-4065-ad84-9e3fdc4dd6e0",
  "Title": "FibuConnect Bankverbindungen",
  "Content": "Dieser Seite beschreibt die Konfiguration von FibuConnect Bankverbindungen\r\n\r\nBankverbindung Import\r\nBankverbindungen importieren\r\nDer Import der Bankverbindungen wird über den Button gestartet.\r\n\r\nIm Import Dialogfenster muss eine Fallback-Organisation angegeben werden.\r\nDiese Organisation wird verwendet, falls die Organisation, welche in der CSV-Datei angegeben ist, nicht in dem System ausfindig gemacht werden kann.\r\nEs muss eine zu importierende CSV-Datei angegeben oder ausgewählt werden.\r\nDie Auswahl kann über den Button der Textbox CSV-Datei getroffen werden.\r\nDer Aufbau der CSV-Datei muss dem Aufbau »Exportdatei« entsprechen.\r\nSind Spalten in der CSV-Datei nicht ausgefüllt, so werden diese Werte mit NULL in die Tabelle geschrieben.\r\nAusnahme:\r\nFehlen zu der Angabe einer IBAN der Bankname und die BIC, so werden diese versucht anhand der IBAN zu ermitteln.\r\nMit der Option Mehrfache Einträge nach dem Import löschen? wird eine Duplettenprüfung auf alle Bankverbindungen gemacht.\r\nEs werden alle doppelten Einträge gelöscht, sodass jeder Eintrag nur noch einmal im System vorhanden ist.\r\nDie Überprüfung findet immer auf die eindeutig identifizierenden Spalten Organisation und IBAN statt.\r\nWichtig:\r\nDie erste Zeile in der CSV-Datei wird immer übersprungen, da davon ausgegangen wird, dass die 1. Zeile immer die Spaltennamen einhält.\r\n\r\nBankverbindung Export\r\nBankverbindungen exportieren \r\nDer Button  exportiert alle Bankverbindungen in eine CSV-Datei, die in dem Ordner, der ausgewählt wird, erstellt wird.\r\nDiese CSV-Datei erhält den Namen Bankverbindungen_Stammdaten.csv. Ist bereits eine Datei mit diesem Namen vorhanden, wird sie vor dem Export gelöscht und neuerstellt.\r\nDer Spaltenaufbau der CSV ist wie folgt:\r\nOrganisation;Bank;Inhaber;IBAN;BIC;Beschreibung\r\n\r\nEine Vorlage dieser CSV-Datei befindet sich im Anhang der Seite.",
  "Url": "https://services.topfact.de/wiki/pages/view?g=67d4df97-3a21-4065-ad84-9e3fdc4dd6e0"
}