{
  "PageID": 17249,
  "PageGuid": "867bf763-9c8d-4e5c-b51e-ea2804ddc3c8",
  "Title": "FibuConnect Zahlungsbedingungen",
  "Content": "Dieser Seite beschreibt die Konfiguration von FibuConnect Zahlungsbedingungen\r\n\r\nZahlungsbedingungen Import\r\nZahlungsbedingungen importieren\r\nDer Import der Zahlungsbedingungen wird über den Button gestartet.\r\n\r\nIm Import Dialogfenster muss eine Fallback-Organisation angegeben werden.\r\nDiese Organisation wird verwendet, falls die Organisation, welche in der CSV-Datei angegeben ist, nicht in dem System ausfindig gemacht werden kann.\r\nEbenso muss ein Fallback-Mandant angegeben werden.\r\nDieser Mandant wird verwendet, falls der Mandant, welche in der CSV-Datei angegeben ist, nicht in dem System ausfindig gemacht werden kann.\r\nAnmerkung:\r\nDie Mandanten werden in Abhängigkeit zur Organisation geladen.\r\nEs muss eine zu importierende CSV-Datei angegeben oder ausgewählt werden.\r\nDie Auswahl kann über den Button der Textbox CSV-Datei getroffen werden.\r\nDer Aufbau der CSV-Datei muss dem Aufbau »Exportdatei« entsprechen.\r\nSind Spalten in der CSV-Datei nicht ausgefüllt, so werden diese Werte mit NULL in die Tabelle geschrieben.\r\nAusnahme:\r\nEs wird versucht die Kreditornummer anhand des angegebenen Kreditornamen zu ermitteln, sofern die Nummern nicht angegeben wurde. \r\nMit der Option Mehrfache Einträge nach dem Import löschen? wird eine Duplettenprüfung auf alle Zahlungsbedingungen gemacht.\r\nEs werden alle doppelten Einträge gelöscht, sodass jeder Eintrag nur noch einmal im System vorhanden ist.\r\nDie Überprüfung findet immer auf die eindeutig identifizierenden Spalten Organisation, Mandant und Kreditornummer statt.\r\nWichtig:\r\nDie erste Zeile in der CSV-Datei wird immer übersprungen, da davon ausgegangen wird, dass die 1. Zeile immer die Spaltennamen einhält.\r\n\r\nZahlungsbedingungen Export\r\nZahlungsbedingungen exportieren \r\nDer Button exportiert alle Zahlungsbedingungen in eine CSV-Datei, die in dem Ordner, der ausgewählt wird, erstellt wird.\r\nDiese CSV-Datei erhält den Namen Zahlungsbedingungen_Stammdaten.csv. Ist bereits eine Datei mit diesem Namen vorhanden, wird sie vor dem Export gelöscht und neuerstellt.\r\nDer Spaltenaufbau der CSV ist wie folgt:\r\nOrganisation;Mandant Nummer;Mandant;Kreditor Nummer;Kreditor;Skonto 1;Skonto Tage 1;Ziel Monat 1;Skonto 2;Skonto Tage 2;Ziel Monat 2;Netto Tage\r\n\r\nEine Vorlage dieser CSV-Datei befindet sich im Anhang der Seite.",
  "Url": "https://services.topfact.de/wiki/pages/view?g=867bf763-9c8d-4e5c-b51e-ea2804ddc3c8"
}