{
  "PageID": 17255,
  "PageGuid": "214216ad-c28c-4f73-b1f4-70f888d4fafc",
  "Title": "Release Notes für das Produkt topfact6 Administration",
  "Content": "Dieses Dokumente beinhaltet alle Release Notes für das Produkt topfact6 Administration.\r\nDie Release Notes für weitere topfact6 Produkte finden Sie hier im topfact Wiki unter den angegebenen Links\r\n·topfact6 Jobserver\r\n·topfact6 MyWork\r\n·topfact6 BestPeople\r\n·topfact6 Facility\r\n·topfact Archiv\r\n·topfact MyWork App\r\nBitte beachten Sie. Die Screenshots zeigen eventuell Funktion für zukünftige Versionen die kein Bestandteil der aktuellen Version sind.\r\nSollten Sie zu den beschriebenen Funktionen Fragen haben, kontaktieren Sie uns über topfact TIC und senden uns eine Anfrage.\r\n\r\nVersion 2020.07\r\nFür diese Programmversion ist die topfact6 MyWork ab der Version 2020.7.1.1 notwendig. \r\nNeue Funktionen:\r\n·Konfiguration von Dialogen für die Suche, Ablage (Indexierung) und Ergebnislisten\r\n·Auswahl von Ergebnislisten und Ablagedialogen in Dokumentenstrukturen\r\n·Auswahl von Stempeln für eine Dokumentenstruktur\r\n·Die Anlage eines neuen Anwendungsarchiv erstellt die Standarddialoge für das Archiv\r\nGeänderte Funktionen:\r\n·Konfiguration der Archivfelder in den Anwendungsarchiven wurde entfernt\r\n·\"Manuelle Eingabe durch den Benutzer sperren\"-Option wurde in der Datenauswahl entfernt\r\nBehobene Bugs und Verbesserungen:\r\n·Archivfelder werden in den Stempeln wieder richtig geladen\r\n·Das Ausgwählte Archiv in den Stemplen wird wieder richtig hergestellt\r\n·Dokumentenstrukturen können wieder kopiert, importiert und exportiert werden\r\n·Archivfelder in der Datenauswahl werden wieder richtig geladen\r\n\r\n\r\nKonfiguration eines Suchdialogs\r\n\r\nVersion 2020.10.\r\nFür diese Programmversion ist die topfact6 MyWork ab der Version 2020.10.1.1 notwendig. \r\nNeue Funktionen:\r\n·Neuer Dialogtyp Ablagedialog\r\n·Dialogfelder in einem Indexdialog können jetzt als Schleppfelder definiert werden\r\n·Folgedialoge können in den Dialogen definiert werden\r\noIn Suchdialoge kann einen nachfolgender Ergebnisdialog ausgewählt werden\r\noIn Ergebnisdialogen kann ein nachfolgender Änderungs- und Ablagedialog ausgewählt werden\r\n·FibuConnect Zahlungsbedingungen können jetzt auch im Kreditor direkt erfasst werden\r\n\r\nGeänderte Funktionen:\r\n·Neue Auswahloberfläche für Dokumentenstrukturen in der Gruppenkonfiguration\r\n·Neue Auswahloberfläche für Profile in der Gruppenkonfiguration\r\n\r\nBehobene Bugs und Verbesserungen:\r\n·Fehlerbehebung für den Einrichtungswizard\r\noOrganisation wird nun aus der Lizenz erstellt und gespeichert\r\noOrgID für die angelegten Konfigurationen wird nun weggespeichert\r\noDatenbankstruktur wurde aktualisiert\r\noFalsche Erfolgsmeldung bei der Anlage der Archivfelder wurde behoben\r\n\r\n\r\nSchleppfeldoption in Änderungsdialogen\r\n\r\nNeues Auswahlfenster für Dokumentenstrukturen\r\n\r\nErfassungsmaske für die FibuConnect Zahlungsbedingungen im Kreditor\r\n\r\nVersion 2020.11\r\nFür diese Programmversion ist die topfact6 MyWork ab der Version 2020.11.1.1 notwendig. \r\nNeue Funktionen:\r\n·Bereiche können in Dokumentenstrukturen für die Indexwerte bei der Dokumentensuche definiert werden (z.B. Zeiträume, Zahlenbereiche, Betragbereiche)\r\n·Erweiterung der Standardwerte für topfact Archiv Felder wurden erweitert:\r\noFür Textfelder:\r\n§\"letzter Zugriff Benutzername\" - Der Benutzername wird eingetragen, wenn ein Zugriff auf ein Dokument erfolgt\r\n§\"letzte Änderung Benutzername\" - Der Benutzername wird eingetragen, wenn eine Änderung an einem Dokument statt gefunden hat\r\noFür Datumsfelder:\r\n§\"letzter Zugriff Datum\" - Das Datum wird eingetragen, wenn ein Zugriff auf ein Dokument erfolgt\r\n§\"letzte Änderung Datum\" - Das Datum wird eingetragen, wenn eine Änderung an einem Dokument statt gefunden hat\r\n·Neue Detailübersicht in Gridviews für Konfigurationszuweisungen (z.B. Gruppen, Stempel), kann über einen \"Rechtsklick mit der Maus\" auf die Spalte geöffnet werden\r\n·\"Übernehmen\"-Button wurde zu dem Gruppenkonfigurationsfenster hinzugefügt\r\n·\"Drag and Drop\" wurde für Dialogfelder integrieren, Dialogfelder können per Drag and Drop neu sortiert werden\r\n\r\nGeänderte Funktionen:\r\n·Aufgabenarten wurden, in Vorbereitung für die topfact6 Aufgaben, um Gruppen- und Benutzeraktionen erweitert\r\n\r\nBehobene Bugs und Verbesserungen:\r\n·Fehlerbehebung für den Einrichtungswizard\r\noOrganisation wird nun richtig erstellt und gespeichert\r\n\r\n\r\nBereichskonfiguration für einen Zeitraum in einer Dokumentenstruktur\r\n\r\nNeue Gruppen- und Stempel-Zuweisungsvorschau in Gridview\r\n\r\nBenutzer- und Gruppenaktionen in den Aufgabenarten\r\n\r\n\"Drag and Drop\" für das Umsortieren von Dialogfeldern\r\n\r\nVersion 2020.12\r\nFür diese Programmversion ist die topfact6 MyWork ab der Version 2020.12.1.1 notwendig. \r\nNeue Funktionen:\r\n·Die automatisch, beim Start, ausgeführten Migrationen können jetzt manuell gestartet werden.\r\n·XML-Reader kann jetzt XRechnungen verarbeiten. Dafür wird der Report \"Rechnung.repx\" im Pfad \"C:\\ProgramData\\topfact AG\\Reports\" benötigt.\r\n\r\n\r\nManuelle Ausführung von Migrationsschritten in der topfact6 Administration\r\n\r\nVersion 2021.01\r\nFür diese Programmversion ist die topfact6 MyWork ab der Version 2021.1.1.1 notwendig.\r\nNeue Funktionen:\r\n·Aufgabenstandardeinstellungen für das topfact6 Aufgabensystem können je Organisation angelegt werden\r\n\r\nGeänderte Funktionen:\r\n·Gruppen- und Benutzeraktionen in den Aufgabenarten wurden in Zuweisungsreihenfolge und Aufgabenereldigung abgeändert\r\n\r\nBehobene Bugs und Verbesserungen:\r\n·Fehler beim Kopieren und Importieren von Dokumentenstrukturen wurden behoben\r\n\r\n\r\nAufgabenstandardkonfiguration für eine Organisation\r\n\r\nVersion 2021.03\r\nFür diese Programmversion ist die topfact6 MyWork ab der Version 2021.3.1.1 notwendig. \r\nNeue Funktionen:\r\n·Konfiguration von E-Mailvorlagen für topfact6 Aufgaben\r\n·Auswahl von TFA Profilen in dem Fenster der Gruppenkonfiguration hinzugefügt\r\n·Auswahl von Archiv Dialogen in dem Fenster der Gruppenkonfiguration hinzugefügt\r\n\r\nGeänderte Funktionen:\r\n·Erstellung von Indexen auf einige Spalten bei der Erstellung der TFA-Pages-Tabelle\r\n·Erstellung von Indexen auf einige Spalten bei der Erstellung der TFA-Files-Tabelle\r\n\r\nBehobene Bugs und Verbesserungen:\r\n·Fehler bei dem Setzen der Selektierung von Zeilen nach einer Änderung in einer GridView wurden behoben\r\n\r\nAuswahl von TFA Profilen im Gruppenkonfigurationsfenster\r\n\r\n\r\nAuswahl von Archiv Dialogen im Gruppenkonfigurationsfenster\r\n\r\n\r\nKonfiguration für E-Mailvorlagen für Aufgaben\r\n\r\nVersion 2021.04\r\nFür diese Programmversion ist die topfact6 MyWork ab der Version 2021.4.1.1 notwendig. \r\nBehobene Bugs und Verbesserungen:\r\n·Quality of Life Änderungen und kleinere Fehlerbehebungen\r\n\r\nVersion 2021.02\r\nFür diese Programmversion ist die topfact6 MyWork ab der Version 2021.2.1.1 notwendig. \r\nNeue Funktionen:\r\n·Steuerschlüssel können nun Sachkonten zugewiesen werden\r\n·Archivfelder für Anwendungsarchive können nun als CSV-Datei exportiert werden\r\n\r\nGeänderte Funktionen:\r\n·Erweiterung der Archivfeldstandardwerte um \"letze Änderung am\" und \"letzte Änderung von\"\r\n\r\nBehobene Bugs und Verbesserungen:\r\n·Fehlerkorrektur beim Kopieren von Dokumentenstrukturen\r\n·Diverse Fehlerbehebungen im topfact6 Einrichtungsassistenten\r\n\r\n\r\nSteuerschlüssel Zuweisung zu Sachkonten\r\n\r\nVersion 2022.01\r\nFür diese Programmversion ist die topfact6 Administration ab der Version 2022.1 notwendig.\r\ntopfact6 Administration\r\n·Verwendung von Anwendungprofilen zum Delegieren von Aufgaben\r\n·Aufgaben, Übersicht von Jobserver Protokoll und Jobserver Ordnerüberwachung\r\n\r\nVersion 2022.04\r\nFür diese Programmversion ist die topfact6 Administration ab der Version 2022.4 notwendig.\r\n\r\ntopfact6 Administration\r\n·Neue Funktionsprofile für MyWork: Die Rechte auf die Funktionen \"Mehrere Indexdaten ändern\" und \"Annotationen anzeigen\" können konfiguriert werden\r\n·Auto-Update: Es kann nun ein spezifischer Installationsuser mit lokalen Admin-Rechten konfiguriert werden, sodass der Benutzer selber keine Installationsrechte zum Update von topfact6 MyWork benötigt.\r\n·Konfiguration topfact6 JobServer-Moduls XML-Reader: Bei Auswahl von XPath-Ausdrücken aus einer Referenzdatei kann nun gefiltert werden\r\n\r\nVersion 2023.01\r\nFür diese Programmversion ist die topfact6 Administration ab der Version 2023.01 notwendig.\r\n\r\ntopfact6 Administration\r\n·Um eine eindeutige Benutzerzuordnung zu ermöglich, kann ein Benutzername und eine E-Mail-Adresse für Benutzer einer Organisation nicht mehrfach vergeben werden.\r\n·Beim Login überprüft MyWork automatisch, ob der Benutzer eine Lizenz hat. Wenn nicht wird nach nicht genutzten topfact6 MyWork Lizenzen für die Organisation gesucht und dem Benutzer automatisch fest zugewiesen.\r\n\r\nVersion 2023.04\r\n·Prüfen der Archivspalten für benutzerdefinierte Archive\r\n\r\nVersion 2023.07\r\nFür diese Programmversion ist die topfact6 Administration ab der Version 2023.7 notwendig.\r\n\r\ntopfact6 Administration\r\n·Bei der Neuanlage eines Archivs wird nun automatisch eine Archiv-GUID erzeugt\r\n·Es wurde ein Fehler behoben, wonach eine Dokumentenstruktur nicht verschoben werden konnte\r\n\r\nVersion 2023.10\r\nFür diese Programmversion ist die topfact6 Administration ab der Version 20223.10 notwendig.\r\n\r\ntopfact6 Administration\r\n·In der Administration können nur noch Konfigurationen für eine Organisation angezeigt und bearbeitet werden. \r\n·Einem Administrations-User kann nun eingeschränkt werden auf eine spezifische Organisation. Konfigurationen für andere Organisationen werden dem User dann nicht mehr angezigt. Hinweis: Dies gilt nur für KOnfigurationeinstellungen, die Organisationsbespezifisch sind (bspw. Dialoge, Dokumentenstrukturen, Benutzer, Gruppen - jedoch bspw. nicht Datensichten)\r\n·Es wurde ein Bug behoben, der das Kopieren von Dialogen und Dokumentenstrukturen verhindert hat.\r\n\r\nVersion 2024.01\r\nFür diese Programmversion ist die topfact6 Administration ab der Version 2024.01 notwendig.\r\n\r\ntopfact6 Administration\r\n·Es wurde ein Bug behoben, der das Kopieren von Dialogeinstellungen verhindert hat\r\n\r\nVersion 2024.04\r\nFür diese Programmversion ist die topfact6 Administration ab der Version 2024.04 notwendig.\r\n\r\ntopfact6 Administration\r\n·topfact6 API\r\noEs wurde eine topfact6 API entwickelt zur Bereitstellung spezifischer Funktionen des topfact6 Systems\r\noÜber die topfact6 API können Datenobjekte nach vorheriger Authentifizierung bereitgestellt werden, bspw. zur Verwendung in der topfact Mobile App\r\nodie topfact6 API kann empfangene Login-Daten in einer Datenbank überprüfen und bei Erfolg einen Connection-String zur Anmeldung übergeben\r\n·Zentrale Verbindungen\r\noEs können nun zentrale Verbindungen für Archive, Datenbanken und Ordner eingerichtet werden\r\noFür das Modul Database Agent kann eine zentrale Datenbankverbindung ausgewählt werden\r\n·topfact6 Jobserver Modul TeamsNotifier\r\noDie Konfigurationsmaske für den TeamsNotifier steht bereit\r\n·Weitere Verbesserungen\r\noDie Gruppierung und Sortierung der Konfigurationsoberflächen im Menüband wurde logischer gestaltet\r\noEs können grafische Bildstempel eingerichtet und konfiguriert werden\r\noEs wurde ein Bug behoben, der unter bestimmten Umständen die Sortierung der Dokumentenstrukturen verworfen hat\r\noEs wurde ein Bug in der Konfigurationsmaske des Moduls Mail Notifier behoben\r\n\r\nVersion 2024.7.\r\nFür diese Programmversion ist die topfact6 Administration ab der Version 2024.7 notwendig.\r\n\r\ntopfact6 Administration \r\n·Konfigurationsmasken für topfact6 MyWork KI-Funktionen stehen je Archiv bereit\r\n·Die Jobserver-Historie ist jetzt mit Schnellzugriffbuttons (letzten 24h, letzten 7 Tage, letzter Monat, Alle) filterbar\r\n·Jobserveraufgaben können mit Tags versehen werden, um aufgabenübergreifende Workflows zu kennzeichnen\r\n·Jobservermodule mit Archivierungsfunktionen (FileReader, XML-Reader, GWC, etc.) stellen den Status ihres letzten Durchlaufs in der Aktionsübersicht einer Aufgabe dar (Erfolg, Warnung, Fehler)",
  "Url": "https://services.topfact.de/wiki/pages/view?g=214216ad-c28c-4f73-b1f4-70f888d4fafc"
}