{
  "PageID": 17270,
  "PageGuid": "13ff23b8-312f-484c-88b3-a43042086995",
  "Title": "Rahmenbedingungen für topfact Cloud",
  "Content": "Technische Informationen zum Rechenzentrumsbetrieb\r\nDie topfact Cloud arbeitet mit einem der größten Rechenzentren in Deutschland zusammen. Der Betreiber ist die Telehouse Deutschland GmbH. \r\nTelehouse Frankfurt ist nur 3 km vom Stadtzentrum der Handels- und Finanzmetropole entfernt und verfügt über einen Standard entsprechend einer Tier-3-Klassifizierung, um hervorragende Verfügbarkeit und Sicherheit zu gewährleisten. Das gesamte RZ-Gelände erstreckt sich über 67.000 m2 inklusive einer derzeitigen Colocation-Fläche von 25,000 m2. Dies macht Telehouse Frankfurt zu einem der größten Colocation-Anbieter Deutschlands, der mit einem Höchstmaß an Zuverlässigkeit und Skalierbarkeit allen Anforderungen gerecht wird.\r\n\r\nHier die wichtigsten technischen Fakten:\r\nSicherheitsklassifizierung\r\n- Tier-3\r\nStromversorgung\r\n- N+1 redundante, USV-gesicherte Stromversorgung mit Batterie-Backup\r\n- Notstromversorgung mit einer Gesamtleistung von 21 MVA\r\n- Der RZ-Betrieb kann bei Stromausfall 3 Tage unter Volllast aufrechterhalten werden\r\n\r\nKlimatisierung und Umgebung\r\n- N+1 redundant ausgelegte Klimatisierungssysteme\r\n- Konstante Raumtemperatur von 24°C +2/-4°C\r\n- Temperatur in den Rechenzentren wird mittels Sensoren überwacht\r\n\r\nBrandschutz\r\n- Optische / thermische Brandmelder auf zwei Ebenen (Rohdecke und Doppelboden)\r\n- Aktive Brandlöschung durch Inergen Löschanlagen\r\n- Auswahl zwischen Räumen mit aktivem oder passivem Brandschutz\r\n\r\nSicherheit\r\n- Videoüberwachung der Außenbereiche mit Aufzeichnung über einen Zeitraum von 3 Monaten\r\n- Detektierte Zaunanlage zur Abgrenzung des Geländes\r\n- 24/7 besetzter Leitstand auf dem Gelände - Störmeldungen werden über zentrales Kontrollsystem gemeldet\r\n- 24/7 Sicherheitspersonal vor Ort\r\n- Zutrittssystem mit kontaktlosem Ausweissystem und Dokumentation\r\nNetzanbindung\r\n- 12 Provider stellen DNS und Leitungen\r\n- Mehrfach redundante Anbindung an die beiden größten Internetknoten der Welt (DE-CIX und ECIX)\r\n- Alle Systeme mit bis zu 140 Gbit/s erreichbar\r\n\r\nZertifizierungen\r\nDie Cloud Leistungen sind wie folgt zertifiziert:\r\n·ISO/IEC 27001:2013\r\n·PCI-DSS\r\n·ISO 9001:2015\r\n·DIN EN ISO 50001:2011\r\n·Grüner Strom\r\n·ISAE 3402 Type 2\r\nDownload unter https://www.telehouse-rechenzentrum.de/downloads/\r\n\r\nIhre Dokumente und Daten gehören Ihnen\r\nSollte sich ein Kunde zur Beendigung des Vertragsverhältnisses entschließen, unterstützt topfact ihn auf Wunsch dabei, seine Dokumente vom topfact Cloud System herunterzuladen und/oder in ein anderes System zu migrieren. Dafür gibt es zwei Möglichkeiten: \r\n\r\n1.Sie können jederzeit nach Ihren Wünschen die Dokumente und Dateien über den topfact6 MyWork Client selbständig und ohne unsere Hilfe runterladen und auf Ihren Geräten speichern.\r\n2.Bei größeren Datenmengen und vielen Dokumenten, die in aktuelle Prozesse eingebunden sind, helfen die Spezialisten der topfact Anwendungsbetreuung. Deren kostenpflichtige Dienstleistungen haben folgende Vorteile: -- Nach Absprache mit dem Kunden erfolgt der Zugriff auf die Dokumente direkt im Datencenter und so, dass große Datenmengen in kürzester Zeit übergeben werden. -- Lebende sowie in aktuelle Prozesse eingebundene Dokumente werden zeitnah in die Prozesse eines neuen Systems migriert und damit Unterbrechungen der Arbeitsabläufe minimiert.\r\n\r\nIm Anschluss an die Beendigung des Vertragsverhältnisses werden alle Kundendaten innerhalb des topfact Cloud-Systems sowie alle Backup-Daten sicher und unwiderruflich gelöscht.Ein Wiederherstellen der Daten ist ab diesem Zeitpunkt nicht mehr möglich.\r\n\r\nGeschäftsbedingungen für topfact Cloud\r\nFür den jeweiligen Anwendungsfall gelten die Standard Bitkom Geschäftsbedingungen für Cloudgeschäfte, welche die topfact AG übernommen hat:\r\n\r\n·nutzung-von-software-as-a-service-saas-de.pdf\r\n·miete-von-hard-undoder-software-vm-bitkom-de.pdf\r\n·pflege-von-standardsoftware-vps-bitkom-de.pdf\r\n·allgemeine-geschaftsbedingungen-av-bitkom-de.pdf\r\n\r\nDie jeweilige Datei finden Sie nachfolgend.",
  "Url": "https://services.topfact.de/wiki/pages/view?g=13ff23b8-312f-484c-88b3-a43042086995"
}