{
  "PageID": 17330,
  "PageGuid": "a782eaa9-32a1-4385-b7df-dfde44cb4334",
  "Title": "topfact6 Systemvoraussetzungen -  Kundennetzwerk & Firewall topfact Cloud ",
  "Content": "Folgende Systemvoraussetzungen sind für den Betrieb der topfact6 MyWork Cloud nötig.\r\nDiese müssen vor Systemeinrichtung an den Kunden & seine IT Betreuer als Aufgabenpakete übergeben werden.\r\n\r\ntopfact6 Clientanwendungen\r\n·Windows 10/11\r\n·mindestens .NET Framework v4.6.2\r\n·Lizenzierung als named User - jedem MyWork User muss eine Lizenz namentlich zugeordnet sein\r\n\r\nServer für Transfer Service\r\nAls Brückenkopf um aus dem Kundennetzwerk ERP Daten und Dateien ins topfact Archiv hochladen zu können muss der Windows-Dienst \"topfactCloud Transfer Service\" auf einem dedizierten Server installiert und konfiguriert werden.\r\nWährend der Projektphase benötigt die topfact AG Zugriff auf diesen Server um die Installation und Konfiguration des Dienstes durchführen zu können.\r\nDer Kunde und der zuständige IT Betreuuer müssen entscheiden welcher Server hier geeignet ist.\r\n\r\nNetzwerk des Kunden\r\nWas muss am Netzwerk des Kunden konfiguriert / geprüft werden?\r\n1. Schreibrechte auf Abhol-Ordner\r\n·Scan-Abholordner\r\n·ERP-Abholordner\r\n\r\nDa der topfact Cloud Transfer Service aus den Abholordnern des Scanners oder den Abhlordner des ERP Systems die Dateien nach der Übertragung löscht muss der Nutzer bei dem das Cloud Tool läuft schreibende Rechte auf dieses Verzeichnis haben.\r\nKonsequenz: Sonst kann es passieren, dass Dokumente zwar übertragen und archiviert werden - diese aber beim nächsten Durchlauf nicht gelöscht wurden, weiterhin bereitstehen und somit erneut übertragen und mehrfach archiviert werden.\r\n\r\nFirewall des Kunden\r\nWas muss an der Netzwerk-Firewall konfiguriert werden?\r\n\r\n1. Ausgehende Verbindung zum SQL Server via Port 1433 \r\n·Es muss die ausgehende Verbindung auf den Port 1433 auf unseren SQL Server db.topfactcloud.de erlaubt werden\r\n\r\n2. Ausgehende Verbindung zum Archiv via SSL/TLS Zertifizierung\r\n·Es muss die ausgehende Verbindung auf https://app.topfactcloud.de erlaubt werden. Hier muss insbesondere das SSL Zertifikat von der korrekten Validierungstelle (DST Root CA X3) überprüft werden können (siehe Screenshots)\r\n·Das Zertifkat von Serverseite wird aktuell gehalten.\r\n·Es darf keine Proxy-Validierungstelle von der Firewall vorgeschaltet werden\r\n\r\n\r\n\r\n\r\nProbleme entstehen, wenn die Firewall die Validierungstelle durch einen Proxy \"überschreibt\". siehe Screenshot\r\n\r\n\r\nEinzelarbeitsplätze PCs\r\nWas muss an den Einzelarbeitsplätzen konfiguriert / geprüft werden?\r\n·Der topfact MyWork Cloud Client muss installiert werden\r\n·Die neueste Version kann von der topfact AG oder direkt aus dem TIC Portal heruntergeladen werden\r\n\r\nFAQ, Fehler & Fehlermeldungen \r\nWelche Situationen könnten auftreten und wie können wir sie lösen?\r\nLogs auf den PCs der Clients finden Sie unter %programdata%/topfact AG/Logs/MyWork...\r\n\r\nNutzer kann sich nicht in MyWork anmelden\r\nProblem: Es erscheint ein Fehler \"Nutzername & Passwort prüfen\", jedoch sind Nutzername und Passwort korrekt.\r\nUrsache: Die Netzwerk Firewall blockiert den Zugriff auf unseren SQL Server (zum Login genutzt)\r\nLösung: Netzwerk-Firewall muss den Port 1433 auf unseren SQL Server (db.topfactcloud.de) freigegeben werden\r\nZiel: Nutzer kann sich bei MyWork anmelden und die Anwendung startet\r\n\r\nNutzer sieht kein Archiv nach der Anmeldung\r\nProblem: Es erscheinen Fehlermeldungen bei den Dokumentenstrukturen, ein Archivsymbol ist nicht sichtbar\r\nUrsache1: Der Nutzer bzw. Gruppe ist nicht das passende Archiv-Profil zugeordnet um Lese/Schreibzugriff auf das Archiv zu bekommen\r\nUrsache2: Die Netzwerk Firewall blockiert den Zugriff auf unseren Archiv-Endpunkt (topfactcloud.de) wegen einem Zertifikatsfehler. \r\nPrüfen: Im Browser auf dem Benutzer-PC folgendes in die Adresszeile kopieren (wenn ein Zertifikatsfehler kommt, ist das die Ursache): https://app.topfactcloud.de/tfa/documentservice.asmx\r\nPrüfen: Ein Indikator ist, wenn in MyWork die Liste der Dialoge unter \"MyWork > Datei > Systeminformationen > Dialoge\" leer ist. \r\nLösung: Die Netzwerk Firewall muss Zugriff auf https://app.topfactcloud.de mit der Zertifikatsausstellungstelle DST Root CA X3 erlauben.\r\nZiel: Der Nutzer kann in MyWork das Archiv sehen, suchen, Dokumente anzeigen und ohne Fehlermeldung die Dokumentenstrukturen öffnen",
  "Url": "https://services.topfact.de/wiki/pages/view?g=a782eaa9-32a1-4385-b7df-dfde44cb4334"
}