{
  "PageID": 17334,
  "PageGuid": "ba1adc75-ccc1-41bd-b775-6392ddb8c65b",
  "Title": "Installation von MyWork Cloud",
  "Content": "Um MyWork als Client initial zu installieren werden zwei Dateien benötigt:\r\n1.topfact6_MyWork_Cloud.msi (Installationspaket)\r\n2.Logindaten pro Nutzer\r\nBeides erhalten Sie vom topfact Support oder Sie finden diese auf ihrem lokalen DMS/topfact Server im Netzwerk unter dem Freigabeordner \"Software\"\r\nHinweis: Auf manchen PCs sind abhängig von den Sicherheitseinstellungen Administrationsrechte nötig.\r\n\r\n1. Installieren des MSI Pakets\r\nOptional: In manchen Systemumgebungen müssen Installationspakete als Administrator ausgeführt werden.\r\nFühren Sie das msi Paket ( direkt aus dem Netzwerkpfad ) als Administrator aus.\r\nDurch Shift+Rechtsklick auf das msi Paket erhalten Sie die Möglichkeit die Anwendung \"Als anderer Benutzer/Administrator ausführen\".\r\n\r\nLegen Sie eine Verknüpfung für MyWork auf Desktop an\r\n\r\n2. Login\r\nMelden Sie sich bei jedem Installierten Client mit den entsprechenden Nutzerdaten an.\r\nDie Cloud-Version verlangt üblicherweise eine E-Mail Adresse (z.B. vorname.nachname@domain.com) und ein Passwort. \r\nDas Passwort kann vom Administrator so zurückgesetzt werden, dass sich jeder Nutzer ein neues eigenes Passwort vergeben kann. Dies muss beim topfact Support oder beim lokalen tf MyWork Administrator angestoßen werden.\r\n\r\n\r\n3. Testen der Funktionalität\r\nUm eine vollständige Funktionalität einer Client-Installation zu prüfen sollten folgende Bedingungen gegeben sein:\r\n·Die MyWork Anwendung lässt sich öffnen und der Nutzer kann sich mit seiner E-Mail bzw. Nutzernamen anmelden \r\n·In der Anwendung ist das Archiv-Icon und das Such-Icon in der oberen Ribbon-Leiste sichtbar \r\n·Eine Suche im Archiv liefert Belege (Klick auf das Archiv-Symbol, Klick auf OK in der Suche -> Ergebnisliste sollte mehrere Belege laden und anzeigen)\r\n·Doppelklick auf einen einzelnen Beleg sollte den QuickIndex öffnen und den Beleg sowie die Indexdaten anzeigen\r\n·Dokumentenstruktur in der Ribbon-Leiste ist sichtbar und öffnet gewünschte Strukturen\r\n·Die Dokumentenstrukturen enthalten Belege die ebenfalls zu öffnen sind.\r\n\r\n\r\n\r\nNun ist MyWork einsatzbereit und kann vom Nutzer selbst verwendet werden.\r\nBei Fragen wenden Sie sich gerne direkt an unseren Support oder legen in TIC ein neues Support-Ticket an.",
  "Url": "https://services.topfact.de/wiki/pages/view?g=ba1adc75-ccc1-41bd-b775-6392ddb8c65b"
}