{
  "PageID": 17484,
  "PageGuid": "ec693478-8d76-42f0-975d-aeadebde26cb",
  "Title": "Pflichtangaben für Rechnungen",
  "Content": "Frage\r\nWelche Angaben müssen in Kleinrechnungen und in Rechnungen über 250 € enthalten sein?\r\n\r\nLesen Sie dazu bitte die Antwort der IHK Region Stuttgart. Den Link zur Originalseite finden Sie hier: https://www.stuttgart.ihk24.de/fuer-unternehmen/recht-und-steuern/steuerrecht/umsatzsteuer-verbrauchssteuer/umsatzsteuer-national/neue-pflichtangaben-fuer-rechnungen-684834\r\nAntwort / Lösung\r\nZusammengefasster Text (Ausschnitte der Originalseite) der IHK Region Stuttgart:\r\nDas Umsatzsteuergesetz enthält umfassende Vorgaben, wie eine Rechnung auszusehen hat. Bedeutung haben diese Regelungen vor allem für den Vorsteuerabzug des Rechnungsempfängers. So wird im Umsatzsteuer-Anwendungserlass (UStAE) unter anderem ausdrücklich darauf hingewiesen, dass die Angaben in Rechnungen vollständig und richtig sein müssen, um zum Vorsteuerabzug zu berechtigen. Der Rechnungsempfänger hat danach die Pflicht, die Rechnungsangaben auf Vollständigkeit und Richtigkeit zu überprüfen. Welche dies im Einzelnen sind, wird nachfolgend dargestellt. Die Eingangsrechnung hat nach geltendem Recht gem. § 14 Abs. 4 i.V.m. § 14a Abs. 5 UStG folgende Angaben zu enthalten:\r\n·Vollständiger Name und Anschrift des leistenden Unternehmers und des Leistungsempfängers\r\n·Steuernummer oder Umsatzsteueridentifikationsnummer\r\n·Ausstellungsdatum der Rechnung\r\n·Fortlaufende Rechnungsnummer\r\n·Menge und handelsübliche Bezeichnung der gelieferten Gegenstände oder die Art und den Umfang der sonstigen Leistung\r\n·Zeitpunkt der Lieferung bzw. Leistung\r\n·Nach Steuersätzen und -befreiungen aufgeschlüsseltes Entgelt\r\n·Im Voraus vereinbarte Minderungen des Entgelts\r\n·Steuersatz sowie Entgelt und hierauf entfallender Steuerbetrag oder Hinweis auf Steuerbefreiung\r\n·Bei Abrechnung per Gutschrift der Begriff \"Gutschrift\"\r\n·Ggf. Hinweis auf Steuerschuld des Leistungsempfängers\r\nFinden Sie im Anhang ein Rechnungsbeispiel und Checklisten der IHK Region Stuttgart.",
  "Url": "https://services.topfact.de/wiki/pages/view?g=ec693478-8d76-42f0-975d-aeadebde26cb"
}