{
  "PageID": 17538,
  "PageGuid": "bd559ba2-a44d-4350-b986-785fb341aa89",
  "Title": "Projektorganisation - Vorbereitungen des Kunden zur Durchführung der Archivmigration",
  "Content": "Klärungen und Vorbereitungen zur Durchführung der Archivmigration\r\n\r\nArchive können zwischen Standorten (z.B. lokale Einrichtung in die Cloud) oder zwischen unterschiedlichen Systemen (z.B. DocuWare und topfact Archiv!) migriert werden. Bei der Migration verändern sich technische Zusammenhänge, wodurch sich auch Funktionen ändern oder wegfallen.\r\n\r\nUm die gewünschten Daten auf dem Neusystem wieder zur Verfügung zu haben, können sich die Kunden vorbereiten. Nachfolgend finden Sie eine Liste der Tätigkeiten die vor oder während der Migration möglich sind, bzw. im Standard durchgeführt werden.\r\n\r\nTätigkeit\r\nDurchführungsverantwortlich\r\nDurchführungsart\r\nArchivbelege werden ins neue Archiv übertragen\r\ntopfact\r\nStandard Migrationsaufgabe topfact\r\nArchivdokumente werden in PDF gewandelt, wenn das Ursprungsformat  den typischen unveränderbaren Charakter hat, also TIFF, TIF, DWTIFF, PDF ist.\r\ntopfact\r\nStandard Migrationsaufgabe topfact\r\nIn PDF gewandelte Dokumente erhalten Stempel und Anmerkungen aus DocuWare fix in die PDF-Datei.\r\ntopfact\r\nStandard Migrationsaufgabe topfact \r\nHinweis: Abgebildete Datumswerte in DW-Stempeln werden aus technischen Gründen nach der Migration im Format MM/dd/yyyy angezeigt\r\nNicht in PDF gewandelte Dokumente werden im Ursprungsdateiformat übergeben. Stempel und Anmerkungen werden lediglich als Text mitgegeben und sind dann in der chronologischen Darstellung in MyWork Stempelleiste sichtbar.\r\ntopfact\r\nStandard Migrationsaufgabe topfact \r\nDer Volltext aus dem Quellsystem wird einmalig übergeben.\r\ntopfact\r\nStandard Migrationsaufgabe topfact \r\nAbschluss aller offenen Aufgaben\r\nKunde\r\nVorbereitung durch Kunde vor Migration\r\nAufgaben aus MyWork werden nur nach Aufforderung und dann übergeben, wenn auf dem Zielsystem eine eindeutige Verbindung zwischen einem aktiven User und dem Aufgabenbearbeiter des Altsystems herstellbar ist. Aufgaben ehemaliger Anwender können nicht übernommen werden.\r\ntopfact\r\nAufgabenübernahme auf Anforderung\r\nDokumente aus Briefkörben müssen vor der Migration archiviert werden. Briefkorbinhalte werden nicht übertragen.\r\nKunde\r\nVorbereitung durch Kunde vor Migration\r\nKontierungen in FibuConnect müssen abgeschlossen werden und an das FIBU-System übertragen werden. Offene Kontierungen können nicht migriert werden.\r\nKunde\r\nVorbereitung durch Kunde vor Migration\r\nLöschen von Altbeständen die nicht migriert werden sollen, vor der Migration\r\nKunde\r\nVorbereitung durch Kunde vor Migration \r\nZuordnungen der Verantwortlichkeiten beim Wechsel der Benutzernamen (z.B. in bestehenden Feldern wie Bearbeiter1)\r\nKunde + topfact\r\nÄnderung auf Anforderung\r\nLöschung von technisch ungültigen Dokumenten vor der Migration\r\nKunde\r\nVorbereitung durch Kunde vor Migration \r\nÜbertragung persönlicher Beleglisten\r\nKunde\r\nDurchführung durch Kunde nach Inbetriebnahme\r\nÜbernahme durch topfact nur nach gesonderter Aufforderung und Abrechnung nach Aufwand",
  "Url": "https://services.topfact.de/wiki/pages/view?g=bd559ba2-a44d-4350-b986-785fb341aa89"
}