{
  "PageID": 17583,
  "PageGuid": "418c5333-8a6a-449f-b0b6-5f8abffab793",
  "Title": "Docuware: Beim Belegaufruf wird nur eine weiße Seite angezeigt",
  "Content": "Problembeschreibung: \r\n\r\nMyWork ist normal erreichbar, der Archivzugriff über die Suche ist ebenfalls problemlos möglich. Wenn jedoch ein Dokument im DocuWare-Webviewer angezeigt werden soll, wird im Browser nichts geladen. Das Browser-Fenster bleibt weiß. \r\n\r\nLösung: \r\n\r\n1) Stoppen Sie die topfact Dienste\r\n\r\nRufen Sie das Windows-Dienste-Programm über das Startmenü auf und beenden Sie per Rechtsklick die Dienste\r\n\r\ntopfact6 JobServer\r\ntopfact6 Service Watcher\r\n\r\nDies soll weitere Fehlermeldungen im weiteren Verlauf der Störungsbehebung verhinden.\r\n\r\n\r\n\r\n\r\n\r\n2) Beenden des IIS und Webpublishingdienst \r\n\r\nDiese Dienste sind für die Verwaltung der Anfragen zwischen topfact und Docuware zuständig. Diese ebenfalls vorübergehend per Rechtsklick beenden\r\n\r\n\r\n\r\n\r\n3) Stoppen der Docuware-Dienste\r\n\r\nÜber das Docuware Service Control Programm halten Sie vorübergehend alle Docuware Dienste durch Klick auf den unteren Stopp-Button an. \r\n\r\n\r\n\r\nAchtung: dadurch ist Docuware vorübergehend für Ihre Benutzer nicht erreichbar\r\n\r\n\r\n4) Löschen der *.gz-Dateien im C:\\Windows\\temp\r\n\r\nDas sind temporäre Dateien, die durch den WebClient von Docuware erzeugt werden. Löschen Sie diese vollständig. \r\n\r\n\r\n\r\n\r\n5) Neustarten IIS und Webpublishing Dienst\r\n\r\nStarten die die beiden Dienste durch Rechtsklick im Windows-Dienste-Programm neu.\r\n\r\nNeustart der Docuware Anwendungspools im IIS durchführen\r\n\r\n6) Neustart der Docuware-Dienste\r\n\r\nStarten Sie die Docuware Dienste durch Klick auf den \"Start\"-Button in der Docuware Service Control neu. \r\n\r\nNach dem erfolgreichen Neustart ist Docuware ist wieder für Ihre Benutzer erreichbar\r\n\r\n\r\n\r\n7) Neustart der topfact Dienste\r\n\r\nAlle JobServer-Hintergrundjobs laufen wieder normal an. \r\n\r\n\r\n8) Testen Sie die Dokumentenanzeige im Docuware Webclient. \r\n\r\nSollten weiterhin Probleme auftreten, stellen Sie einen anderen Standardbrowser ein. Sollte das auch nicht zum Erfolg führen, wenden Sie sich an die topfact Hotline.",
  "Url": "https://services.topfact.de/wiki/pages/view?g=418c5333-8a6a-449f-b0b6-5f8abffab793"
}