{
  "PageID": 17581,
  "PageGuid": "e5f64b44-1f92-4025-a673-3db8f04e6abc",
  "Title": "FAQ - Wie kann TIC für Supportfälle genutzt werden?",
  "Content": "Frage\r\nDer Kunde hat ein technisches Problem oder möchte Klärung zu einer Situation betreiben. Wie kann er dazu topfact TIC nutzen?\r\nAntwort / Lösung\r\ntopfact verwendet für die Erfassung und Führung von Hotline Anfragen jeder Art, ein System namens TIC, welches die Anfrage direkt an das Supportteam weiterleitet. Sie finden aber auch viele weitere Informationen und können in unseren FAQ selbständig Lösungen recherchieren oder Anregungen suchen.\r\nTransparent und sicher\r\nTIC organisiert den Verlauf der Vorgänge transparent und kommuniziert mit den Teilnehmern über verschlüsselte HTTPS Protokolle. Damit wird im Sinne des Datenschutzes wirksam vermieden, das Daten aus E-Mails ausgelesen werden können. \r\nVorbereitung TIC Zugang\r\nDen Zugang zu TIC erhalten vordefinierte Personen, die im Projekt oder im Umgang mit topfact als Superuser bezeichnet werden können. Nur die topfact Superuser haben das Recht Supportfälle bei der topfact AG zu melden. Wenden Sie sich dazu einfach an Ihren Betreuer oder an die Hotline.\r\n\r\nAblauf für die Meldungserstellung\r\n1.Vorprüfung und qualifizierte Ticketanlage: Die Superuser stellen den Hotline-Fall nach und prüfen soweit möglich die Ursache. Das Ergebnis der Vorprüfung wird als Supportfall qualifiziert in TIC eingestellt.\r\n2.Konkretisierung der Sachlage: In der Regel erfolgen dann qualifizierte und konkretisierende Rückfragen der topfact Hotline per TIC oder die telefonische Kontaktaufnahme durch die Hotline mit dem Superuser.\r\n3.Störungsbehebung: Die Störungsbehebung selbst kann durch unterschiedliche Maßnahmen erfolgen und wird durch die topfact Hotline mit den topfact Superusern abgestimmt. Sämtliche Lösungsrelevanten Informationen zum Supportfall finden sich dann in TIC wieder\r\n\r\n\r\n\r\nKlassifikation von Supportfällen\r\nTIC erzeugt eine eindeutige Vorgangsnummer und dokumentiert den Verlauf. In TIC kann der Superuser die schwere des Supportfalls als Störungsklassifikation definieren und diese begründen. Diese sind:\r\n1.betriebsverhindernde Störung (gilt als Systemausfall) \r\n2.betriebsbehindernde Störung (deutliche Einschränkung im Betrieb) \r\n3.leichte Störung (Einschränkung die umgangen werden kann)",
  "Url": "https://services.topfact.de/wiki/pages/view?g=e5f64b44-1f92-4025-a673-3db8f04e6abc"
}