{
  "PageID": 17609,
  "PageGuid": "b6a99f1c-ec78-4a9b-a3dd-ff966abb3d25",
  "Title": "Wie kann ich mein topfact6 MyWork Cloud Kennwort zurücksetzen?",
  "Content": "Auf die Seite erfahren Sie wie sie selbständig ihr Kennwort in topfact6 zurücksetzen können,\r\nDiese Funktion ist seit der Version topfact6 MyWork 2023.1 verfügbar.\r\n\r\nSchritt 1: Kennwort zurücksetzen\r\nWählen Sie in der Anmeldemaske die Funktion \"Kennwort zurücksetzen\". Es öffnet sich ein Dialog zum Eingabe des Benutzernamens in topfact6.\r\n\r\nSchritt 2: Benutzername oder E-Mailadresse eingeben\r\nErfassen Sie in dieser Maske ihren Benutzernamen oder ihre E-Mailadresse.\r\nDas System überprüft ob ihre Daten korrekt sind und ermittelt im Hintergrund ihre Daten.\r\nWenn ihr Benutzerkonto eine gültige E-Mailadresse besitzt, senden wir ihnen eine E-Mail mit einem Link zu einer Website auf der sie ihr Kennwort zurücksetzen können.\r\n\r\nIst der Vorgang erfolgreich, erhalten sie eine Mitteilung über den Erfolg.\r\nAuch im Fehlerfall werden sie informiert.\r\n\r\nSchritt 3: E-Mail Posteingang prüfen\r\nPrüfen Sie ihren Posteingang nach einer E-Mail die von topfact.de gesendet wurde.\r\n\r\nDurch einen Klick auf \"Kennwort zurücksetzen\" werden sie an eine Website weitergeleitet auf der Sie ihr Kennwort ändern können.\r\n\r\nSchritt 4: Neues Kennwort vergeben\r\nDurch den Klick auf den \"Kennwort zurücksetzen\" Link, gelangen Sie zur Website um ihr Kennwort zurückzusetzen.\r\nErfassen Sie ihr neues Kennwort und wiederholen Sie ihre Eingabe.\r\nGeben Sie den dargestellten Sicherheitsschlüssel ein. Damit überprüfen wir das es sich nicht um eine maschinelle Eingabe handelt.\r\nAls letztes Klicken Sie auf Kennwort zurücksetzen.\r\nDamit ist der Vorgang abgeschlossen. Sie können sich in topfact6 MyWork mit ihrem neuen Kennwort anmelden.\r\n\r\n\r\nIm Erfolgsfall werden Sie über das erfolgreiche Ändern ihres Kennwortes informiert.",
  "Url": "https://services.topfact.de/wiki/pages/view?g=b6a99f1c-ec78-4a9b-a3dd-ff966abb3d25"
}