{
  "PageID": 17650,
  "PageGuid": "67d8b3e2-6701-43e8-a76c-b7a749f4a35c",
  "Title": "Release Notes",
  "Content": "Dieses Dokumente beinhaltet alle Release Notes für das Produkt topfact6 Jobserver.\r\nDie Release Notes für weitere topfact6 Produkte finden Sie hier im topfact Wiki unter den angegebenen Links\r\n·topfact6 MyWork\r\n·topfact6 Administration\r\n·topfact6 BestPeople\r\n·topfact6 Facility\r\n·topfact Archiv\r\n·topfact MyWork App\r\nBitte beachten Sie. Die Screenshots zeigen eventuell Funktion für zukünftige Versionen die kein Bestandteil der aktuellen Version sind.\r\nSollten Sie zu den beschriebenen Funktionen Fragen haben, kontaktieren Sie uns über topfact TIC und senden uns eine Anfrage.\r\n\r\n2021.7\r\nFür diese Programmversion ist die topfact6 Administration ab der Version 2021.7.1.1 notwendig.\r\n\r\ntopfact6 Jobserver\r\n·Überarbeitung aller Module, neue Versionsnummern, komplette Neukompilierung mit .NET Framework 4.6.2\r\n·das topfact6 Jobserver MSI Paket enthält alle Jobserver Module\r\n·der Jobserver Windowsdienst schreibt wieder alle Protokolleinträge in die Aufgabenhistorie\r\n·das Jobserver Modul TaskPlanner erstellt ab dieser Version auch Gruppenaufgaben\r\n\r\n2021.10\r\nFür diese Programmversion ist die topfact6 Administration ab der Version 2021.10.1.1 notwendig.\r\ntopfact6 Jobserver\r\n·Module die Sicherungs- oder Fehlerdateien speichern können diese Ordner selbständig bereinigen, dazu zählen FileReader, XMLReader, Paperworks und CSVImport\r\n\r\n2022.01\r\nFür diese Programmversion ist die topfact6 Administration ab der Version 2022.1 notwendig.\r\ntopfact6 Jobserver\r\n·Automatische Bereinigung von Backup- und Fehlerordnern für die Module FileReader, XMLReader, CSV Import und Paperworks, Standard 30 Tage\r\n·Verbesserung der Fehlerbehandlung wenn Aufgaben kein Ergebnis zurückmelden\r\n·Zugriff auf UNC Ordner mit Anmeldedaten möglich, falls UNC Ordner nicht in der Domäne ist\r\n·Jobserver6 Modul GWC, Fehlerbehebung beim entpacken von ZIP Anhängen\r\n·Jobserver6 Modul FormRecognizer verfügbar, mit KI Werkzeugen Indexdaten automatisch ermitteln\r\n\r\ntopfact Cloud\r\n·topfactCloud FileTransfer als Dienst verfügbar, kann unbeaufsichtigt auf Servern ausgeführt werden\r\n·Hinterlegen von Anmeldedaten für Netzwerkzugriff in Dateiprofilen\r\n·Neues Active Directory Profil verfügbar, Übertragen von Benutzer- und Gruppeninformationen\r\n\r\ntopfact Archiv\r\n·topfactArchiv SOAP Webservice Version 2.1\r\n·topfactArchiv REST API Version 2022.1\r\n·Archiv Speicherorte können Sie auf beliebigen Laufwerken befinden\r\n·volle Integration der Volltextsuche durch den © Microsoft SQL Server\r\n·topfactArchiv OCR API zur Übergabe von Seiten an Remoteclients\r\n\r\ntopfact Tools\r\n·topfact Archiv Migration, Übernahme von Dokumenten aus DocuWare nach topfact Archiv!\r\n·Übernahme aller Dateien, Annotationen und Volltext\r\n\r\n2022.04\r\nFür diese Programmversion ist die topfact6 Administration ab der Version 2022.4 notwendig.\r\n\r\n>\r\ntopfact6 Jobserver\r\n·Jobserver Protokoll Übersicht: In einer eigenen Übersicht der topfact Administration werden Warnungen, Informationen und Fehler des topfact6 JobServers und der JobServer-Module zentral angezeigt und stehen zur Prüfung bereit\r\n\r\ntopfact Archiv\r\n·Archivfelder in der Datenbank können aus der topfact6 Administration heraus mit einem Index versehen werden\r\n·Status des Volltextes eines Archivs ist in der Administration einsehbar und der Neuaufbau des Volltextkataloges ist möglich\r\n·Speicherorte je Archiv können angepasst werden bzw. ein Archiv auf mehrere Speicherorte verteilt werden\r\n·Einstellungsmöglichkeiten je Archiv deutlich erweitert (Thumbnail, max. Anzeige Dokumente, etc.)\r\n\r\ntopfact Tools\r\n·JobServer Modul: ArchivExport jetzt für topfact Archiv verfügbar\r\n\r\n2022.07\r\nFür diese Programmversion ist die topfact6 Administration ab der Version 2022.7 notwendig.\r\n\r\ntopfact6 JobServer\r\n·Belegübergabe an ADDISON: Leerzeichen in Übergabedateien werden nun automatisch erkannt, um die korrekte Zuordnung der Datenzeilen und -spalten in ADDISON zu unterstützen\r\n·Übergabe an PDS-CSS: Sachkontennummern können nun automatisch auf eine einheitliche Länge vervollständigt werden\r\n·Mail Notifier: bei der automatischen E-Mail-Benachrichtigung für topfact Archiv können nun direkte Dokumentenlinks erzeugt werden, die entweder in MyWork eine Ergebnisliste mit allen Dokumenten der Benachrichtigung oder direkt das Dokument im Quickindex öffnet \r\n\r\ntopfact Archiv und WebService\r\n·Anfragen an das Archiv werden nun standardmäßig sortiert zurückgegeben (zuerst das Hauptdokument, dann die Anhänge in der Abfolge der Ablage)\r\n\r\n2022.10\r\nFür diese Programmversion ist die topfact6 Administration ab der Version 2022.10 notwendig.\r\nAchtung, Lizenzänderung. Jeder topfact6 Benutzer benötigt für den Zugriff auf die topfact6 Administration und topfact6 MyWork eine \"Named-User-License\".\r\n\r\ntopfact Archiv\r\n·Integration aller vorhandener Funktionen des topfactArchiv SOAP Webservices in die topfactArchiv REST API\r\n·neue API Funktionen:\r\noRückgabe des Vorschaubildes\r\noDownload Link erstellen und abrufen\r\noDokument anhängen\r\noDokumente zusammenführen\r\n\r\n2023.01\r\nFür diese Programmversion ist die topfact6 Administration ab der Version 2023.1.1.1 notwendig.\r\nFileReader\r\n·Optimierung der ZUGFeRD Erkennung (Version 1.0, 2.0, 2.1)\r\n·Zusätzliches Feld wenn die XML Datei innerhalb der PDF keine gültige ZUGFeRD Datei ist, verschieben in diesen Ordner\r\n·Möglichkeit das nur die oberste Ordnerebene eingelesen wird\r\n·wenn Dateien eine ungültige Dateierweiterung oder einen Dateipräfix haben, können diese Dateien in den Fehlerordner verschoben werden\r\nPreSelect 2.0\r\n·Optimierung der OCR Abfrage für topfactArchiv!\r\nGWC M365\r\n·Zip Dateien im E-Mailanhang werden automatisch entpackt und weiterverarbeitet\r\nXML Reader\r\n·Behebung des Problems beim einlesen von Datumsfeldern\r\nFormRecognizer\r\n·Prüfen der JSON Werte auf gültiges Datumsformat\r\n\r\nVersion 2023.04\r\nFür diese Programmversion ist die topfact6 Administration ab der Version 2023.4. notwendig.\r\ntopfact signature\r\n·Das topfact6 Jobserver Modul topfact Signature prüft regelmäßig den Status der an den Unterschriftsworkflow übergebenen Dokument. Vollständig unterschriebene Dokumente werden autoamatisch abgeholt und archiviert sowie alle Beteiligten informiert. \r\nBerichte\r\n·Berichte übernehmen nun die OrganisationsID und BenutzerID des angemeldeten Benutzers und können diese Informationen für eine spezifische Erstellung des Berichtes heranziehen\r\n\r\nVersion 2023.07\r\nFür diese Programmversion ist die topfact6 Administration ab der Version 2023.7. notwendig.\r\nArchivExport\r\n·Im topfact6 Jobserver Modul ArchivExport können die Dateinamen für exportierte auf Basis der Indexdaten konfiguriert werden\r\nPreSelect 2.0\r\n·Bei der Verschlagwortung können nun Variablen gebildet werden. Für eine spezifische Bedingung werden die Ergebnisse gezählt und auf Basis dessen die Datei verschlagwortet\r\nGWC\r\n·Es wurde ein Fehler behoben, bei dem die Abholung eines Postfaches abbrach, wenn ein spezifischer Postfach-Ordner nicht gefunden wurde\r\n\r\nVersion 2023.10\r\nFür diese Programmversion ist die topfact6 Administration ab der Version 2023.10. notwendig.\r\nCSV-Import\r\n·Das Jobserver-Modul CSV-Import kann bei der Verarbeitung von CSV-Dateien beliebig viele Zeilen überspringen, bevor der Datenimport gestartet wird.\r\n\r\nVersion 2024.04\r\nFür diese Programmversion ist die topfact6 Administration ab der Version 2024.04. notwendig.\r\nTeamsNotifier\r\n·Das Jobserver-Modul TeamsNotifier kann auf Basis einer Archivsuchanfrage automatisch Benachrichtigungen in einen beliebigen Microsoft Teams-Kanal senden. Gefundene Dokumente können dabei als MyWork Aufruf verlinkt werden. \r\nZUGFeRD-Reader\r\n·Das Jobserver-Modul ZUGFeRD-Reader überprüft auf Basis einer Suchanfrage Archivdateien, ob diese einem elektronischen Dokumentenformat, bspw. ZUGFeRD, entsprechen. Sofern die Prüfung positiv abgeschlossen wird, kann der ZUGFeRD-Reader das Archivdokumenten mit statische Werten sowie variablen Werten aus der XML-Datei verschlagworten\r\nMailNotifier\r\n·Es wurde ein Bug behoben, bei dem der Suchlink für topfact6 MyWork unter bestimmten Umständen unvollständig erzeugt und versendet wurde\r\n·Im E-Mail-Text können die Indexdaten des ersten gefundenen Dokumentes der Suchanfrage als Text verwendet werden\r\nSD-Sync\r\n·Das Modul SD-Sync versucht nun automatisch bis zu dreimal im Abstand von zehn Sekunden auf eine Zieltabelle zuzugreifen, bevor der Job abbricht. Wenn die Zieltabelle nicht verfügbar bist, wird bei jedem Versuch eine Fehlermeldung erzeugt.\r\nSignature\r\n·Wenn der Signature-Dienstleister mehrmals ein leeres Ergebnis, wird der Signature-Vorgang automatisch abgebrochen",
  "Url": "https://services.topfact.de/wiki/pages/view?g=67d8b3e2-6701-43e8-a76c-b7a749f4a35c"
}