{
  "PageID": 17700,
  "PageGuid": "8553a8ef-3102-4f3c-a3b0-1afc170aa3ec",
  "Title": "topfact6 Systemvoraussetzungen - Einrichtung ReportServer",
  "Content": "Die SQL Reporting Services werden für Reportfunktionen in topfact verwendet, insbesondere die automatische Generierung der Zahlungsliste oder des Kontierungsblatts über FibuConnect.\r\nWie kann ich die Reporting Services einrichten?\r\n1.Stellen Sie fest welche Version des SQL Servers das System hat. \r\nFühren Sie dieses SQL Skript aus, um diese Information zu erhalten: \r\nSELECT @@VERSION\r\n2.Reporting Services MSI herunterladen 2019 - Download Link 2017 - Download Link -> Mit SQL Server 2008 SP4 und höher kompatibel. \r\n3.Installation des MSIs Paketes MSI Paket ausführen Wählen Sie die Edition oder geben Sie den Product Key ein: \r\nBerichtsserver Konfiguration Manager starten und einen SQL Report Server einrichten\r\n(Suchen nach \"Report Server Configuration Manager)\r\n \r\nNach der Verbindung ist es nötig Berichtserverdienst zu starten \r\n\r\nWebdienst-URL eintragen und aktivieren. \r\n\r\nWebdienste URL \"Anwenden\" klicken\r\n\r\nWebportal URL \"anwenden\" klicken\r\n\r\nDatenbank Verbindung einrichten\r\n\r\nTesten ob alles geklappt hat, indem der Reporting Server im Browser aufgerufen wird: \r\nhttp://SERVERNAME/Reports\r\n\r\nFolgenden Ordner im Report Server anlegen: \r\ntopfact6 MyWork\r\n\r\nDann für diesen Ordner auf Rechte Verwalten  >Sicherheit\r\nund für die betroffenen Nutzer als DOMÄNE\\BENUTZERNAME die Rolle \"Browser\" hinzufügen\r\n\r\n\r\n\r\nIn der topfact6 Administation muss der Pfad eingetragen werden:\r\n·Einstellungen in topfact Administration auf neuen Serverpfad wenn diese gefüllt ist, bzw. eintragen von \r\n·http://srv-dms/ReportServer\r\n\r\n\r\nReport Builder installieren (nach Download) und Konfigurieren auf Serverpfad \r\nhttp://srv-dms/ReportServer\r\n\r\n\r\nDataset in Reports anpassen über den ReportBuilder\r\n \r\n\r\nTest über FibuConnect Belege \r\n§Kontierungsblatt anzeigen\r\n\r\nEs sollte (nach kurzer Wartezeit) direkt ein korrekt gefülltes Kontierungsblatt angezeigt werden.",
  "Url": "https://services.topfact.de/wiki/pages/view?g=8553a8ef-3102-4f3c-a3b0-1afc170aa3ec"
}