{
  "PageID": 17712,
  "PageGuid": "0a22b100-84eb-451b-9e05-c3da8830ebba",
  "Title": "topfact6 Systemvoraussetzungen - topfact6 On-Premise Server und Clients",
  "Content": "Sie möchten das topfact Archiv! auf einem eigenen Server On-Premise betreiben. \r\nHier finden Sie die dazu relevanten Systemvoraussetzungen um ihre Infrastruktur vorzubereiten.\r\n\r\nServer Systeme\r\nDokumentenmanagementsysteme sind in der Regel langfristig betriebene Systeme. Die Hardware Komponenten sollten skalierbar sein, damit das System wachsen kann. \r\nAchten Sie unbedingt darauf, dass in allen Speicherbereichen genügend frei Kapazität zur Verfügung steht. Systeme ohne ausreichenden Speicher auf Festplatten oder im Hauptspeicher (RAM) führen zu Fehlfunktionen und damit ggf. zu Datenverlusten. \r\n\r\nZum Start mit topfact können alle Komponenten können auf einem Server installiert sein. Im späteren Verlauf oder bei bereits eingeplantem hohen Performancebedarf kann eine Lastverteilung durch Systemaufteilung auf mehrere Maschinen vorgenommen werden.\r\nServer Bedingung\r\nBei Migrationen bei denen auf dem Altsystem bereits topfact6 im Einsatz ist (z.B. Dokumentenstrukturen, Aufgaben, JobServer, etc.) ist für das neue System zwingend ein zweiter/neuer Server notwendig.\r\nSystem Empfehlungen \r\n·verwenden Sie aktuelle und leistungsfähige CPUs\r\n·RAM: übliche Verwendung mindestens 16 GB RAM\r\n·Festplatten Speicherplatz: \r\noübliche Verwendung zwischen 300 GB und 1 TB, je nach Dokumentenvolumen und Dateigrößen\r\noVerwendung von SSD Festplatten bzw. schnellen Systemen für die Datenbank\r\noBereitstellen einer separaten Archiv-Partition. Dokumente sollten nicht auf dem gleichen Plattenspeicher wie das Betriebssystem oder die Datenbanken gespeichert werden\r\nEmpfehlung für Server-Design\r\n·Bei 50 User oder mehr empfehlen wir einen eigenen Server für das Datenbanksystem zu verwenden\r\n·Bei durchschnittlich 2.000 oder mehr neuen Dokumenten pro Tag empfehlen wir weitere Server zur Lastverteilung zu verwenden (einen separaten JobServer, VolltextServer und ImageServer)\r\nWindows Server Systemkomponenten\r\n·mindestens Windows Server 2016\r\n·mindestens .NET Framework v4.6.2\r\n·Internetinformationsdienst (IIS) \r\n·Zur Verwendung von https muss ein gültiges, externes Zertifikat hinterlegt sein, welches auf den Host oder auf einen Alias im DNS verweist.\r\nWindows System Administrator\r\n·Für die Installation und den Betrieb ist ein administrativer Windows Nutzer für den Server nötig\r\nMS SQL Datenbank\r\n·Microsoft SQL Server mindestens 2016 (Express / Standard / Enterprise Edition)\r\n·TCP/IP und UDP Protokoll in SQL Server aktivieren\r\n·TCP/IP und UDP Protokoll in Firewall freischalten \r\n·Volltext Komponente in SQL Server muss aktiviert sein\r\n·SQL Server Reporting Service muss installiert und konfiguriert sein\r\n·Sollte der MSSQL Server noch nicht installiert sein sollte das Installationsmedium als ISO-Paket, den SQL Lizenzschlüssel sowie einen administrativen Windows Nutzer für den Server zur Verfügung stehen.\r\n\r\ntopfact6 Clientanwendungen\r\n·Windows 10/11\r\n·mindestens .NET Framework v4.6.2\r\n·Lizenzierung als named User - jedem MyWork User muss eine Lizenz namentlich zugeordnet sein\r\n\r\nAntivirenprogramme\r\nVirenscanner und Ransomware Systeme können zu Störungen bei der Verarbeitung von Dokumenten führen,  da die Systeme darauf trainiert sind, automatische Dokumentenverarbeitungen zu erkennen und zu stoppen. Bei topfact ist aber genau das die Hauptaufgabe.\r\nFolgende Pfade müssen in den Virenprogrammen definiert werden: \r\nhttps://services.topfact.de/wiki/pages/view?g=bb4734af-b5f5-4d7b-9ee2-df13af5ffd61\r\n\r\nAusgehende Verbindungen / Firewall\r\nIn allen Fällen muss die ausgehende Verbindung auf den Port 1433 auf den SQL Datenbankserver DB-SERVER mit DNS Namensauflösung erlaubt werden.\r\nZusätzlich muss in den Firewall und DNS Einstellungen des Netzwerks eine Verbindung zum API Endpunkt (http://APP-SERVER/topfact/api) mit DNS Namensauflösung per http bzw. https möglich sein.\r\nWenn das Modul \"Formularerkennung\" genutzt wird müssen bestimmte Endpunkte über das HTTPS Protokoll erreichbar sein. Klären Sie dies bitte mit Ihrem Projekt-Ansprechpartner bei topfact.\r\nWenn das Modul \"GWC M365\" zur E-Mail Archivierung aus Microsoft 365 Postfächern genutzt wird müssen folgende Endpunkte über HTTPS Protokoll erreichbar sein.\r\n·graph.microsoft.com\r\n·login.microsoftonline.com\r\n\r\nEinbindung DocuWare Archive\r\nFalls DocuWare Archive in topfact6 eingebunden werden sollen \r\n·Es muss für jeden DocuWare Nutzer ein Passwort vergeben sein, welches in topfact6 hinterlegt werden kann\r\n·Es muss ein administrativer Zugang zum DocuWare System bereitstehen",
  "Url": "https://services.topfact.de/wiki/pages/view?g=0a22b100-84eb-451b-9e05-c3da8830ebba"
}