{
  "PageID": 17765,
  "PageGuid": "447fe509-00db-4dc9-8d45-b3406b62cf04",
  "Title": "Dokumentenexport",
  "Content": "Der Dokumentenexport ermöglicht es Benutzern, direkt aus topfact6 MyWork, Dokumente in einer strukturierten Form (Ordner und Dateinamen) zu exportieren.\r\nHierbei haben Sie selber die Möglichkeit, ohne administrativen Eingriff beliebig viele Exportkonfigurationen zu erstellen.\r\nDie Exportkonfigurationen enthalten alle Informationen um den tatsächlichen Exportvorgang ohne großen Aufwand durchzuführen.\r\nBeachten Sie, der Dokumentenexport in topfact6 MyWork ist eine interaktive Funktion und benötigt immer einen Benutzer der den Vorgang startet.\r\nUm Dokumente automatisiert zu exportieren, verwenden Sie das Modul topfact6 Jobserver ArchiveExport.\r\nBeachten Sie bei der Verwendung von Ordnerstrukturen und Dateinamen, dass Windows eine Beschränkung (im Standard) von maximal 256 Zeichen für Ordern + Dateinamen hat.\r\nBerücksichtigen Sie das in ihrer Exportkonfiguration. Weitere Informationen finden Sie hier Maximum Path Length.\r\n\r\nÜbersicht aller Exportkonfigurationen\r\nExportkonfigurationen enthalten alle notwendigen Informationen um ihre Dokumente strukturiert speichern zu können.\r\nNotwendige Informationen sind das Archiv und der Ergebnisdialog. Mit diesen Informationen lassen sich alle verfügbaren Archivfelder ermitteln, die sie dann für ihre Ordnerstruktur verwenden können.\r\nExportkonfigurationen werden in topfact6 MyWork im Hauptfenster unter Datei erstellt.\r\n\r\nIn der Übersicht sehen Sie alle vorhandenen Exportkonfigurationen. Weiterhin können Sie neue Konfigurationen erstellen oder bestehenden Konfigurationen bearbeiten.\r\nDas löschen von Konfigurationen ist ebenfalls möglich.\r\n\r\nErstellen oder bearbeiten einer Exportkonfiguration\r\nKlicken Sie in der Übersicht der Exportkonfigurationen auf die Schaltfläche anlegen oder bearbeiten.\r\nWählen Sie das entsprechende Archiv und aus dem Archiv deinen verfügbaren Ergebnisdialog aus. Der Ergebnisdialog stellt die verfügbaren Archivfelder zur Verfügung.\r\nBeachten Sie, dass ein nachträgliches Ändern des Archives und des Ergebnisdialoges nicht möglich ist.\r\n\r\n·Wählen Sie ein verfügbares Archiv\r\n·Wählen Sie einen verfügbaren Ergebnisdialog\r\n·Vergeben Sie einen aussagekräftigen Name\r\n·Geben Sie bei Bedarf eine Beschreibung ein\r\n·Klicken Sie auf Übernehmen\r\n\r\nOptionen festlegen\r\nJede Exportkonfiguration verfügt über diverse Optionen, die den Exportvorgang beeinflussen.\r\n\r\nDie Art des Exportordners legt den Ordner fest in den Sie die Dokumente exportieren wollen.\r\nZu Auswahl stehen:\r\n·Exportordner auswählen\r\n·Exportordner aus den Benutzereinstellungen verwenden\r\n·Exportordner in der Exportkonfiguration festlegen, öffnet das Feld Exportordner zur Eingabe oder Auswahl des Ordners\r\n\r\nOrdnerstruktur festlegen\r\nDie Ordnerstruktur verwenden Sie um in ihrem Exportordner, automatisch weitere Unterordner zu erhalten.\r\nDadurch kann dann z.B. folgende Explorerstruktur entstehen, [Exportordner]\\topfact AG\\Rechnung.\r\n·Doppelklick auf die Feldlisten übernimmt oder entfernt das Feld aus der Auswahl\r\n·Mit Drag & Drop ordnen Sie ihre Felder und bestimmen so die Ordnerstruktur",
  "Url": "https://services.topfact.de/wiki/pages/view?g=447fe509-00db-4dc9-8d45-b3406b62cf04"
}