{
  "PageID": 17782,
  "PageGuid": "f336eef9-c2af-4c0d-a3c5-41826a674824",
  "Title": "Funktionen der Suchleiste von MyWork",
  "Content": "Herzlich Willkommen zu unserem Erklärvideo zum Suchdialog in topfact6 MyWork. Wir werden auf einige Funktionen eingehen, und diese genauer erklären.\r\n\r\nErklärvideo\r\n\r\n\r\nSuchleiste\r\nDie Funktion Suche ist dafür da schnell an benötigte Dokumente zu gelangen. Dabei werden verschiedene Möglichkeiten gegeben, wovon wir Ihnen ein paar vorstellen werden.\r\nAuf dem Bild abgebildet ist die Suchleiste wie man sie auf MyWork findet.\r\n\r\nAuswahlliste\r\nDie Auswahlliste in der Suchmaske lässt dich schneller ein gesuchtes Ergebnis finden. Klickt man also auf den Pfeil werden dir die Auswahlmöglichkeiten der Auswahlliste angezeigt. Nehmen wir als Beispiel das Feld Zugriffsrechte, so wird einem die Auswahl zwischen Offen, Vertrieb und Vorstand gegeben. Je nachdem wer dann Zugriff auf das Dokument hat. Daraufhin wird die Suche angepasst und dir werden passende Ergebnisse gezeigt.\r\n\r\nZurücksetzen\r\nDrückt man auf Zurücksetzen werden alle Felder die du bereits in der Auswahlliste bearbeitet hast zurückgesetzt. Das hat den Vorteil, dass man die Suche nicht nochmal schließen muss und wieder aufmachen um alle Felder zurückzusetzen.\r\n\r\nBeenden\r\nDas Feld beenden ist Benutzerspezifisch wichtig, sollte jemand nicht wissen das man die Suche auch mit dem \"X\" beenden könnte. Denn es ist mit dem \"X\" oben rechts eigentlich nur eine andere Möglichkeit die Suche zu beenden/schließen.\r\n\r\n\r\nDurch die Benutzung von topfact6 MyWork spart man jedoch nicht nur Zeit sondern auch Geld. Da man Dokumente so viel schneller findet, spart man sich unnötige Aufgaben. Mit topfact6 MyWork kann eine Aufgabe die einem Mitarbeiter 20 Minuten gekostet hätte, auch von einem Praktikanten verrichtet werden.\r\nWir hoffen wir konnten Ihnen mit unserer Erklärung der Suchfunktion weiterhelfen. Bei weiteren Fragen erreichen Sie uns unter hotline@topfact.de",
  "Url": "https://services.topfact.de/wiki/pages/view?g=f336eef9-c2af-4c0d-a3c5-41826a674824"
}