{
  "PageID": 17884,
  "PageGuid": "ea9cc209-e154-4b4f-aeaa-3f6927a04016",
  "Title": "Verwendung der Volltextsuche in topfact6 MyWork mit topfact Archiv",
  "Content": "1.Für ein erfolgreiches Finden über die Volltextsuche empfehlen wir die Eingabe des vollständigen Suchbegriffs. \r\n\r\nHinweis: Sie können die Erkennungsergebnisse auch selbst prüfen, indem Sie das MyWork Flyout Volltext aktivieren. Dort stehen die erkannten Texte, welche für die Volltextsuche verwendet werden.\r\n2.Es ist nicht zwingend erforderlich den ganzen Suchbegriff einzugeben, denn das Ende des Begriffs kann abgekürzt werden:\r\n\r\nBeispiel: Statt PRM123100000431 kann Beispiel: PRM1231000004 oder Beispiel: PRM123100 oder PRM123 eingegeben werden. Die Konsequenz ist ggf., dass mehr Dokumente in der Ergebnisliste als erwartet.\r\n3.Technisch nicht möglich ist das Weglassen von führenden Buchstaben, Zeichen oder Ziffern in einem Suchbegriff. Das führt in der Regel zu keinem gewünschten Suchergebnis.\r\n\r\nBeispiel: Statt PRM123100000431 nur M123100000431\r\n4.Werden mehrere Suchbegriffe im Volltextfeld eingegeben werden diese mit und verknüpft: alle eingegebenen Suchbegriffe müssen im Volltext eines Dokuments vorhanden sein. Das verringert die Anzahl der Zeilen im Suchergebnis.\r\n5.Eine Kombination aus Buchstaben mit einzelnen Punkten, bspw. eine Artikelnummer \"626.24.0222\",  kann nur gefunden werden, wenn die Punkte im Suchbegriff verdoppelt werden, also \"627..24..0222\" \r\n(nur Relevant bis einschließlich topfact Archiv Version 2023.07)\r\n6.Bei Suchbegriffen die das Sonderzeichen \"-\" enthalten (z.B. Kennzeichen wie RO-TF 123) muss entweder der exakte Begriff im Volltext vorhanden sein, oder idealerweise bei der Suche das Sonderzeichen \"-\" weggelassen/durch ein Leerzeichen ersetz werden.\r\n7.Das Sonderzeichen ' kann in einem Suchbegriff nicht verwendet werden (z.B. d'accord). Suchbegriffe die dieses Sonderzeichen enthalten werden von der Suchfunktion ignoriert. Stattdessen kann ein Leerzeichen in der Suche verwendet werden.",
  "Url": "https://services.topfact.de/wiki/pages/view?g=ea9cc209-e154-4b4f-aeaa-3f6927a04016"
}