{
  "PageID": 17880,
  "PageGuid": "cee094af-a478-4244-8e84-a53780964082",
  "Title": "FAQ Anzeigen und bearbeiten Button in Quickindex",
  "Content": "Frage\r\nWie können Dateien über Word und Excel in Quickindex zur Bearbeitung aufgerufen werden und das Ergebnis direkt im Archiv gespeichert werden?\r\nAntwort / Lösung\r\nDer Anzeige und Bearbeitung Button im Quickindex bietet die Funktion Word oder Excel Dateien zu bearbeiten und die Änderung direkt ins Archiv zurück zu speichern. Die ursprünglichen Dateien werden als alte Versionen erhalten, jedoch für die Anwender ausgeblendet.\r\n\r\nVoraussetzung:\r\nÄndern und Bearbeiten aktiviert Word oder Excel zur Bearbeitung von Dateien. Dazu muss Word oder Excel geschlossen sein, wenn der Button gedrückt wird. \r\nAndere Anwendungen wird zwar die Anwendung geöffnet die im Betriebssystem des Rechners für diesen Dateityp hinterlegt ist, jedoch kann nicht sichergestellt werden, dass die Änderungen ins Archiv zurückgeschrieben werden. Empfohlen wird dann die Änderung durchzuführen, diese in einer separaten Datei zu speichern und diese per Drag & Drop auf das Dokument anzuhängen oder neu abzulegen.\r\n \r\nFunktionsablauf:\r\n1. Drücken Anzeigen & Bearbeiten Button für eine Word oder Excel Datei.\r\n2.  Die betreffende Datei wird aus dem Archiv in den App-Data Local Bereich kopiert und von dort automatisch durch die Anwendung geöffnet: \r\nC:\\Users\\[Benutzername]\\AppData\\Local\\topfact AG\\topfact6 Edit\\1\\238344\\313907\r\n- Die Zahlen verweisen auf die\r\n1. Archiv\r\n2. DocId\r\n3. FileID\r\n3. Die Anwendung (Word/Excel) muss die Datei nach der Änderung speichern und dann geschlossen werden.\r\n4. Nach dem Schließen meldet das Betriebssystem, dass die Datei nun zur Archivierung bereitsteht. Der MyWork Client meldet dies dem Anwender und fordert ihn auf zu entscheiden ob die Datei archiviert werden soll.\r\n \r\nDie archivierte Datei wird dann als neue Datei zu dem Dokument abgelegt. Alle anderen Dateien werden als unsichtbar geschaltet, nur die letzte gerade archivierte Datei ist sichtbar. Damit sind alle Versionen der Datei noch vorhanden, jedoch nur die letzte Datei steht zur Bearbeitung. \r\nDie Stempel werden immer auf die erste sichtbare Datei projeziert um ein „weiterlaufen“ der Stempel zu ermöglichen. Aus diesem Grund wird nicht empfohlen weitere andere Dateien an dieses Dokument anzuhängen. Sollte das weiterlaufen von Stempeln von einer Dokumentversion zur nächsten nicht gewünscht sein, empfiehlt es sich, statt Anzeigen und Bearbeiten die Datei zu exportieren und per Drag & Drop neu abzulegen. Dann werden alle Stempel zur jeweiligen Dateiversion gespeichert.\r\n \r\n5. Wird der Prozess gestört, bleibt die bereitgestellte Datei im C:\\Users\\[Benutzername]\\AppData\\Local\\topfact AG\\topfact6 Edit\\ … liegen wird beim nächsten Aufruf des Anzeigen und Bearbeiten Buttons nochmal zur Bearbeitung angeboten.",
  "Url": "https://services.topfact.de/wiki/pages/view?g=cee094af-a478-4244-8e84-a53780964082"
}