{
  "PageID": 17896,
  "PageGuid": "738e5885-deea-4ee1-9721-70e74b75f12e",
  "Title": "FAQ - MyWork Wie kann ich die Sortierung in der Ergebnisliste einstellen?",
  "Content": "Frage\r\nWie kann ich die Sortierreihenfolge in Ergebnislisten verändern?\r\n\r\nAntwort / Lösung\r\nDie systemseitige Sortierung der Ergebnisliste erfolgt nach dem Ablagezeitpunkt im Archiv. Aktuellere Dokumente werden über den älteren angezeigt. Die Sortierung ist also Ablagezeitpunkt mit absteigender Sortierung.\r\n\r\nZur Änderung der Sortierreihenfolge klicken Sie einfach auf den Spaltenkopf, nachdem sortiert werden soll. Es erscheint dann ein auf- oder absteigendes Symbol welches der aktuellen Sortierreihenfolge entspricht. Beispiel: \r\nKlicken Sie ein zweites Mal auf den Spaltenkopf, dann wird die Sortierreihenfolge gedreht. Beispiel \r\n\r\n\r\nBitte beachten Sie folgende Zusatzinformationen:\r\n\r\nA) Reihenfolge der Sortierungen bei Textfeldern\r\nBei der Sortierung vom kleinsten zum größten (aufsteigend) werden Inhalte in Textfeldern wie folgt sortiert:\r\n1. Leere Einträge\r\n2. Einträge beginnend mit Sonderzeichen\r\n3. Einträge beginnend mit Zahlen\r\n4. Einträge beginnend mit Buchstaben (zuerst beginnend mit Kleinbuchstaben)\r\n\r\nB) Wo ist Ihr Fokus\r\nDer Schieberegler rechts außen zeigt Ihnen an welcher Stelle sich Ihr aktueller Fokus innerhalbe der Ergebnisliste befindet. Es ist sinnvoll diesen mit der Maus nach oben oder unten zu navigieren um zum tatsächlichen Beginn oder Ende der Liste zu gelangen.\r\n\r\nC) Die Sortierung bleibt dauerhaft erhalten\r\nMyWork merkt sich Ihre Sortierungseinstellung und das für jeden Ergebnisdialog. Beim nächsten Aufruf des Ergebnisdialogs wird die letzte Sortierreihenfolge wieder verwendet. Welcher Ergebnisdialog aktuell verwendet wird steht links unten im MyWork Hauptfenster. \r\n\r\nBeispiel: \r\nD) Eigene Sortierung wieder aufheben\r\nSie können die eigene Sortierung wieder aufheben um zurück zur Systemseitigen Sortierung zu kommen: \r\n1. Aufruf des Ergebnislisten Kontextmenüs durch Rechtsklick auf einen beliebigen Spaltenkopf. \r\n2. Auf \"Alle Sortierungen entfernen\" klicken.",
  "Url": "https://services.topfact.de/wiki/pages/view?g=738e5885-deea-4ee1-9721-70e74b75f12e"
}