{
  "PageID": 17925,
  "PageGuid": "ec97c8ac-0282-4e28-93ff-f9b6bc7f42d8",
  "Title": "topfact Cloud Backup (Kundeninformation)",
  "Content": "Im folgenden finden Sie Informationen welche Maßnahmen die topfact AG durchführt um Ihre Daten in der Cloud zu sichern.\r\nEs gibt verschiedene Risiken die entweder zu kurzfristigen Ausfällen oder langfristigen / permanentem Datenverlust führen können. Dieser Artikel soll darüber aufklären, was die topfact AG unternimmt um in den beschriebenen Einzelfällen Ihre Daten wieder herzustellen.\r\nDie folgende Ereignisse und Maßnahmen betreffen ausschließlich potenzielle langfristige oder permanente Ausfälle der Systeme und insbesondere den Datenverlust, der durch unsere Backups wieder hergestellt werden kann. \r\nEs werden regelmäßige Backups auf verschiedenen Ebenen mit unterschiedlichen Techniken durchgeführt um für den möglichen dauerhaften Ausfall von Systemen , die Zerstörung oder den Verlust von Daten vorbereitet zu sein (Ereignis). Zielsetzung dieser unterschiedlichen Maßnahmen ist es je nach schwere eines Ereignisses handlungsfähig zu sein und den Erhalt der Daten bei verschiedenen Ereignisarten sicherzustellen.\r\n1.Backupmaßnahmen\r\n2.Ereignisse und deren Abdeckung\r\n\r\nBackupmaßnahmen\r\nFolgende Backupmaßnahmen werden durch die topfact AG oder Partner durchgeführt\r\n1. Plattform Backup Snapshot (Luft Engineering)\r\n- tägliches Backup der gesamten Serverumgebung als Snapshot der virtuellen Maschinen\r\n2. Plattform Backup Geo-Redundant (Luft Engineering)\r\n- tägliches Backup der gesamten Serverumgebung als Snapshot der virtuellen Maschine\r\n- Speicherung der Snapshots in einem örtlich entfernten Rechenzentrum (ca. 350 km)\r\n\r\n3. Plattformunabhängiges Cloud Backup (Microsoft Azure)\r\n- Datenbanken (stündlich inkrementelle Änderungen der Archivdatenbanken, tägliches Vollbackup aller Datenbanken)\r\n- Dokumente (tägliches inkrementelles Backup von neuen bzw. geänderten Dateien im Archivsystem, ab 02:00 Uhr Nachts)\r\nInsbesondere durch das Plattformunabhängige Backup haben wir jederzeit die Möglichkeit ihre Archivdateien und alle zugehörigen Metadaten in einer beliebigen Serverumgebung wieder herzustellen. Unabhängig von der Erreichbarkeit der aktuellen Serverinfrastruktur und dem betreuenden Hostinganbieter.\r\n\r\nMögliche Ereignisse und deren Abdeckung durch Backupmaßnahmen\r\nWelche Ereignisarten sind mit welchen Backupmaßnahmen abgedeckt?\r\n\r\nAusfalldauer / Zeitraum zur vollständigen Wiederherstellung\r\nDie Dauer der Wiederherstellung des Systems und der Betriebsbereitschaft hängt von dem jeweiligen Ereignis ab.\r\n\r\nE1 - Verlust / Zerstörung der gesamten Plattformumgebung (Server oder gesamtes Rechenzentrum)\r\nVerursacht durch: Hackerangriff, technische Fehlfunktion, Hardwaredefekt, Brandschaden, etc.\r\nAbgedeckt durch: \r\n·#1 Plattform Backup Snapshot \r\n·#2 Plattform Backup Geo-Redundant \r\n·#3 Plattformunabhängiges Cloud Backup\r\nNotizen: Dem Hostinganbieter ist es Möglich die Server auf einer anderen physikalischen Maschine mit dem tagesaktuellen Snapshot wieder herzustellen. Das Geo-Redundante Backup würde einen dauerhaften lokalen Ausfall im Haupt-Rechenzentrum beheben können. Zusätzlich könnte aus den plattformunabhängigen inkrementellen Backup auch Zwischenstände rekonstruiert werden.\r\n\r\nE2 - Verlust / Zerstörung / Verschlüsselung der physikalischen Speicherorte (Festplatten der Server)\r\nVerursacht durch: Hackerangriff (Ransomware-Verschlüsselung), Hardwaredefekte, Brandschaden, etc.\r\nAbgedeckt durch: \r\n·#1 Plattform Backup Snapshot (bei Ransomware nur bedingt nützlich)\r\n·#2 Plattform Backup Geo-Redundant (bei Ransomware nur bedingt nützlich)\r\n·#3 Plattformunabhängiges Cloud Backup\r\nNotizen: Dem Hostinganbieter ist es Möglich die Server auf einer anderen physikalischen Maschine mit dem tagesaktuellen Snapshot wieder herzustellen. Diese Snapshots reichen mehrere Tage in die Vergangenheit. Zusätzlich könnte aus den plattformunabhängigen inkrementellen Backup auch tagesaktuelle Zwischenstände der reinen Archivdaten rekonstruiert werden die nicht von einer möglichen Ransomware-Verschlüsselung betroffen sind. Dies würde auch in einem Ransomware-Szenario greifen, bei dem bereits die Snapshot-Backups kontaminiert sind und ein komplett neues System aufgebaut werden müsste.\r\n\r\nE3 - Verlust des Zugriffs auf die Plattform (Zugänge zum Server, Handlungsfähigkeit des Partners)\r\nVerursacht durch: Hackerangriff und Handlungsunfähigkeit des Hostinganbieters\r\nAbgedeckt durch: \r\n·#3 Plattformunabhängiges Cloud Backup\r\nNotizen: Falls durch den Hostinganbieter keine Möglichkeit besteht die Zugänge absehbar wieder herzustellen kann ein Fallbacksystem mit den tagesaktuellen Plattformunabhängigen Backups komplett unabhängig vom Hostingpartner wieder aufgebaut und in Betrieb genommen werden. Insbesondere wenn der Hostingabieter durch den Angriff selbst nicht reaktions- und handlungsfähig ist.\r\n\r\nE4 - Spontaner aber dauerhafter Ausfall des Hostingpartners (Server + Hostingpartner)\r\nVerursacht durch: Komplettausfall des Hostingpartners, z.B. Insolvenz, Krankheiten, Todesfälle, interne Sabotage, Hackerangriffe, etc.\r\nAbgedeckt durch: #3 Plattformunabhängiges Cloud Backup\r\nNotizen: Durch das Plattformunabhängige Backup besteht jederzeit die Möglichkeit ihre Archivdateien und alle zugehörigen Metadaten in einer beliebigen Serverumgebung wieder herzustellen. Unabhängig von der Erreichbarkeit der aktuellen Serverinfrastruktur und dem betreuenden Hostinganbieter.\r\n\r\nE5 - Verlust / Zerstörung einer einzelnen Datenbank\r\nVerursacht durch: Fehlkonfiguration, menschliche Fehler, technische Fehlfunktionen, Hardwaredefekte, Hackerangriff\r\nAbgedeckt durch: \r\n·#3 Plattformunabhängiges Cloud Backup\r\nNotizen: Einzelne Datenbanken können aus den Plattformunabhängigen Backups wieder hergestellt werden ohne den laufenden Betrieb des Systems für nicht betroffene Kunden zu beeinflussen.\r\n\r\nE6 - Verlust / Zerstörung des Datenbankservers (gesamter MSSQL Server)\r\nVerursacht durch: technische Fehlfunktionen, Hardwaredefekte, Hackerangriff\r\nAbgedeckt durch: \r\n·#1 Plattform Backup Snapshot\r\n·#2 Plattform Backup Geo-Redundant \r\n·#3 Plattformunabhängiges Cloud Backup\r\nNotizen: Der komplette Datenbankserver kann über die Plattform Snapshots wieder hergestellt werden. Sollte dies nicht möglich sein, kann ein neuer Datenbankserver eingerichtet werden und mit den pattformunabhängigen Backups wieder auf den tagesaktuellen Stand gebracht werden.",
  "Url": "https://services.topfact.de/wiki/pages/view?g=ec97c8ac-0282-4e28-93ff-f9b6bc7f42d8"
}