{
  "PageID": 31641,
  "PageGuid": "91de78f7-af84-4118-b191-0f768468568b",
  "Title": "Direkte MyWork Links öffnen, teilen oder versenden (Deep-Link)",
  "Content": "Wie kann ich direkte MyWork Links öffnen, teilen oder versenden (Deep-Link auf Dokumente oder Suchergebnisse)?\r\nMyWork bietet die Möglichkeit direkte Links auf ein Suchergebnis oder ein einzelnes Dokument an Kollegen zu senden. Diese Links können per E-Mail oder Teams Nachricht versendet werden. Der Empfänger kann über den Klick auf den Link das geteilte Dokument oder die Suche in seinem eigenen MyWork öffnen.\r\nInhalt\r\n1.empfangene Links öffnen\r\n2.Links erstellen und teilen\r\n\r\n1. empfangene Links öffnen\r\nWenn Sie von einem Kollegen einen Link per Teams Nachricht oder per E-Mail erhalten und diesen Link klicken öffnet sich zunächst eine Webseite des topfact Archivs. \r\nIhr Browser versucht nun automatisch den hinterlegten MyWork Aufruf als \"PopUp\" zu starten. Die meisten Browser verhindern im Standardfall dieses Öffnen des direkten MyWork Aufrufs.\r\nSie müssen nun den Button klicken und in einem weiteren Schritt dem Browser bestätigen, dass Sie die Anwendung MyWork zulassen wollen um MyWork zu öffnen.\r\n\r\n1.a) Dauerhaft automatisches öffnen von MyWork Links aktivieren\r\nUm in Ihrem Browser MyWork Links dauerhaft zuzulassen und diese bei einem Klick direkt in MyWork zu öffnen, müssen Sie zwei Schritte durchführen: \r\nSchritt 1: Im Browser PopUps von der Seite topfactcloud.de dauerhaft zulassen\r\n\r\n\r\n\r\n\r\nSchritt 2: dem Browser immer erlauben diese Links mit topfact6 MyWork zu öffnen\r\n\r\n\r\nAb sofort sollten alle MyWork Deep Links direkt in MyWork geöffnet werden.\r\n\r\n\r\n2. Links auf Dokumente oder Suchergebnisse selbst erstellen, teilen und versenden\r\nWie kann ich selbst einen direkten Link auf ein Dokument oder ein Suchergebnis erstellen und an meine Kollegen verteilen?\r\nMyWork Deep-Links können an verschiedenen Stellen im Programm erzeugt werden.\r\n\r\n2.1 Aus einer Ergebnisliste heraus den direkten Link kopieren\r\nRechtsklick auf ein Dokument > Teilen > Dokument (oder Suchergebnis) als MyWork Aufruf\r\n\r\n\r\n2.2 Aus einer Ergebnisliste heraus in eine neue E-Mail kopieren\r\nRechtsklick auf ein Dokument > Dokument senden > Dokument (oder Suchergebnis) als MyWork Aufruf\r\nDabei wird dann der Link in einen neuen E-Mail Entwurf kopiert.\r\n\r\n\r\n2.3 Aus dem QuickIndex heraus\r\nIn der Toolbar des Dokuments im QuickIndex kann ebenfalls die Funktion \"Senden per E-Mail mit topfact6 MyWork Aufruf\" gestartet werden.\r\n\r\n\r\n\r\nUnterschied zwischen einem WebLink und einem MyWork Deep Link\r\nWie unterscheiden sich direkte MyWork Deep Links von einem topfact Archiv! WebLink?\r\nWährend der WebLink des topfact Archiv! das Dokument direkt im Browser mit reduzierter Funktionalität darstellt öffnet ein MyWork Deep Link die Anwendung topfact6 MyWork und bietet dort alle gewohnten Funktionalitäten um mit dem Dokument zu arbeiten.",
  "Url": "https://services.topfact.de/wiki/pages/view?g=91de78f7-af84-4118-b191-0f768468568b"
}