{
  "PageID": 31647,
  "PageGuid": "13006125-330a-4ece-8666-32525bd8544d",
  "Title": "FAQ ImageServer OCRServer - Wie können bisherige Erkennungsergebnisse selektiv zurückgesetzt und verbessert werden?",
  "Content": "Das Zurücksetzen (neu verarbeiten) von Dokumenten zur Erkennung erfolgt in der Archiv Administration im Reiter Statistik. Dort können Dokumente gruppiert nach deren Bearbeitungszustand zurückgesetzt werden, z.B. alle fehlerhaften.\r\n\r\n\r\n\r\nPrüfung der Erkennungsqualität\r\nWelche Qualität die Erkennung hatte kann optimal in der Datenbank überprüft werden. \r\nSelect * [topfactArchiv_001_FT].[dbo].[tf_Fulltext]\r\n\r\nDie Spalte [Confidence] gibt die Erkennung in Prozent zurück.\r\nIn der Spalte Fulltext steht das Ergebnis zur Sichtprüfung.\r\n\r\nÜber ein Skript kann einfach ermittelt werden, wie viele Dateien unter einem bestimmten Erkennungswert liegen.  Dabei sind nur die Files mit dem Pageindex 0 von Interesse\r\n\r\nSelect *\r\n  FROM [topfactArchiv_001_FT].[dbo].[tf_Fulltext]\r\n  where Confidence < 80 and PageIndex = 0\r\n\r\n\r\nUm nun Dokumente selektiv in eine verbesserte Erkennung laufen zu lassen muss\r\n1.die verbesserte Erkennung eingestellt werden\r\n2.die Dokumente zurückgesetzt werden\r\n\r\n1. Verbesserte Erkennungseinstellung ab Version 2024\r\n\r\n2. Selektives Zurücksetzen von Dateien\r\nÜber die Files Archivtabelle wird das zurücksetzen gesteuert. Dabei muss lediglich der img_status auf 0 gesetzt werden. Das Dokument wird dann im kompletten Durchlauf durch die den ImageServer und OCRServer automatisch neu verarbeitet:\r\n1.Es wird geprüft ob die PDF direkt auslesbar ist\r\n2.Falls nicht, Tiff-Image je Seite bilden und per OCR auslesen\r\n3.Inhalte in der Fulltext-Spalte in TF_Fulltext ersetzen\r\n\r\nSkript um den  img_status auf 0 zu setzen:\r\n\r\nUPDATE topfactArchiv.dbo.tf_Archive001Files\r\nset img_status = 0\r\nWHERE tf_fileid IN \r\n(\r\nSELECT distinct FileID\r\n FROM [topfactArchiv_001_FT].[dbo].[tf_Fulltext]\r\n where Confidence < 80 and PageIndex = 0\r\n)\r\n\r\nPrüfung des Ergebnisses\r\n\r\nÜber den Statistik Reiter und dort dem Refresh Button, kann die Verarbeitung überprüft werden.",
  "Url": "https://services.topfact.de/wiki/pages/view?g=13006125-330a-4ece-8666-32525bd8544d"
}