{
  "PageID": 35713,
  "PageGuid": "d2f7b3e3-da1a-442c-a4e4-6b7c90e52c05",
  "Title": "topfact6 MyWork - MyWork QuickIndex - Dokumenteninformation",
  "Content": "Beginn Funktions-ID: 169 Modul-ID:69\r\nDokumenteninformation\r\nMit einem Klick auf das Wort QuickIndex öffnet sich ein Drop Down Menü indem sich ein Button \"Dokumenteninformation\" befindet. (1) Ein Klick auf den Button öffnet einen Dialog in den die Dokumenteninformationen zu sehen sind. Im Reiter Systemdaten werden alle vom System gespeicherten technischen Daten des Dokumentes gelistet. Zum Beispiel Dokument ID, Anzahl von Dateien, Speicherverbrauch und letzte Änderung. (2) Dokumente können aus mehreren Dateien bestehen. Im Reiter Dateien werden alle Dateien aufgelistet die zu den geöffneten Dokument gehören. Zu den Dateien wird jeweils der Dateiname, die Dateigröße, der Ablagezeitpunkt und eine Versionsnummer angezeigt.(3) Der OCR Server liest zu jedem Dokument den Volltext aus und speichert diesen in der Volltextdatenbank. Im Reiter OCR wird der Volltextdatenbankeintrag zu diesem Dokument geladen und angezeigt. (4) Alle Datenbank Aktionen die mit diesem Dokument durchgeführt wurden, werden im Reiter Archivhistorie aufgelistet. Zum Beispiel Änderungen oder lesender Zugriff. (5) Der Reiter Kommentare zeigt alle auf dem Dokument angebrachten Stempel und Kommentare an. (6) \r\n\r\n\r\n\r\nParameter der Funktion\r\nSystemdaten\r\n-> Es werden alle vom System gespeicherten technischen Daten des Dokumentes gelistet. Zum Beispiel Dokument ID, Anzahl von Dateien, Speicherverbrauch und letzte Änderung.\r\nDateien\r\n-> Dokumente können aus mehreren Dateien bestehen. Hier werden alle Dateien aufgelistet die zu den geöffneten Dokument gehören. \r\nOCR\r\n-> Der OCR Server liest zu jedem Dokument den Volltext aus und speichert diesen in der Volltextdatenbank. Hier wird der Volltextdatenbankeintrag zu diesem Dokument geladen und angezeigt.\r\nArchivhistorie\r\n-> Alle Datenbank Aktionen die mit diesem Dokument durchgeführt wurden, werden hier aufgelistet. Zum Beispiel Änderungen oder lesender Zugriff.\r\nKommentare\r\n-> Alle Stempel und Kommentare zu diesem Dokument werden aufgelistet.\r\nEnde Funktions-ID: 169 Modul-ID:69",
  "Url": "https://services.topfact.de/wiki/pages/view?g=d2f7b3e3-da1a-442c-a4e4-6b7c90e52c05"
}