{
  "PageID": 35839,
  "PageGuid": "5aa956fd-6a3f-4857-bd73-f9b9261e6cf2",
  "Title": "topfact6 MyWork - MyWork Archivsuche - Suchen",
  "Content": "Beginn Funktions-ID: 161 Modul-ID:72\r\nSuchen\r\nDas Menüband zeigt die aktuell verfügbaren Archive. Mit Klick auf eines der Archive wird ein Suchdialog geöffnet. Sind für dieses Archiv unterschiedliche Suchdialoge konfiguriert, öffnet sich zunächst ein Dropdown-Menü, indem Sie auf den gewünschten Suchdialog klicken, mit dem Sie die Archivsuche durchführen möchten. Sie können mehrere Archivsuchen nacheinander durchführen, die jeweils in einem separaten Fenster angezeigt werden. (1) Die Suche wird mit allen eingegeben Indexdaten und evtl. dem Suchbegriff der Volltextsuche durchgeführt. Es werden nur Dokumente gefunden, bei denen alle Suchparameter gegeben sind. Die Indexdatenfelder sind mit UND verknüpft d.h. fehlt oder unterscheidet sich ein Indexdatenwert eines Dokuments von den Suchparametern wird dieses Dokument nicht gefunden. (2) Mit Klick auf den Button \"Suchen\" wird das Archiv nach den Vorgaben durchsucht. Ein weiterer Tab wird generiert und die Suchergebnisse werden in einer separaten Ergebnisliste angezeigt. (3) Die Suche ist anschließend in \"Zuletzt gesucht\" zu finden, genaueres dazu in MyWork Dokumentenstruktur - Suchhistorie. Nur erfolgreiche Suchen werden gespeichert. \r\n\r\n\r\n\r\nParameter der Funktion\r\nSuchen und speichern\r\n-> Diese Funktion wird im Artikel MyWork Archivsuche - Suchen und speichern beschrieben\r\nexakte Suche / unscharfe Suche\r\n-> Diese Funktion wird im Artikel MyWork Archivsuche - exakte Suche aktiv, unscharfe Suche näher beschrieben\r\nHinweis\r\nDie Groß- und Kleinschreibung wird grundsätzlich nicht berücksichtigt. Die zurückgegebene Datenmenge ist auf 10.000 Treffer begrenzt, um eine zu lange Suchzeit zu unterbinden. Eine Eingrenzung über ein Indexfeld verringert die Anzahl der Daten. \r\nEnde Funktions-ID: 161 Modul-ID:72",
  "Url": "https://services.topfact.de/wiki/pages/view?g=5aa956fd-6a3f-4857-bd73-f9b9261e6cf2"
}