{
  "PageID": 35939,
  "PageGuid": "6ea18de1-6169-4741-bc49-b84f67f8eba5",
  "Title": "\ttopfact6 Administration - Administration MyWork - Dokumentenstruktur: Anlegen ",
  "Content": "Beginn Funktions-ID: 461 Modul-ID:83\r\nDokumentenstruktur: Anlegen \r\nÖffnet einen Dialog mit dem eine neue Dokumentenstruktur in MyWork angelegt werden kann. \r\n\r\n\r\n\r\nParameter der Funktion\r\nReiter Grundkonfiguration: Organisation\r\n-> Zu dieser Organisation gehört die Dokumentenstruktur.\r\nReiter Grundkonfiguration: Archiv\r\n-> Die Dokumentenstruktur greift auf dieses Archiv zu. Die Archive werden abhängig von der Organisation geladen.\r\nReiter Grundkonfiguration: Ergebnisdialog\r\n-> Dieser Ergebnisdialog ist der Dokumentenstruktur zugeordnet.\r\nReiter Grundkonfiguration: Name\r\n-> Bezeichnung der Dokumentenstruktur. Dieser Name ist in MyWork als Ordnername zu sehen.\r\nReiter Grundkonfiguration: Beschreibung\r\n-> Details zur Dokumentenstruktur werden beschrieben.\r\nReiter Grundkonfiguration: Einfache Struktur\r\n-> Wenn aktiviert kann eine Beleglist ohne Unterordner angelegt werden. Ist einfache Struktur aktiv deaktivieren sich einige Optionen im Reiter Ebenen. \r\nReiter Grundkonfiguration: Aktive Struktur\r\n-> Aktiviert die Dokumentenstruktur, nur aktive Dokumentenstrukturen sind im MyWork sichtbar.\r\nReiter Ebenen: Anlegen\r\n-> Legt eine neue Ebene der Dokumentenstruktur an.\r\nReiter Ebenen: Bearbeiten\r\n-> Die fokussierte Ebene kann mittels eines Dialogs bearbeitet werden.\r\nReiter Ebenen: Kopieren\r\n-> Kopiert die fokussierte Ebene.\r\nReiter Ebenen: Löschen\r\n-> Entfernt die fokussierte Ebene aus der Ebenenliste. Die Ebene ist in der Dokumentenstruktur nicht mehr sichtbar.\r\nReiter Ebenen: Aktualisieren\r\n-> Aktualisiert die Ansicht der Ebenenliste. Änderungen an den Ebenen werden evtl. erst nach einen Aktualisierung der Ansicht angezeigt. \r\nReiter Gruppe: Hinzufügen\r\n-> Gibt die Dokumenten Struktur für weitere Gruppen frei.\r\nReiter Gruppe: Entfernen\r\n-> Entzieht der fokussierten Gruppe den Zugang zur Dokumentenstruktur. \r\nReiter Gruppe: Aktualisieren\r\n-> Aktualisiert die Ansicht der Gruppenliste. Manche Änderungen werden evtl. erst nach Aktualisierung der Ansicht angezeigt. \r\nReiter Stempel\r\n-> Liste aller zur Verfügung stehenden Stempel. Klick auf die Checkbox fügt den Stempel zur Stempelliste der Dokumentenstruktur hinzu. Nur die angewählten Stempel stehen der Dokumentenstruktur in MyWork zu Verfügung.\r\nReiter Optionen: normaler Zustand\r\n-> Auswahl eines Symbols für den Ordner der Dokumentenstruktur in geschlossenem Zustand.\r\nReiter Optionen: geöffneter Zustand\r\n-> Auswahl eines Symbols für den Ordner der Dokumentenstruktur in geöffnetem Zustand.\r\nReiter Optionen: Textfarbe\r\n-> Auswahl der Testfarbe in der die Dokumentenstruktur in MyWork dargestellt wird.\r\nReiter Optionen: Textformatierung\r\n-> Wenn aktiviert wird der Text der Dokumentenstruktur in MyWork fett formatiert.\r\nEnde Funktions-ID: 461 Modul-ID:83",
  "Url": "https://services.topfact.de/wiki/pages/view?g=6ea18de1-6169-4741-bc49-b84f67f8eba5"
}