{
  "PageID": 35932,
  "PageGuid": "560f9631-5f1c-4606-a057-bdd58ae781f0",
  "Title": "\ttopfact6 Administration - Administration MyWork - Dialoge: Hinzufügen",
  "Content": "Beginn Funktions-ID: 471 Modul-ID:83\r\nDialoge: Hinzufügen\r\nÖffnet einen Dialog zum Anlegen eines neuen Dialoges. \r\n\r\n\r\n\r\nParameter der Funktion\r\nDialogart\r\n-> Auswahl welche Art von Dialog angelegt werden soll. Zur Verfügung stehen Such-, Ergebnis-, Änderungs- und Ablagedialog.\r\nReiter Dialog: Organisation\r\n-> Die ausgewählte Organisation wird mit dem Dialog verknüpft.\r\nReiter Dialog: Archiv\r\n-> Das ausgewählte Archiv wird mit dem Dialog verknüpft. Die verfügbaren Archive werden in Abhängigkeit von der Organisation geladen. \r\nReiter Dialog: Name\r\n-> Bezeichnung des Dialogs, diese sollte die aussagekräftig sein und Auskunft über die Dialogart geben.\r\nReiter Dialog: Ergebnisdialog\r\n-> Abhängig von der Dialogart des anzulegenden Dialogs, muss diesem evtl. ein Ergebnisdialog zugeteilt werden. \r\nReiter Dialog: Änderungsdialog\r\n-> Abhängig von der Dialogart des anzulegenden Dialogs, muss diesem evtl. ein Änderungsdialog zugeteilt werden.\r\nReiter Dialog: Ablagedialog\r\n-> Abhängig von der Dialogart des anzulegenden Dialogs, muss diesem evtl. ein Ablagedialog zugeteilt werden.\r\nReiter Dialog: Beschreibung\r\n-> Der Dialog wird hier beschrieben.\r\nReiter Dialogfelder: Bearbeiten\r\n-> Bearbeiten eines Dialogfeldes mittels eines Dialoges.\r\nReiter Dialogfelder: An erste Stelle\r\n-> Setzt das fokussierte Dialogfeld an die erste Stelle der Liste. \r\nReiter Dialogfelder: nach oben verschieben\r\n-> Verschiebt das fokussierte Dialogfeld in der Liste um eine Stelle nach oben. \r\nReiter Dialogfelder: nach unten verschieben\r\n-> Verschiebt das fokussierte Dialogfeld in der Liste um eine Stelle nach unten. \r\nReiter Dialogfelder: An letzte Stelle\r\n-> Setzt das fokussierte Dialogfeld an die letzte Stelle der Liste. \r\nReiter Dialogfelder: Einstellungen zurücksetzen\r\n-> Setzt die nicht gespeicherten Änderungen an den Positionen der Dialogfelder auf ihren ursprünglichen Zustand zurück. \r\nReiter Gruppen: Hinzufügen\r\n-> Öffnet einen Dialog mit dem man weiteren Gruppen den Dialog freigeben kann. \r\nReiter Gruppen: Entfernen\r\n-> Entzieht der fokussierten Gruppe den Zugang zum Dialog. \r\nReiter Gruppen: Aktualisieren\r\n-> Aktualisiert die Ansicht der Gruppen. Änderungen werden evtl. erst nach einer Aktualisierung der Ansicht angezeigt. \r\nfalscher Paremeter\r\n-> x \r\nfalscher Parameter\r\n-> x \r\nEnde Funktions-ID: 471 Modul-ID:83",
  "Url": "https://services.topfact.de/wiki/pages/view?g=560f9631-5f1c-4606-a057-bdd58ae781f0"
}