{
  "PageID": 35957,
  "PageGuid": "0a71a7a6-e543-48b3-9c39-3550598074b6",
  "Title": "topfact6 Administration - Administration MyWork - Stempel: Erstellen",
  "Content": "Beginn Funktions-ID: 480 Modul-ID:83\r\nStempel: Erstellen\r\nÖffnet einen Dialog mit dem ein neuer Stempel angelegt werden kann \r\n\r\n\r\n\r\nParameter der Funktion\r\nReiter Allgemein: Organisation\r\n-> Die Organisation wird mit dem Stempel verknüpft. \r\nReiter Allgemein: Archiv\r\n-> Das Archiv wird mit dem Stempel verknüpft. Die verfügbaren Archive werden abhängig von der Organisation geladen\r\nReiter Allgemein: Benennung\r\n-> Bezeichnung des Stempels, diese wird in MyWork angezeigt.\r\nReiter Allgemein: Beschreibung\r\n-> Beschreibt den Stempel \r\nReiter Allgemein: Stempel sofort speichern\r\n-> Wenn der Stempel auf einem Dokument angebracht wird, wird dies sofort gespeichert. \r\nReiter Allgemein: Stempel aktiv lassen\r\n-> Der Stempel bleibt aktiv nachdem er auf einem Dokument angebracht wurde. Der Stempel kann also mehrmals hintereinander verwendet werden ohne diesen jedes Mal anklicken zu müssen \r\nReiter Allgemein: Eindeutiger Stempel\r\n-> Dieser Stempel kann nur einmal pro Dokument genutzt werden. \r\nReiter Allgemein: Nach dem anbringen zum nächstem Dokument wechseln\r\n-> Wenn dieser Stempel auf einem Dokument angebracht wurde wechselt MyWork automatisch zum nächsten Dokument \r\nReiter Felder: Anlegen\r\n-> Legt ein neues Datenbankfeld an\r\nReiter Felder: Bearbeiten\r\n-> Ein Feld wird mittels eines Feldes bearbeitet\r\nReiter Felder: Löschen\r\n-> Entfernt das fokussierte Feld aus der Liste\r\nReiter Felder: Aktualisieren\r\n-> Aktualisiert die Ansicht der Felder. Änderungen werden evtl. erst nach Aktualisierung der Felder anzezeigt \r\nReiter Indexdaten: Anlegen\r\n-> Legt ein neues Feld für Indexdaten an\r\nReiter Indexdaten: Bearbeiten\r\n-> Bearbeitet das fokussierte Indexdatenfeld mittels eines Dialogs\r\nReiter Indexdaten: Löschen\r\n-> Entfernt das fokussierte Indexdatenfeld aus der Liste.\r\nReiter Indexdaten: Aktualisieren\r\n-> Aktualisiert die Ansicht der Indexdaten. Änderungen an den Indexdaten werden evtl. erst nach der Aktualisierung der Liste angezeigt \r\nReiter Darstellung: Hintergrundfarbe\r\n-> Auswahl der Farbe für den Hintergrund des Stempels\r\nReiter Darstellung: Rahmenfarbe\r\n-> Auswahl der Farbe für den Rahmen des Stempels\r\nReiter Darstellung: Textfarbe\r\n-> Auswahl der Farbe für den Text des Stempels\r\nReiter Darstellung: Rahmenbreite\r\n-> Einstellen einer Breite Für den Rahmen des Stempels\r\nReiter Darstellung: Schriftart\r\n-> Auswahl einer Schriftart\r\nReiter Darstellung: Schriftgröße\r\n-> Auswahl einer Schriftgröße\r\nReiter Darstellung: Layout\r\n-> Hier kann das Layout des Stempels erstellt werden\r\nReiter Darstellung: Vorschau\r\n-> Zeigt eine Vorschau des Stempels an. So wird der Stempel auch auf den Dokumenten aussehen. \r\nReiter Gruppen: Hinzufügen\r\n-> Gibt den Stempel für weitere Gruppen frei \r\nReiter Gruppen: Entfernen\r\n-> Entzieht der fokussierten Gruppe den Zugang zum Stempel \r\nReiter Gruppen: Aktualisieren\r\n-> Aktualisiert die Ansicht der Gruppen \r\nEnde Funktions-ID: 480 Modul-ID:83",
  "Url": "https://services.topfact.de/wiki/pages/view?g=0a71a7a6-e543-48b3-9c39-3550598074b6"
}