{
  "PageID": 36006,
  "PageGuid": "1b3c42dc-62d0-42f3-8b46-5530d839b0e8",
  "Title": "\ttopfact6 Administration - Administration MyWork FiBuConnect - Einstellungen: Bearbeiten",
  "Content": "Beginn Funktions-ID: 520 Modul-ID:85\r\nEinstellungen: Bearbeiten\r\nÖffnet einen Dialog zur Bearbeitung der fokussierten Einstellung. \r\n\r\n\r\n\r\nParameter der Funktion\r\nReiter Einstellungen: Indexdatenliste\r\n-> Liste Indexdaten, die für FiBuConnect Belege benötigt werden.\r\nReiter Optionen: Archivfeld\r\n-> Auswahl des Archivfeldes dessen Wert für die Bearbeitung von FiBuConnect ausschlaggebend ist. \r\nReiter Optionen: Wert\r\n-> Wert des Archivfelds der für einen bestimmten Zustand eines Belegs in FiBuConnect verantwortlich ist. Zum Beispiel Wert kontiert, wenn der Beleg kontiert ist.\r\nReiter Optionen: Buchungsperiode\r\n-> Auswahl des Datums welches die Buchungsperiode festlegt und festlegen des Formates der Buchungsperiode. \r\nReiter Optionen: Leistungsdatum\r\n-> Auswahl welches Datum als Leistungsdatum gesetzt wird und in welchem Format das Leistungsdatum angezeigt wird. \r\nReiter Kontierung: Pflichtfelder\r\n-> Festlegen welche Indexdatenfelder Pflichtfelder sind.\r\nReiter Kontierung: gesperrte Felder\r\n-> Auswahl von Feldern deren Einträge nicht verändert werden können.\r\nReiter Kontierung: Einstiegspunkt\r\n-> Auswahl des Einstiegpunktes für die Kontierung.\r\nReiter Kontierung: Benennung\r\n-> Benennung für die Soll und Haben Posten der Kontierung.\r\nReiter Export: Exporteinstellungen\r\n-> Hier können verschiedene Einstellungen für den Export festgelegt werden. Zum Beispiel das Exportformat, Ordner oder Archivfeld.\r\nReiter Export: SEPA Überweisung\r\n-> Angabe von Informationen für die SEPA Überweisungen. Zum Beispiel SEPA Ordner, Verwendungszweck oder Archivfeld.\r\nReiter DATEV\r\n-> Hier werden alle Einstellungen zu DATEV festgelegt. Zum Beispiel Versionsnummer, Kontonummer oder Exportordner.\r\nEnde Funktions-ID: 520 Modul-ID:85",
  "Url": "https://services.topfact.de/wiki/pages/view?g=1b3c42dc-62d0-42f3-8b46-5530d839b0e8"
}