{
  "PageID": 36198,
  "PageGuid": "a16e6db8-0674-49ae-aef3-f9da89b1f113",
  "Title": "\ttopfact6 Administration - Administration Organisation -  Anlegen",
  "Content": "Letzte Aktuallisierung am : 25.03.2024\r\nModul-ID : 100\r\nAdministration Organisation\r\nÜbersicht über die Organisationen. Organisationen können angelegt, bearbeitet und entfernt werden. \r\n\r\n\r\nBeginn Funktions-ID: 726 Modul-ID:100\r\nAnlegen\r\nÖffnet einen Dialog mit dem eine neue Organisation angelegt werden kann. \r\n\r\n\r\n\r\nParameter der Funktion\r\nAllgemeine Informationen\r\n-> Angabe von Allgemeinen Informationen über die Organisation. Zum Beispiel Name, Telefonnummer, Ort und Postleitzahl.\r\nBeschreibung\r\n-> Anlegen einer Beschreibung der Organisation.\r\nCloud Informationen\r\n-> Angabe von Informationen über die Cloud. Zum Beispiel Cloud Schlüssel, Cloud Abonnement und Transferordner.\r\naktive Organisation\r\n-> Markiert eine Organisation als aktiv.\r\nAuthentifizierung für Transferordner\r\n-> Aktiviert die Authentifizierung für den Transferordner. Angabe von Benutzername, Kennwort und Domäne für den Transferordner der Organisation. \r\nKennwortrichtlinie aktivieren\r\n-> Aktiviert die Kennwortrichtline für die Organisation. Alle Passwörter für die topfact6 Anwendungen dieser Organisation müssen die Anforderungen erfüllen. Es können die minimal Anzahl an Klein-, Großbuchstaben, Zahlen und Sonderzeichen festgelegt werden und wie lange das Passwort seine Gültigkeit behält. \r\n2-Faktor Authentifizierung\r\n-> Aktiviert die 2-Faktor Authentifizierung für die Organisation. \r\nAutomatisches Update aktivieren\r\n-> Aktiviert die Funktion automatische Updates durchführen. Angabe von Auto Update URL, Benutzername, Kennwort und Domäne für das Auto Update. \r\nBankeinstellung überprüfen\r\n-> Beim Programmstart wird die angegebene Bankverbindung überprüft. \r\nEnde Funktions-ID: 726 Modul-ID:100",
  "Url": "https://services.topfact.de/wiki/pages/view?g=a16e6db8-0674-49ae-aef3-f9da89b1f113"
}