{
  "PageID": 36238,
  "PageGuid": "190fdb97-f574-42b9-ab84-43d83809e080",
  "Title": "FAQ E-Mail-Versand aus topfact6 MyWork geht nicht",
  "Content": "Situation: \r\nDie Auswahl der Funktion \"Dokument senden\" in der Ergebnisliste oder im Quickindex öffnet Outlook nicht. Die Datei wird nicht an eine E-mail übergeben. In der Log-Datei von topfact6 MyWork taucht die Fehlermeldung \r\nERROR topfact.MyWork.Helpers.OfficeOutlookHelper SendToOutlook - Das COM-Objekt des Typs \"Microsoft.Office.Interop.Outlook.ApplicationClass\" kann nicht in den Schnittstellentyp \"Microsoft.Office.Interop.Outlook._Application\" umgewandelt werden. Dieser Vorgang konnte nicht durchgeführt werden, da der QueryInterface-Aufruf an die COM-Komponente für die Schnittstelle mit der IID \"{00063001-0000-0000-C000-000000000046}\" aufgrund des folgenden Fehlers nicht durchgeführt werden konnte: Fehler beim Laden der Typbibliothek/DLL.\r\nauf. \r\nErklärung:\r\nIn der regestry des Betriebssystems sind mehrere Outlook-Installationen hinterlegt. topfact6 MyWork kann nicht entscheiden, welche Outlook-Version die tatsächlich installierte ist und öffnet daher mit dem Befehl \"Dokument senden\" kein E-Mail-Programm.\r\n\r\nLösung 1:\r\nverfügbar ab Version 2024.4\r\nAktivieren Sie in Ihrem MyWork-Benutzereinstelluingen die E-Mail-Vorbereitung per MAPI und starten Sie MyWork neu.\r\n \r\nLösung 2:\r\nÖffnen Sie oder Ihr IT-Admin im Registrierungseditor den Registry-Pfad und entfernen alle untergeordneten Schlüssel, die nicht Ihrer installierten Version von Microsoft Outlook entsprechen. Alternativ kann auch das \"Reparaturtool für Microsoft Office\" genutzt werden. \r\nRegistry-Pfad: HKEY_CLASSES_ROOT\\TypeLib\\{00063001-0000-0000-C000-000000000046} \r\nVerwenden Sie die IID aus der Fehlermeldung als letzten Unterordner des regestry-Pfades\r\n·Outlook 2003 --> 9.2\r\n·Outlook 2007 --> 9.3\r\n·Outlook 2010 --> 9.4\r\n·Outlook 2013 --> 9.5\r\n·Outlook 2016 --> 9.6",
  "Url": "https://services.topfact.de/wiki/pages/view?g=190fdb97-f574-42b9-ab84-43d83809e080"
}