{
  "PageID": 36232,
  "PageGuid": "de778d1d-079f-4864-baf8-9b92ecc548e0",
  "Title": "Whitepaper topfact Signature",
  "Content": ".\r\nWhitepaper\r\n\r\ntopfact Signature\r\nZielsetzung des Whitepapers\r\nMit den topfact Whitepapers sollen Grundlageninformation für Entscheider und funktionsinteressierte Personen bereitgestellt werden. Es wird dargestellt welches Funktionsprinzip die Lösung beinhaltet, um Potentiale und Abhängigkeiten aufzuzeigen.\r\n\r\nLösungsbeschreibung\r\ntopfact Signatur ist ein Zusatzmodul für topfact JobServer, sowie ein Client für topfact6 MyWork zur Übergabe von Dokumenten aus dem topfact Archiv an einen Unterschriftsablauf. Der Vorgang wird über den Unterschriften Anforderer angestoßen. Er entscheidet über Layout und Art der Unterzeichnung als einfache, fortgeschrittene oder qualifizierte Signatur. Der oder die Unterzeichner können digital signieren oder die Signatur ablehnen. Das signierte Dokument fließt selbständig zurück ins topfact Archiv.\r\n\r\nSignaturvorgänge erzeugen grundsätzlich Verbrauchskosten.\r\n\r\nVorgehensweise\r\nDer Unterschriften Anforderer ist ein topfact MyWork Anwender. Er wählt ein Dokument aus und übergibt dies an den Unterschriftsablauf.\r\nDer Unterschriftsablauf läuft außerhalb des Kundennetzwerks und bindet externen Personen als Unterzeichner mit ein. Unterzeichner können aufgefordert werden wahlweise mit einfacher, fortgeschrittener oder qualifizierter Signatur zu unterzeichnen. Der oder die Unterzeichner werden vom Workflow automatisch per E-Mail angeschrieben.\r\nSignatur Arten\r\ntopfact Signatur bietet drei Signatur Arten. Der Unterschriften Anforderer kann entscheiden welche Signatur Art für das Dokument angewandt werden soll.\r\n\r\n1.Die einfache Signatur kann über eine einfache Namenseingabe oder Übergabe eines Bildes erfolgen.\r\n2.Für die fortgeschrittene Signatur werden biometrische Daten gesammelt, z.B. die Unterzeichnung auf einem Signatur-Pad. Das Abbild der Unterschrift, Zeitpunkt und Geräteinformationen dienen dann als Datengrundlage.\r\n3.Im Falle der qualifizierten Signatur muss sich der Unterzeichner gegenüber dem Vertrauensdienst ausweisen. Sie gilt als die Signaturart mit der höchsten Rechtssicherheit und ist gleichzeitig, die Variante mit den höchsten Kosten und Hürden in der Durchführung. Die Daten des Unterschriftsablaufs werden zentral gespeichert und gemeinsam mit dem signierten Dokument an das topfact System zurück übergeben.\r\nKernleistungen\r\n·Unterschreiben: PDF-Dokumente können mittels vordefinierter Signaturfelder unterschrieben werden. Optional können Signaturfelder durch den Anwender eingefügt werden.\r\n·Ausfüllen: Formularfelder in PDF-Dokumenten können ausgefüllt werden. Optional können Formularfelder durch den Anwender eingefügt werden.\r\n·Sicherer Online-Zugang: Externen Prozessbeteiligten (z.B. Kunden oder B2B-Partnern) kann ein sicherer Online-Zugang ermöglicht werden. Damit können Dokumente selbstständig und zu einem beliebigen Zeitpunkt elektronisch ausgefüllt und unterschrieben werden.\r\n·Unterstützung von Online-Beratung: Elektronische Unterschriften können während eines ScreenSharings direkt auf das Smart-Device des Kunden initiiert werden. Dafür muss keine native App installiert werden.\r\n·Plattform-unabhängig: topfact Signatur setzt als Client lediglich einen Browser voraus und ist dadurch auf allen gängigen Hard- und Softwareplattformen einsetzbar.\r\n·Vorgangsverwaltung: topfact bietet standardmäßig eine Vorgangsverwaltung. Sie ermöglicht die Übersicht zu schwebenden (unterbrochenen) und abgeschlossenen Unterschriftsvorgängen.\r\nZielgruppe\r\nDie Zielgruppen für topfact Signatur sind topfact Anwender die über Vertragsvorgänge, Protokolle oder Auftragserteilungen einen Vorteil durch die direkten Abwicklungen von Unterschriften ohne Wartezeiten haben.\r\ntopfact Cloud\r\nDie Bereitstellung der Leistung für den Cloudkunden erfolgt als „Software as a Service“, siehe auch Whitepaper topfact Cloud.\r\n\r\nLösungsablauf\r\nDurchführung eines Signaturvorgangs mit topfact6 Signatur (Prozessdarstellung).\r\n\r\n\r\nLösungskomponenten\r\nAnwendung topfact6 MyWork\r\ntopfact6 MyWork ist die Anwendung zur Bereitstellung der Dokumente aus dem topfact Archiv. Weitere Informationen finden Sie auch im Whitepaper topfact6 MyWork.\r\n\r\ntopfact6 Modul QuickIndex\r\nÜber QuickIndex werden Dokumente aus MyWork heraus geöffnet und dargestellt. Der Unterschriften Anfordernden kann in QuickIndex den Signaturprozess aktivieren. Voraussetzung ist, dass der Anfordernde als MyWork Anwender über eine topfact6 Signatur Client Lizenz verfügt.\r\n\r\nWorkflow des Unterschriften Anfordernden\r\nDer Signatur Anfordernde kann die Anzahl und Art der Signaturen, sowie die Mailadresse der Signierenden und die Reihenfolge bestimmen. Weiterhin kann er verschiedene weitere Elemente wie Foto-Anforderungen, Textanforderungen und Fristen mitgeben. 1) 2)\r\n\r\nWorkflow der Unterzeichner\r\nDer oder die Unterzeichner können das Dokument prüfen und dann unterzeichnen oder die Unterzeichnung ablehnen. 2)\r\n\r\nUnterzeichner Identifikation für qualifizierte Signatur\r\nIm Rahmen des Workflows für Unterzeichner wird ein Vertrauensdienst angesprochen. Falls dem Unterzeichner keine gültige Identifikationsmethode zur Verfügung steht, kann ein Identifikationsvorgang aktiviert werden. 1) 2)\r\n\r\ntopfact6 JobServer Signatur\r\nDer topfact6 JobServer Signatur überwacht die Workflows und liefert die Datenveränderungen zurück an den topfact Vorgang.\r\n\r\ntopfact6 JobServer Module\r\nWeitere JobServer Module können den gewünschten Dokumentenprozess vervollständigen, wie \r\nE-Mailnachrichten an Bearbeiter senden oder das Setzen der Vertragsgültigkeit.\r\n\r\nStrukturen zur Übersicht \r\nDurch Dokumentstrukturen in MyWork kann das unterzeichnete Dokument aktiv in die weiteren Arbeitsprozesse aufgenommen werden.\r\n\r\nAnalyse Report\r\nÜber Gültigkeits- und Verfügbarkeitsanalysen kann automatisch ermittelt werden, zu welchen Vorgängen Unterzeichnungen fehlen oder Dokumente ihre Gültigkeit verloren haben. \r\n\r\nPush Nachrichten per E-Mail\r\nIm Rahmen des Workflows werden Nachrichten, Erinnerungen und Abschlussberichte per E-Mail versendet.\r\n\r\nHinweise\r\n1) Im Rahmen der Abwicklung entstehen Verbrauchskosten, je Unterschriftsvorgang und zusätzlich je Identifikationsvorgang.\r\n2) In dieser Lösungskomponente sind externe Dienstleister eingebunden. Die Liste der externen Dienstleister finden Sie im Anhang.\r\n\r\nAbgrenzung\r\ntopfact Signatur unterstützt Sie bei der effizienten Abwicklung Ihrer Unterschriftsvorgänge und der Speicherung von Unterschrifts- und Verlaufsdaten. Die Planung, Kontrolle und die Durchführung von Unterzeichnungsvorgängen werden dadurch einfacher und konkreter. \r\n\r\nDie Entscheidung welcher Art die Unterschrift sein soll, sowie die damit zusammenhängende Bewertung der Rechtssicherheit oder des Identifikationsverfahren des Unterzeichners, ist vollständig dem Anwender überlassen und wird durch topfact nicht verantwortet. Lediglich das daraus resultierende Vorgangsergebnis wird von topfact zurückgemeldet.\r\n\r\n\r\nAnhang\r\nListe der externen, am technischen Prozess beteiligten Unternehmen.\r\nUnternehmen\r\nArt der Prozessbeteiligung\r\nZugriff auf welche Daten\r\nD-Trust GmbH\r\nKommandantenstraße 18\r\n10969 Berlin\r\nDeutschland\r\nBereitstellung von Diensten für qualifizierte elektronische Signaturen\r\nAlle Informationen, die zum Erstellen und Signieren qualifizierter Zertifikate benötigt werden.\r\ninSign GmbH\r\nAm Bäckeranger 2\r\n85417 Marzling\r\nDeutschland\r\nBereitstellung von Diensten für Signaturworkflows\r\nAlle Informationen, die zum Erstellen und Signieren qualifizierter Zertifikate benötigt werden. \r\n.",
  "Url": "https://services.topfact.de/wiki/pages/view?g=de778d1d-079f-4864-baf8-9b92ecc548e0"
}