{
  "PageID": 36289,
  "PageGuid": "f86e8374-11a6-48a0-9b45-23abdda11a11",
  "Title": "Whitepaper topfact FormRecognizer",
  "Content": "Whitepaper\r\n\r\ntopfact FormRecognizer\r\nZielsetzung des Whitepapers\r\nMit den topfact Whitepapers sollen Grundlageninformation für Entscheider und funktionsinteressierte Personen bereitgestellt werden. Es wird dargestellt welches Funktionsprinzip die Lösung beinhaltet, um Potentiale und Abhängigkeiten aufzuzeigen.\r\n\r\nLösungsbeschreibung\r\ntopfact FormRecognizer ist ein Zusatzmodul für den topfact6 JobServer zur automatischen Erkennung von Inhalten auf Rechnungs-Dokumenten. Dabei werden typische Belegwerte wie Rechnungsdatum, Absender oder Beträge von gescannten Rechnungen oder PDF Dateien. Der Vorgang kann für beliebige Dokumente im topfact Archiv! vollautomatisch angestoßen werden. Das Dokument wird im topfact Archiv! direkt mit allen erkannten Indexdaten aktualisiert, sobald die Erkennung abgeschlossen ist und steht danach zur weiteren Verarbeitung zur Verfügung. Erkennungsvorgänge erzeugen grundsätzlich Verbrauchskosten pro Datei/Dokument.\r\n\r\nVorgehensweise\r\nDer FormRecognizer übergibt neue Eingangsrechnungen direkt nach der Archivierung mit dem Erkennungsprozess. Dabei ist es nicht relevant, ob die Rechnung manuell, per Scan oder per E-Mail archiviert wurde. \r\nDas Dokument wird zur Erkennung an einen externen Prozess übergeben. Dieser ermittelt über einen Algorithmus und Volltexterkennung typische Rechnungsmerkmale. Während des Erkennunsvorgangs erhält das Dokument ein frei festlegbares Attribut, damit Nutzer den Status im Archiv erkennen können oder das Dokument vorübergehend unsichtbar ist.\r\nNachdem der Erkennungsvorgang abgeschlossen ist, werden die erkannten Indexdaten entsprechend der Konfiguration in die Archivfelder des Dokuments gespeichert. Typischerweise werden hier die Felder Belegnummer, Belegdatum, Belegbetrag, Geschäftspartner, etc. gesetzt.\r\nDer finale Status des Dokuments sorgt dann dafür, dass es in den weiteren Prozesslauf übergeht.\r\n\r\nKernleistungen\r\n• automatische Verschlagwortung: Eingangsrechnungen oder -Gutschriften werden in einen vollautomatischen Prozessablauf archiviert, erkannt und verschlagwortet werden, ohne dass ein manuelles Eingreifen nötig ist.\r\n\r\n• hohe Erkennungsrate: topfact FormRecognizer nutzt diverse Algorithmen und Machine Learning um typische Indexdaten für Rechnungen und Gutschriften zu erkennen. Die hohe Trefferquote wird durch eine Optimierung der Algorithmen auf Rechnungen und Gutschriften sichergestellt.\r\n\r\n• Verbrauchsbedingte Abrechnung: topfact FormRecognizer automatisiert Ihre bisher manuellen Tätigkeiten und entlastet Ihr Unternehmen finanziell durch die dokumentengenaue Abrechnung. Somit können sich ihre wertvollen Mitarbeiter um wichtigere Aufgaben kümmern.\r\n\r\nZielgruppe\r\nDie Zielgruppe für topfact FormsRecognizer sind Unternehmen, die eine hohe Anzahl an Eingangsrechnungen verarbeiten und Zeitnah abwickeln müssen. Insbesondere kann die vollautomatische Erkennung und Verschlagwortung personelle Engpässe im Büro auflösen und den Rechnungsdurchlauf verkürzen.\r\n\r\ntopfact Cloud\r\nDie Bereitstellung der Leistung für den Cloudkunden erfolgt als „Software as a Service“, siehe auch Whitepaper topfact Cloud.\r\n\r\nLösungsablauf\r\nAblauf einer automatischen Verschlagwortung mit topfact6 FormsRecognizer (Prozessdarstellung).\r\n\r\n\r\nLösungskomponenten\r\ntopfact6 JobServer Modul FormsRecognizer\r\nDas topfact6 JobServer Modul FormsRecognizer überwacht das Archiv auf neu zu verarbeitende Rechnungen und Gutschriften und aktualisiert die fertig erkannten Dokumente in einem festgelegten zeitlichen Intervall.\r\n\r\ntopfact6 JobServer Module\r\nWeitere JobServer Module können den gewünschten Dokumentenprozess vervollständigen. Beispielsweise tägliche E-Mail-Nachrichten an Bearbeiter senden, automatische Erkennung und Zuordnung zu Projektakten oder Kostenträgern oder das Setzen der Vertragsgültigkeit.\r\n\r\nStrukturen zur Übersicht \r\nDurch Dokumentstrukturen in MyWork können die Dokumente überwacht oder nach Verarbeitung aktiv in die weiteren Arbeitsprozesse aufgenommen werden.\r\n\r\nHinweise\r\n1) Im Rahmen der Erkennung entstehen Verbrauchskosten je verarbeitetem Dokument.\r\n2) In dieser Lösungskomponente sind externe Dienstleister eingebunden. Die Liste der externen Dienstleister finden Sie im Anhang.\r\n\r\nAbgrenzung\r\ntopfact FormsRecognizer unterstützt Sie bei der automatischen Inhaltserkennung und Verschlagwortung von Dokumenten, insbesondere von Eingangsrechnungen.\r\n\r\nErkannte Werte haben eine hohe Zuverlässigkeit und Genauigkeit müssen aber vor der weiteren Verarbeitung wie z.B. Kontierung, Buchung oder Zahlung auf ihre logische Konsistenz geprüft werden. Eine logische Prüfung der Dokumente findet nicht statt. Fehlerhafte oder unvollständige Erkennung einzelner Dokumente kann nicht ausgeschlossen werden.\r\n\r\nAnhang\r\nListe der externen, am technischen Prozess beteiligten Unternehmen.\r\nUnternehmen\r\nArt der Prozessbeteiligung\r\nZugriff auf welche Daten\r\nHypatos GmbH\r\nAm Neuen Markt 9 E-F\r\n14467 Potsdam\r\nBereitstellung von Diensten zur automatischen Erkennung von Dokumenteninhalten und Volltext\r\nDokumente als PDF, Volltextinhalte der Dokumente\r\nMicrosoft Deutschland GmbH\r\nWalter-Gropius-Straße 5\r\n80807 München\r\n\r\nMicrosoft Corporation\r\nOne Microsoft Way\r\nRedmond, WA 98052-6399\r\nUSA\r\nBereitstellung von Diensten zur automatischen Erkennung von Dokumenteninhalten und Volltext\r\nDokumente als PDF, Volltextinhalte der Dokumente\r\n.",
  "Url": "https://services.topfact.de/wiki/pages/view?g=f86e8374-11a6-48a0-9b45-23abdda11a11"
}