{
  "PageID": 36285,
  "PageGuid": "2d34b7da-137f-4055-9a91-94cac1a6c380",
  "Title": "Fehlende Dokumente aus fehlerhafter ERP Übergabe",
  "Content": "Frage\r\nAus dem ERP-System wurde ein Dokument zur Archivierung übergeben. Dieses liegt nicht im Archiv. Woran kann das liegen und wie kann das vermieden werden?\r\nAntwort / Lösung\r\nDie Übergabe aus dem ERP erfolgt in der Regel als Dateipärchen: Die zu übergebende Datei und eine Datendatei (meist XML-Format) als Hinweis auf die Ablagebegriffe. Bei Fehlern ist die häufigste Ursache das Fehlen der Datendatei. Damit weiß topfact nicht, wie die Datei abzulegen wäre und überspringt diese. \r\n\r\nAm einfachsten ist es, wenn Sie Ihre ERP Abholordner und den topfact Failed Ordner regelmäßig kontrollieren. Falls dort Dateien von gestern oder älter liegen konnte, die Ablage nicht erfolgen und wird auch nicht mehr geschehen. Diese Dateien dann einfach per Drag & Drop auf das entsprechende Projekt in MyWork ziehen und manuell ablegen.\r\n\r\nAls Alternative zur manuellen Ablage kann eine automatischen Bereinigung stattfinden. Diese legt die Dateien einfach ohne inhaltliche Suchbegriffe ab, sorgt aber für den Zugriff per Volltext und die Bereitstellung über einen definierten Ablauf, damit dies durch die Anwender bearbeitet werden kann. Dazu holt ein Filereader Job die fehlerhaften Dateien einmal täglich ab und stellt diese den Anwender in einer Dokumentenstruktur zur Bearbeitung bereit. \r\n\r\nBeispielablauf\r\n\r\nAchtung: Voraussetzung ist das vorherige Verschieben der zu bearbeitenden Dateien in einen temp. Verarbeitungsordern von topfact. Nur diesen temp. Verarbeitungsordern von topfact über das nachfolgende System laufen lassen, da der Filereader die abgeholten Dateien aus allen Unterverzeichnissen endgültig löscht und dies in anderen Verzeichnissen ungewollte Auswirkungen haben kann.\r\n\r\n1.Die Aufgabe läuft nur einmal am Tagesende, als letzte Abwicklung von ERP-Belegen\r\n2.In der Aufgabe laufen zwei Konfigurationen: Einmal die Bereinigung des temporären Abholverzeichnisses, einmal die Bereinigung des Failed Verzeichnisses\r\n3.Anwender können diese Dateien kontrollieren entscheiden was damit zu tun ist\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\nBei der Archivierung die Verschlagwortung so setzen, dass die Belege in einer Dokumentenstruktur gezielt abgearbeitet werden können.\r\n\r\n\r\n\r\n\r\n\r\nBei der Archivierung die Verschlagwortung so setzen, dass die Belege in einer Dokumentenstruktur gezielt abgearbeitet werden können.\r\n\r\n\r\nKontrolle der Anwender über die Dokumentstuktur",
  "Url": "https://services.topfact.de/wiki/pages/view?g=2d34b7da-137f-4055-9a91-94cac1a6c380"
}