{
  "PageID": 36293,
  "PageGuid": "4ee138fd-0d48-4f89-8c37-39ffcbab5dfa",
  "Title": "Whitepaper topfact Cloud",
  "Content": "Whitepaper\r\n\r\ntopfact Cloud\r\nZielsetzung des Whitepapers\r\nMit den topfact Whitepapers sollen Grundlageninformation für Entscheider und funktionsinteressierte Personen bereitgestellt werden. Es wird dargestellt welches Funktionsprinzip die Lösung beinhaltet, um Potentiale und Abhängigkeiten aufzuzeigen.\r\n\r\nLösungsbeschreibung\r\nDie topfact Cloud ist eine Systemumgebung welche für Kunden ohne eigene Server bereitgestellt wird. Die topfact Cloud beschreibt die Zusammenstellung und Konfiguration mehrerer topfact Produkte zu einem einheitlichen Komplettsystem. Dieses Komplettsystem beinhaltet beispielsweise ein oder mehrere Archive, Benutzer und Gruppen des Kunden inkl. der Verwaltung von Funktions- und Zugriffsrechten, Automatismen und Hintergrunddienste wie automatische Rechnungsarchivierung aus E-Mail Postfächern, Abholung von ERP Dateien oder Integration von ERP Datensätzen. \r\n\r\nDie topfact Cloud wird durch die topfact AG konfiguriert, betrieben und gewartet und für Cloudkunden als „Software as a Service“ bereitgestellt. Die Kunden greifen auf ihre Cloud Archive mit der Windows Anwendung MyWork Cloud zu oder können den topfact WebClient nutzen.\r\n\r\nVorgehensweise\r\nDie Anwender der Cloudkunden installieren die Anwendung topfact MyWork Cloud und können Sich mit Ihren individuellen Benutzerkonten aus dem Büro oder von zu Hause anmelden. Es können ein oder mehrere Archive pro Kunde eingerichtet werden. Beispielsweise ein allgemeines Archiv für die Buchhaltung, ein Personalarchiv oder Verwaltungsarchive für andere Geschäftsbereiche. Mitarbeiter die von unterwegs aus arbeiten, können über die mobilen Apps \"topfact MyWork Mobile\" (iOS und Android) auf Projektakten, Lieferscheine oder andere Dokumente in den Archiven zugreifen.\r\nScandokumente, Dateien aus dem ERP System oder die Stammdaten der Kunden/Lieferanten aus dem ERP System können über den topfact Transfer Service direkt aus beliebigen Drittsystemen oder Dateipfaden in die topfact Cloud synchronisiert werden. Damit stehen Ihnen alle Stammdaten (Kostenträger, Projektakten, Kunden- & Lieferanten, etc.) auch im Cloud Archiv zur Verschlagwortung der Dokumente zur Verfügung. Verschiedene Module ermöglichen auch eine vollautomatische Zuordnung ihrer Dokumente zu den korrekten Projekten, Kunden oder Lieferanten.\r\nE-Mail Postfächer (z.B. Eingangsrechnungen oder Korrespondenzen) können auch in der Cloud automatisiert überwacht und archiviert werden, egal ob Sie einen eigenen Exchange Server, M365 Accounts oder sonstige Mailservices nutzen.\r\nZur einfachen Verwaltung der Nutzeraccounts, Lizenzen und Gruppen steht eine Synchronisation mit Ihrem Microsoft Active Directory oder zur Verfügung.\r\nInnerhalb der Anwendung MyWork oder den mobilen Apps stehen Ihnen flexible prozessbegleitende Funktionen bereit um beispielsweise den Dokumentenfluss von Eingangsrechnungen zu steuern, Freigabestempel durch Mitarbeiter setzen zu lassen oder eine Vorkontierung durchzuführen. \r\nFür alle archivierten Dokumente wird vollautomatisch der Volltext extrahiert, um den Nutzern eine schnelle und genaue Suche über alle Archive zu ermöglichen.\r\n\r\nKernleistungen\r\nJe nach gewählten Paketen und Lizenzen stehen Ihnen verschiedene Funktionen zur Verfügung\r\n·ein oder mehrere Archive mit beliebig Konfigurierbaren Feldern, Zugriffsrechten und flexibel skalierbarem Speicherplatz\r\n·Zugriff über die MyWork Anwendung (Windows), den WebClient (Browser) oder die mobilen Apps (iOS / Android).\r\n·Zugriff über eine API Schnittstelle oder WebHooks zur Integration von Drittanwendungen oder eigenen Entwicklungen\r\n·Kalkulierbare Abrechnung: Je nach Anzahl der Nutzer und verwendetem Speicherplatz werden planbar Mietkosten in Rechnung gestellt. Zusätzliche Dienstleistungen, Konfigurationen oder Schulungen durch Experten der topfact AG sind nach Bedarf buchbar.\r\n·Standard-Konfigurationen für gängige Automatismen wie z.B. die Verarbeitung von Scandateien, Ablage von ERP Dateien, Abholung von E-Mails und Anhängen, synchronisation von ERP Stammdaten, etc.\r\n·Konfigurationen für Prozessabläufe wie z.B. Eingangsrechnungsprüfung, Kontierung, etc. stehen bereit und können individuell nach Kundenbedarf angepasst werden.\r\n\r\nCloud-Leistungen\r\n·Zuverlässiges und performantes Hosting in einem deutschen Rechenzentrum (mehr Informationen zum Rechenzentrum)\r\n·tägliches Plattform Backup der gesamten Infrastruktur durch den Hoster\r\n·zusätzliches tägliches Plattform-unabhängigen Backups Ihrer Daten und Dateien (mehr Informationen zum Backup der Cloud)\r\n·hohe IT Sicherheit durch Hardware und Software Firewalls sowie Verschlüsselung aller Dateien am Speicherort\r\n\r\nZielgruppe\r\nDie Zielgruppe für die topfact Cloud sind Unternehmen, die keine zusätzlichen eigenen Server \"on Premise\" betreiben und warten möchten oder deren IT Strategie insgesamt offen für einen Cloudbetrieb ist.\r\n\r\nLösungsskizze\r\n\r\n\r\n\r\nLösungskomponenten\r\ntopfact Archiv!\r\nDas topfact Archiv! ist das Herzstück des Systems. Hier werden Dateien verschlüsselt abgelegt und GoDB Konform aufbewahrt. Über Zugriffsrechte auf Gruppenebene können einzelne Nutzer mehr Dokumente zugreifen als andere. An jedes Dokument können weitere Dateien (z.B. Lieferscheine, Leistungsnachweise, etc.) angehängt werden. Dokumente werden mit strukturierten Indexdaten verschlagwortet damit sie eindeutig Kunden, Lieferanten, Projekten oder Kostenträgern zugeordnet werden können. Von archivierten Dateien wird direkt in der Cloud der Volltext extrahiert damit die Nutzer durch eine einfache Suche Ihre Dokumente schnell wieder finden können. Pro Dokument steht eine Änderungshistorie zur Verfügung. Außerdem kann ein Dokument durch Mitarbeiter bearbeitet und versioniert wieder gespeichert werden. \r\ntopfact Archiv! API\r\nÜber die topfact Archiv API oder integrierten WebHooks ist es möglich Drittsysteme oder eigene Entwicklungen direkt an das topfact Archiv anzubinden. Eine ausführliche Dokumentation und Unterstützung bei der Eigenentwicklung steht bereit.\r\ntopfact Transfer Service\r\nDer topfact Transfer Service dient als Schnittstelle zwischen dem Kundennetzwerk und der topfact Cloud. Über diese Komponente werden Dateien oder Daten in die Cloud hochgeladen.\r\nAußerdem können über den Transfer Service die Nutzeraccounts und Gruppenzuordnung aus dem lokalen Microsoft Active Directory der Domäne übernommen werden. Damit ist es den IT Administratoren der Kunden möglich direkt neue Nutzer in der topfact Cloud anzulegen oder bestehende Nutzer in andere Gruppen zu verschieben.\r\ntopfact6 JobServer Module\r\nIm topfact JobServer laufen diverse Module zur Automatisierung als Hintergrundprozess. Diese Automatismen sorgen vollautomatisch für \r\n·Archivierung von ERP Dokumenten (z.B. Ausgangsrechnungen oder Lieferscheinen)\r\n·Archivierung von Scandokumenten (inkl. Seitentrennung bei Stapelscan, Barcodeerkennung, etc.)\r\n·Archivierung von E-Mails und Anhängen aus einem oder mehreren Postfächern\r\n·Verschlagwortung von Eingangsrechnungen durch ZugFerd / FacturX / eRechnung oder automatisierter KI Erkennung anhand des Volltextes\r\n·tägliche Erinnerungsnachrichten an Bearbeiter senden (via E-Mail oder in MS Teams Kanäle)\r\n·automatische Erkennung und Zuordnung zu Projektakten oder Kostenträgern oder das Setzen der Vertragsgültigkeit\r\nDen Kunden der topfact Cloud stehen alle JobServer Module ohne zusätzliche Lizenzkosten bereit. Für wenige Module entstehen zusätzliche Verbrauchskosten (z.B. Signatur, Formularerkennung)\r\ntopfact6 MyWork (Windowsanwendung)\r\nMit der Windowsanwendung topfact MyWork Cloud können Mitarbeiter des Kunden von jedem Arbeitsplatz oder aus dem Home Office auf die Archive zugreifen, Dokumente finden, anzeigen oder bearbeiten. Hier steht die komplette Bandbreite der Archiv- und Prozessfunktionen bereit. Dokumente können bearbeitet, versioniert, exportiert und per E-Mail versendet werden. Die Indexdaten einzelner oder mehrerer Dokumente können direkt mit den synchronisierten Stammdaten aus dem ERP System verschlagwortet werden. Stempel und Annotationen ermöglichen eine einfache Rechnungsprüfung, Zuweisung zu Kollegen oder Freigabe von Eingangsrechnungen. Über die Funktion FibuConnect können Rechnungen direkt Kontiert und an ein Buchhaltungssystem oder den Steuerberater übergeben werden.\r\nDie beliebte Funktion der Dokumentenstrukturen ermöglicht eine gezielte manuelle Ablage von Dateien per Drag and Drop zu einem bestimmten Kunden, Lieferanten oder einer Projektakte. Die Verschlagwortung passiert dabei automatisch ohne weitere manuelle Eingaben. In den Strukturen können auch ganze Prozessketten wie der Eingangsrechnungsprozess, Freigabe und Prüfung transparent abgebildet werden. Durch Parameter wie Skontotermine oder Gültigkeitsdaten von Verträgen können die Mitarbeiter auf wichtige Situationen aufmerksam gemacht werden.\r\nEin integriertes Aufgabensystem, Berichte, Dokumentenvorlagen und der Möglichkeit zur digitalen Unterschrift macht MyWork zum zentralen Arbeitsmittel.\r\ntopfact6 MyWork Mobile App (iOS / Android)\r\nÜber die mobilen Apps können Außendienstmitarbeiter oder Bauleiter ebenfalls auf Rechnungen, Preislisten, Lieferscheine oder Verträge zugreifen oder direkt auf der Baustelle wichtige Fotos von Mängeln oder Unfällen zum richtigen Projekt zuordnen und archivieren. \r\nGeschäftsführer oder Projektleiter können in der App direkt von unterwegs Rechnungen freigeben oder anderen Kollegen zur Bearbeitung zuordnen.\r\ntopfact Archiv WebClient\r\nIm topfact Archiv WebClient können einzelne Dokumente direkt im Browser angezeigt werden. Der Zugriff erfolgt ebenfalls durch einen topfact Archiv Nutzeraccount benötigt jedoch keine Installation von MyWork oder einer mobilen App. Insbesondere für den direkten Aufruf aus Drittsystemen wie z.B. dem ERP System ist diese Anzeigeform geeignet.\r\nIm WebClient stehen nur eingeschränkte Funktionen zur Verfügung.\r\n\r\nHinweise\r\n1) Die Basiskonfiguration des topfact Cloud Systems enthält Standardprozesse und Standardautomatismen. Bei Bedarf können zusätzliche Prozesse nach Wunsch des Kunden implementiert werden. Die Aufwände für Anpassungen werden nach Aufwand berechnet.\r\n2) Einige Komponenten sind nicht in jedem Cloud Paket enthalten. Es können Lizenzkosten oder Verbrauchskosten entstehen.\r\n3) In dieser Lösungskomponente sind externe Dienstleister eingebunden. Die Liste der externen Dienstleister finden Sie im Anhang.\r\n4) Alle Nutzer der topfact Cloud erhalten automatisch neue Updates der Anwendungen bereitgestellt. Die Installation bzw. Aktualisierung dieser Anwendungen führt der Kunde selbst durch.\r\n5) Zur Synchronisation von Dateien und Stammdaten zwischen dem Kundennetzwerk und der topfact Cloud muss vom Kunden ein Windows-System für den \"Transfer Service\" bereitgestellt werden.\r\n6) Um den reibungslose Nutzung der topfact Cloud sicherzustellen muss sich der Kunde selbst um die nötigen Systemvoraussetzungen kümmern (mehr Details zu den Systemvoraussetzungen)\r\n\r\nAbgrenzung\r\nDas topfact Cloud System wird von Experten der topfact AG betrieben und konfiguriert. Damit ist die Möglichkeit zur eigenen Konfiguration oder eigenständigen Anpassung eingeschränkt. Bei Anpassungen an technischen Automatismen oder Kundenprozessen durch Mitarbeiter der topfact AG entstehen Kosten.\r\nBei der Miete des topfact Cloud Systems als \"SaaS\" entstehen keine Ansprüche auf den Besitz der Software. Die topfact AG stellt das System zur Nutzung bereit und behält sich technische Änderungen vor.\r\n\r\nAnhang\r\nListe der externen, am technischen Prozess beteiligten Unternehmen.\r\nUnternehmen\r\nArt der Prozessbeteiligung\r\nZugriff auf welche Daten\r\nLuftEngineering GmbH\r\nSielminger Str. 68\r\n70771 Leinfelden-Echterdingen\r\nwww.Luft-IT.de\r\nBereitstellung von Server-Infrastruktur in einem Rechenzentrum in Frankfurt.\r\nDienstleistungen für Webhosting, Domainregistrierung und -verwaltung, Serverhosting, Rechenzentrumsarbeiten sowie alle damit im Zusammenhang stehenden Handlungen.\r\nVerschlüsselte Archivdaten, Dokumente während des Transfers, Backup von Datenbanken und Archivspeicher\r\nMicrosoft Deutschland GmbH\r\nWalter-Gropius-Straße 5\r\n80807 München\r\n\r\nMicrosoft Corporation\r\nOne Microsoft Way\r\nRedmond, WA 98052-6399\r\nUSA\r\nBereitstellung von zuverlässigen und sicheren Speicherorten für Backups\r\nBereitstellung von Diensten zur automatischen Erkennung von Dokumenteninhalten und Volltext\r\nDokumente als PDF, Volltextinhalte der Dokumente\r\nBackup von Datenbanken und Archivspeicher\r\n.",
  "Url": "https://services.topfact.de/wiki/pages/view?g=4ee138fd-0d48-4f89-8c37-39ffcbab5dfa"
}