{
  "PageID": 36291,
  "PageGuid": "78de6c48-7d84-40ae-84b3-f83d0050dceb",
  "Title": "Organisation der Archivzugriffsrechte über Datenpflegemaske bereitstellen - dynamische Archivprofile",
  "Content": "Frage\r\nWie kann ich auf Dokumentenzugriffe im Archiv auf Bereiche oder Belegarten meinen Kollegen im laufenden Betrieb direkt zur Verfügung stellen oder den Zugriff entziehen?\r\nAntwort / Lösung\r\ntopfact gewährt die Archivzugriffe über Zugriffsprofile. Diese sind ähnlich einer SQL-Abfrage funktionierend. Beispiel: Wenn in Feld Belegart = \"Lieferschein\" dann ist der Zugriff erlaubt. Die Änderung der Profile nimmt in der Regel ein Administrator nach Bedarf vor.\r\n\r\nSoll die sich die Zugriffsunktion aber dynamisch verändern können, also durch einen SuperUser der aber keine topfact Administration verwenden soll oder kann, ist das über eine logische Weiche möglich. Der Vorteil dieser Lösung ist die sofortige Wirksamkeit und die Bedienbarkeit durch Anwender ohne Administrationszugang. Dafür ist der Aufbau mit ein paar Schritten durchzuführen die sonst nicht notwendig wären.\r\nAufbau\r\nDie logische Weiche kann eine Datenpflege Tabelle sein. Diese hat zwei Inhaltsspalten\r\n1. den Zugriffsbereich (Feld im Archiv für Bereich oder andere Abgrenzungen wie Belegart o.ä.)\r\n2. die Zugriffsgruppe (Benutzergruppe für das Archiv)\r\nBeispielansicht Datenpflege zur Steuerung, welche Gruppe darf auch welchen Bereich zugreifen.\r\n\r\n\r\nDas Archiv verweist ebenfalls auf ein Bereichsfeld welches die gleichen Inhalte aufweist:\r\n\r\n\r\nVerbindung über ein Archivprofil (Indexprofil)\r\nDie Daten im Archiv und in der Datenpflegetabelle stehen für sich und haben keine Verbindung. Erst durch die Suchabfrage des Benutzers im Archiv kann die Verbindung über das Zugriffsprofil für die Benutzergruppe erfolgen.\r\nIm Zugriffsprofil stehen beliebige feste Merkmale ( techn_status = 'ok' ) und die dynamische Abfrage auf die Datenpflegetabelle, die zum Zeitpunkt der Dokumentensuche ausgeführt wird:\r\n    techn_status = 'ok'\r\n  and Bereich in (SELECT Bereich\r\n  FROM [topfact6Sync].[dbo].[Datenpflege_Verwaltung_Gruppe_Bereich] where [Verwaltungsgruppe] = 'Verwaltungsarchiv Controlling')",
  "Url": "https://services.topfact.de/wiki/pages/view?g=78de6c48-7d84-40ae-84b3-f83d0050dceb"
}