{
  "PageID": 36314,
  "PageGuid": "0d88376e-11a4-4186-b79d-517680e53373",
  "Title": "FAQ Optimale Einstellungen für Image- und OCR-Server",
  "Content": "\r\n\r\nEmpfohlene Einstellungen für topfactArchiv ImageServer\r\nDer topfactArchiv ImageServer erzeugt aus Archivdateien einzelne Seiten und stellt diese für die Volltexterkennung dem topfactArchiv OCRServer zur Verfügung.\r\n\r\nFür optimale Ergebnisse sind folgende Einstellungen empfehlenswert:\r\n\r\n\r\n\r\nErstellen des Vorschaubildes (z.b. Quickindex)\r\nDiese Option sollte nur aktiviert werden, wenn das Archiv in der Mehrzahl viele Dateien enthält, die keine PDF-Dateien sind, bspw. *.eml, #+.msg oder *.docx-Dateien. Bei Aktivierung erstellt der ImageServer dann ein Vorschaubild der ersten Seite und legt dieses zusätzlich im topfactArchiv ab. Dadurch kann die Datei schneller im Quickindex angezeigt werden während der Quickindex im Hintergrund die eigentliche Archivdatei umwandelt in ein anzeigbares Format. Wenn das Archiv vor allem aus PDF-Dateien besteht, entsteht kein Geschwindigkeitsvorteil.\r\n\r\nSeitentrennung DPI Größe:  400 \r\ndie Volltexterkennung ist bei größerer Auflösung besser. Die Dateien werden nur temporär bereitgehalten und nach erfolgreicher Verarbeitung entfernt\r\n\r\nTexterkennung für PDF/A Dateien aktivieren: Aktivierung empfohlen\r\nFür PDF/A Dateien kann der ImageServer ggf. den Volltext direkt aus der Datei extrahieren ohne den OCR-Server. Das beschleunigt die Volltexterkennung stark. Betroffen sind vor allem digital erstellte und versendete Dateien.\r\n\r\nSchwellenwert für erkannten Text: 50\r\nDamit der Image-Server den Text direkt aus der PDF/A Datei extrahiert, wird vorher eine Prüfung auf den erkannten Text durchgeführt. Wenn dieser unterhalb des eingestellten Schwellenwertes steht, wird die Datei trotzdem an den OCR-Server zur Erkennung übergeben. \r\nAchtung: Falls in speziellen Fällen einzelne Dokumente nicht mit Volltext erkannt werden könnte es an diesem Wert liegen. Dieser Wert prüft nur die erste Seite des PDF. Dokumente mit einem Deckblatt und wenigen Worten könnte dazu führen, dass der Schwellwert nicht erreicht wird.\r\n\r\nEmpfohlene Einstellungen für topfactArchiv OCRServer\r\nDer tofpactArchiv OCRServer extrahiert aus den vom ImageServer bereitgestellten Seitenbildern den Volltext und trägt diesen in die Volltextdatenbank ein. \r\n\r\nFür optimale Ergebnisse sind folgende Einstellungen empfehlenswert: \r\n\r\nTesseract Version: Tesseract 5\r\nAusgewähltes OCR-Erkennungstool --> Google Tesseract 5 bietet erfahrungsgemäß die besten Ergebnisse\r\n\r\nErkennungsmethode: LSTM Engine\r\nAusgewählte Erkennungsengine\r\n\r\nVerarbeitung: Genauigkeit (Best)\r\ngewählte Bibliothek zur Erkennung - Best bietet die besten Ergebnisse, geschätzte Erkennungsdauer pro Seite ca. 20 Sekunden\r\n\r\nSeitensegmentierung: Automatic page segmentation with OSD (gültig ab Version 2024.7.1.1, vorher default Wert auswählen)\r\n\r\nSeitendrehung erkennen und bei Bedarf neu ausrichten: aktivieren (erst ab Version 2024.7.1.1)",
  "Url": "https://services.topfact.de/wiki/pages/view?g=0d88376e-11a4-4186-b79d-517680e53373"
}